{"REPLY":[{"date":"2023-03-11T22:35:05.388121Z","msg":"@eh\nthe cs only works when the program is saved for the first time. if you add it after it's initially saved, it won't work :P"},{"date":"2023-03-11T01:00:54.444506Z","msg":"You're absolutely fine, thanks for letting me know! :D"},{"date":"2023-03-10T15:30:50.283365Z","msg":"$[\"DR\", 2, \"astronomers\"]$"},{"date":"2023-03-09T15:07:15.669467Z","msg":"currently i'm most in love with the griffin, but the wolf is a close second.\n\nwho's gonna win? that depends on who signs up for who."},{"date":"2023-03-08T18:20:47.121186Z","msg":"i'm sure you've grown in your skills since then xD"},{"date":"2023-03-08T17:50:52.83724Z","msg":"looks legit, bro! :D"},{"date":"2023-03-08T16:39:08.673527Z","msg":"as promised: https://www.khanacademy.org/computer-programming/cs/4895309862060032\n\ni did a bit of a physics overhaul, sorry about that. make sure to note that some parts of these physics are borrowed from ski (like a line or two though, nothing huge).\n\nthe movement right now is trash, you can always change it if you see fit. it's just to test the camera right now, i'm aware that the final version will have a different movement system."},{"date":"2023-03-08T16:14:23.294817Z","msg":"no, we're getting six brand new avatars for the comp this year!"},{"date":"2023-03-08T15:57:30.983962Z","msg":"yay! maybe you'll captain again :D"},{"date":"2023-03-08T15:27:45.086879Z","msg":"i'm co-hosting primavera with ski and astro this year :D"},{"date":"2023-03-08T13:28:20.52722Z","msg":"do you mean it, dad? :D\n\nlol this is a blank program it's not anything"},{"date":"2023-03-08T01:28:53.342808Z","msg":"say no more sir, i'll get right on it. it'll be done by tomorrow night.\n\ni'll try. saturday is definitely a safer bet than sunday, but if i get all my calc homework done before the weekend i'm home free."},{"date":"2023-03-08T01:11:20.332609Z","msg":"hello!\n\ni'm more set to dive into nitty-gritty details at this point. anything i can preferably do on my own?"},{"date":"2023-03-07T14:21:50.933287Z","msg":"ah nice nice\nthat would be sad tho, i like coding so having not much time to do it would be unfortunate\n\nlol i just played it\ni like the sounds\nother than that it's annoying because of the glitches xD\n\n:DDDDDDDD"},{"date":"2023-03-07T14:03:46.692274Z","msg":"i hope so :D\nalthough it sounds like i might be doing a spring sport next year so not sure how that would affect my time :P\ndid i miss it? was it just not marketed enough? how did i not see it o.O\n\n:DDDDDD"},{"date":"2023-03-07T13:32:08.57665Z","msg":"that's true, but only because i've been applying myself for the last year and a half. it's fun to watch all the work i put into this finally pay off xD\ntimothy hyped it up, i didn't really deserve to be there :P\nhaha *cringe*\n\n:DDDD"},{"date":"2023-03-07T12:13:22.826591Z","msg":"it means that i don't care about it\n\n*I* didn't find a KA bug lol\n\n:DD"},{"date":"2023-03-07T02:18:29.542725Z","msg":"i could have argued more but it was useless so i felt like dropping it\n\nbah humbug\n\nlol in some ways\n\n:D"},{"date":"2023-03-07T00:14:56.310382Z","msg":"but mine was first >:D\n\npointless to argue though, so i'll let you have the w this time"},{"date":"2023-03-06T20:22:21.37937Z","msg":"didn't say mine was better, i said it was first.\n\nthis is a better option:\n```\nfunction capsToggle(str) {\n  return str.split(\"\").map(c => Math.random() > 0.5 ? c.toUpperCase() : c.toLowerCase()).join(\"\");\n}\n```\nand i'm sure ski could go better than that.\n\nmine was first tho >:D"},{"date":"2023-03-06T19:30:15.25678Z","msg":"It's a hosting platform for websites\nBasically it's what allows him to take his code and make it available on the internet on his own website for everyone to see"},{"date":"2023-03-04T21:01:37.650392Z","msg":"i'm sure it'll be great :D"},{"date":"2023-03-04T21:01:22.893495Z","msg":"thanks!"},{"date":"2023-03-04T13:10:03.727129Z","msg":"Thanks! I appreciate any work you can get done."},{"date":"2023-03-04T01:05:22.505338Z","msg":"Literally the same kind of layout you did last year. Design choice is up to you, but preferably make it give off some sort of different vibe than the one you made last year.\n\nSorry this is kind of vague, it's just the same competition so it'll have the same basic needs. Home, About, Participants, Leaderboard, etc. Maybe include a separate schedule page if it's possible where we can list out the challenges in more detail."},{"date":"2023-03-04T00:45:18.557944Z","msg":"You would have eighteen days, we're going live on the 21th.\n\nNo pressure. I have backup devs if you don't feel comfortable putting it out in that timeframe."},{"date":"2023-03-03T22:09:32.931598Z","msg":"nOOoOoOO :(\n\n_moves to france in order to become french toast_"},{"date":"2023-03-03T22:03:55.049158Z","msg":"_nods at sprout_\n_unplugs and devours the toaster_"},{"date":"2023-03-03T22:01:52.37709Z","msg":"there's just a surplus of half-baked ideas, stupid memes, and bad practices on the HL atm. i don't know why it ticks me off :P\n:DDD"},{"date":"2023-03-03T22:00:40.668495Z","msg":"_runs away and straight-up dives into a pond_\n\n_runs back and eats the toaster_\nwhat doesn't kill you tastes good, right?"},{"date":"2023-03-03T21:50:38.655063Z","msg":"_gets angry and yeets TV_"},{"date":"2023-03-03T21:50:04.446112Z","msg":"i was mad, sue me\n:D"},{"date":"2023-03-03T21:38:01.079169Z","msg":"_steals Sprout's popcorn_\n\nwhere were we?\n\n_loud, obnoxious munching with a smug look of glee directed at Sprout_"},{"date":"2023-03-03T21:32:26.43712Z","msg":"you should! it's gonna be neat and different this year, some really original challenges and contest flow :D"},{"date":"2023-03-03T21:24:14.510541Z","msg":"Thanks! I'm co-hosting along with Astro and ski. Liam didn't have enough time to comfortably run the comp this year, so he handed over the reigns."},{"date":"2023-03-03T19:02:52.431601Z","msg":"it's going to be difficult. the thought right now is that we'll use an off-KA API library to grab the posts, and then maybe use another library to auto-update the program.\n\nwe'll figure something out though, it's not doable to simply manually update after each T&T is posted :P"},{"date":"2023-03-03T13:28:38.490564Z","msg":"ik as someone taking chemistry it's hugely satisfying to see the model done right :D\n\nalthough it could be argued whether it's a particle or an atom :P"},{"date":"2023-03-02T13:48:23.621085Z","msg":"oh no! when are you leaving?\n\nlol"},{"date":"2023-03-02T12:53:33.90131Z","msg":"you probably can, it's just not how i do things. if i had to guess why, it's because you have to check and change the y of every block before you can change any x. not sure why, but it's definitely strange.\n\nofc!\n\ni've been there. failing sucks :P\nhopefully this helps in some way. feel free to copy freely if you need to, it's not really my code at the end of the day."},{"date":"2023-03-02T12:15:53.528011Z","msg":"_master_ of humility of course wow amazing\n\nnot when this starts. this thing wakes up the beast for some reason xD\n\nlol stop it's not funny\nkachow\ni'm sure\nofc :D"},{"date":"2023-03-02T12:12:56.169572Z","msg":"haha i was gonna dm you but i thought i'd let you find it by yourself"},{"date":"2023-03-02T02:07:52.561769Z","msg":"i feel threatened xD\n\n:D\n\nnot any large ones besides they should be like creatures and such. the WCC ones are a good example, but they should probably look a bit more professional than some of those xD\n\nthere were, and i'd probably prefer you doing six as well. there are a ton of applicants (like more than 200 last year), so it's good to have as many teams as possible.\n\nidk tbh\njust rolling with it\ngetting ready to actually take this off the ground and it's a bit nerve-racking."},{"date":"2023-03-02T01:36:32.082642Z","msg":"what am i supposed to do, _argue_?\n\nyep :D\nyeah, if you could make them so that each stage is just easily positionable and stuff it would be great. i can take care of making them thumbnail-ready.\n\nno animation, just 5 static stages for each avatar would be fine.\n\nthank you! that sounds great. idk whether ski was thinking six like last year, but starting with five different avatars sounds like a great idea.\n\ni appreciate it :)"},{"date":"2023-03-01T18:53:43.834858Z","msg":"indentation is hugely important. the sad thing is that a lot of people don't realize that they can literally just run their code through a formatter before they show it off to the world.\n\nlike you can write the sloppiest code ever but at least have the decency to run it through a formatter. little to no work for you, and it saves a lot of confusion when other people look at your code."},{"date":"2023-03-01T17:54:03.516788Z","msg":"yes you are lol\n\nit's ok if you don't think you'll have the time.\nthey would just be like the previous avatars for primavera. some mythical creatures.\nlast year: https://www.khanacademy.org/computer-programming/primavera-2022/6556387095134208\n\nthe same sets have been reused a few times and i don't really want to do that again :P\nsayy the 18th? sooner is better than later.\njust a random bag of fierce-looking creatures. last year, the team i was on was called Terratrice, and they had a mean-looking golden eagle. ski's team was called Mountaintop, and they had a weird lizard thingy. just look at previous ones for inspiration.\n\nand by all means if you feel like it's too much, that's fine! i know you got a lot on your plate."},{"date":"2023-03-01T14:14:52.464228Z","msg":"thanks :D"},{"date":"2023-03-01T13:23:30.44935Z","msg":"@astro\njust wanted to let you know that i'll be a bit busier lately, so if it's possible that i don't get a huge task i would appreciate it :P\nstill planning to be active but just a bit less so.\n\nthe idea sounds nice. i like how you incorporated some of the previous ideas!"},{"date":"2023-03-01T12:48:57.092195Z","msg":"i didn't make minecraft lol, this lacks a lot of the features that it has.\nlol no! go back to minecraft, it's much better than this is xD"},{"date":"2023-03-01T12:47:41.293641Z","msg":"haha sorry!\n\nthanks :)\nyeah, the art and the code have both been made. i just wasn't comfortable incorporating them into the demo because i didn't have any way to kill them xD"},{"date":"2023-03-01T12:46:20.386651Z","msg":"dang it\nthat stings a bit. you just hit me with such good reasons i was bamboozled, o.O.\n\ntangent time!\nwould you in any way be interested in making some avatars for primavera? not sure how many will be needed yet, just wanted to know if you were up to the challenge, :P."},{"date":"2023-03-01T02:16:06.081023Z","msg":"astro did tho\ni have no good comebacks for that tbh\ni've been defeated ?"},{"date":"2023-03-01T00:55:40.945095Z","msg":"@astro\nis aqua officially gone? if so we should look at getting another graphics artist :P"},{"date":"2023-02-28T23:48:27.384906Z","msg":"idk he was running around too fast"},{"date":"2023-02-28T23:30:05.976794Z","msg":"it's a library that makes making programs with webgl easy, made by dat. you might know him as the guy who made karlson."},{"date":"2023-02-28T22:27:28.787944Z","msg":"Awesome, thank you!"},{"date":"2023-02-28T21:54:47.464784Z","msg":"He said he's fine, but he's gonna be inactive for about a week in the beginning of May. I should be able to get someone to cover for him at that point though, so it shouldn't be an issue."},{"date":"2023-02-28T21:45:14.627611Z","msg":"I'd be down, I'd just have to check with him and possibly get another host if he can't do it.\nSorry to hear it. You're free to pick someone else to host but I'd definitely be free to do it this year.\n\nEdit: He's good to co-host."},{"date":"2023-02-28T21:15:22.278998Z","msg":"lol\ni would say that's about right. you, i and astro are all doing CoC atm. in fact, i'd have you wait until about two weeks after CoC because I'm looking at making another event happen that might keep me a bit busy for those first couple weeks after CoC ends :P"},{"date":"2023-02-28T20:59:35.208274Z","msg":"funny story mr. bloluc619,\ni actually had pineapple pizza today and while i will concede that it was delicious, i was not converted. pepperoni pizza is still king in my book."},{"date":"2023-02-28T15:06:57.298356Z","msg":"I've got Polar's KA extension, which imho is arguably better"},{"date":"2023-02-28T15:04:30.46995Z","msg":"the demo thing is annoying, and i wish we would have finished more. however, considering this was a product of about two days give or take a few hours I think we did great :D\n\nand yes i would know lol half of my program are demos"},{"date":"2023-02-28T14:53:49.655323Z","msg":"yep it might be unfortunate\nluckily i don't see this ever becoming more than a demo. i do plan to remake paper minecraft at some point though, and that'll be better thought-through"},{"date":"2023-02-28T12:23:27.052891Z","msg":"What he said."},{"date":"2023-02-28T12:23:07.343637Z","msg":"thanks :D"},{"date":"2023-02-28T12:22:57.733903Z","msg":"yessir"},{"date":"2023-02-28T12:22:45.347071Z","msg":"Thank you! It's because there aren't many blocks. Add a few hundred more, and it'd be lag city xD"},{"date":"2023-02-28T12:22:18.852914Z","msg":"good observation, i'll see what i can do about preventing that"},{"date":"2023-02-28T12:21:29.850788Z","msg":"smart man\nbut you can't even select it to break it so joke's on you"},{"date":"2023-02-28T12:20:56.746066Z","msg":"yes i was boutta say the big man had no part in this whatsoever\n\nbut thank you :D"},{"date":"2023-02-28T12:20:11.001706Z","msg":"yay thank you dad!\n\nfantastic, glad it's accurate. we have added large holes in the ground where bases can be made :D\n\nline 862. change the timer variables to something smaller (like 1) for instant breaking. idk what it would do if you set it to 0, it might break it :P"},{"date":"2023-02-28T12:17:42.249897Z","msg":"morning all :)"},{"date":"2023-02-27T21:43:21.900079Z","msg":"Was kind of my fear. There's a lot of crap going on behind the scenes that'll mess things up pretty easily if you don't know exactly what you're doing - and to that end, even if you know what you're doing.\n\nKeep your program up though, I could take a look and tell you what's going wrong. Chances are it's the image loading."},{"date":"2023-02-27T21:26:12.768147Z","msg":"i knew you would want to build higher so i told the team not to make it possible >:D\n\nthanks!\nit is :O\n\nhmph, >:(."},{"date":"2023-02-27T21:24:08.844085Z","msg":"NIKO did a fantastic job with the textures, I agree! :D"},{"date":"2023-02-27T21:23:43.242926Z","msg":"Solid, YB! Take a shot, I'll put whatever you have into this project when you finish :)"},{"date":"2023-02-27T20:23:01.201966Z","msg":"thanks :)\n\nhonestly i'd love to try terrain gen, but i've been pushing back math hw that's due tonight so i could finish this. now i need to get that done.\n\npretty sure everyone else on the team is 100% lost on how to continue work on this as well, so i think unfortunately this is where we will stay."},{"date":"2023-02-27T19:58:37.50774Z","msg":"```\n{\nnames: \"Akbaba, NIKO, YokieBob, DR\",\ncaptain: \"Astro\",\nlink: \"https://www.khanacademy.org/computer-programming/marscraft-coc/4589028248961024\"\n},\n```"},{"date":"2023-02-27T19:50:46.720394Z","msg":"thanks! :D"},{"date":"2023-02-27T19:50:16.379312Z","msg":"thank you!"},{"date":"2023-02-27T19:50:09.806794Z","msg":"thanks!"},{"date":"2023-02-27T19:49:58.079492Z","msg":"thanks :)\nand yeah, that's probably true."},{"date":"2023-02-27T19:29:09.786044Z","msg":"*MarsCraft - Team Astronomers*\nhttps://www.khanacademy.org/computer-programming/marscraft-coc/4589028248961024"},{"date":"2023-02-27T18:35:19.399658Z","msg":"@NIKO\nit's been great working with you too, you made some pretty dope art that kinda makes the game what it is :)\n\n@Akbaba\nwe thought about an infinite world but in the end it just would have suffered from lag issues because we couldn't handle it properly. I'm going to make the world as large as I can without noticeable frame decrease, but it's not gonna be infinite.\n\nas for the axe, i think that's a good idea. I'll try to figure something out for that."},{"date":"2023-02-27T17:59:26.739509Z","msg":"i don't think that would fit very well. i could try to put it on the loading screen, but that might lag a bit because i wouldn't be able to use it until i loaded it :P\n\ni'll just submit it then, we can always change stuff later"},{"date":"2023-02-27T17:33:25.852403Z","msg":"hey niko, i've got nothing specific. if you can find a way to improve the program, go for it. other than that i think we're ok."},{"date":"2023-02-27T17:26:58.163045Z","msg":"lol\n\nyeah it's probs gonna be this way unfortunately. we just don't have enough time to finish anything else. the fact that we got this far is a miracle, you can't appreciate the hours of work that this took."},{"date":"2023-02-27T16:52:53.225058Z","msg":"Ok, I'll add the intro.\nAgreed, we should have thought about it earlier. I'll take a look. You're good! I'm really happy with everything you got done :)"},{"date":"2023-02-27T15:30:03.972002Z","msg":"hey guys!\n\ni've finished pretty much everything except scene management, and i'm debating whether we even put a title screen in. thoughts?\n\nany other thoughts on completing the game? i'm probably going to submit it this afternoon, i don't feel good about putting the AI in at this point."},{"date":"2023-02-26T19:31:20.338016Z","msg":"Finally got it working after about 5 hours of debugging. Turns out you can't reference something before you actually define it, who knew? :P\n\nAs you probably know, we're within the final 48 hours. I still need someone to tackle *making scenes like a menu or an instructions page*, general juicing of the game, like particles when you break a block, and *rigging of the player*. I'm finishing block placing by tonight, and that'll be the basic game flow. I need to add an inventory and we'll be good.\n\nThanks for your work on this everyone, I appreciate it. We need to get top points on this because I'm not sure how the other group's entry is going to turn out at this point :P"},{"date":"2023-02-26T19:00:22.617428Z","msg":"yw! :D"},{"date":"2023-02-26T01:44:29.270147Z","msg":"ok, not fixed. no idea. literally i can fix it and it works fine, but on page reload, it breaks. i'm just so over it rn, i'll take a look tomorrow :P"},{"date":"2023-02-25T23:55:33.542861Z","msg":"fixed. it was an odd \"feature\" regarding the use of var instead of let or const.\n\ni'm working on camera constraints and block placing. once i'm done with that, it's the player rigging and scene management.\n\ni've just been informed that i have some conflicts tomorrow that will limit my time working on this. if one of you could tackle player rigging or scene management, i would be super grateful. should be back on by monday morning to finish block placing and clean."},{"date":"2023-02-25T21:57:29.71816Z","msg":"not sure why, but i'm seeing it too. working on a fix atm."},{"date":"2023-02-25T15:52:46.528561Z","msg":"Block breaking is done. next up is block placing.\n\nI'm going to try to get a peaceful version working by Sunday night so I have all the time possible to think about adding mobs.\n\n@YB keep working on generation, I'm ready to implement it as soon as you finish :)\n\nCan anyone think about other ways to improve this? Currently the only thing about mobs I need to be handled is damage, like hitting them and they take damage."},{"date":"2023-02-24T23:33:48.961002Z","msg":"thanks Akbaba!"},{"date":"2023-02-24T21:28:46.006373Z","msg":"i've reassembled some logic in the physics engine that fixes some things. let me know if you notice any weird behavior :P"},{"date":"2023-02-24T18:42:16.337572Z","msg":"same to you :)\nyes go make more things revive the hl"},{"date":"2023-02-24T12:36:41.084514Z","msg":"by the end of today I'll have put the physics engine and the art in this project.\n\n@akbaba\nany chance you can attempt a simple AI or is that above your paygrade? it would just need to follow the same physics as the player, spawn in randomly, and approach the player if it's close enough.\n\n@niko\nit's looking great, thanks for all your hard work and for assembling it in a way that's easy to port xD\n\nall hands on deck, gentlemen. we're into the final couple days."},{"date":"2023-02-24T12:31:18.279033Z","msg":"That's fine. I'm getting the physics engine worked out by the end of today, and we can spend the weekend assembling the final product. Might look back into chunks later, but as of right now we have no time. Any idea on the cap of blocks we can make without major lag?"},{"date":"2023-02-23T18:48:07.247097Z","msg":"confirmed polar is 21262"},{"date":"2023-02-22T22:13:48.768613Z","msg":"@Akbaba don't actually worry about the physics engine at this point, I'll make some modifications and make it work. I didn't realize it didn't have any block objects xD\n\n@YB\nIf you can, I'd like you to take full lead on generation for now. I'll be a bit busy over the next couple of days getting the bare bones of the engine scrapped together so I need you to be thinking and maybe even attempting to implement the generation. Sorry to leave you hanging, I didn't realize how much we still had to do :P"},{"date":"2023-02-22T19:28:35.111456Z","msg":"ah, ok. that's interesting :D"},{"date":"2023-02-22T15:56:47.468226Z","msg":"yes please, start screen logo would be appreciated.\n\nok, great!\n\nmaybe tools? idk how far we would get so a sword and a pickaxe would be the safest bet."},{"date":"2023-02-22T15:04:58.006711Z","msg":"indeed"},{"date":"2023-02-22T14:39:40.172183Z","msg":"amen to that\nsomeday it'll all be over"},{"date":"2023-02-22T14:27:00.827504Z","msg":"your days are numbered, Promise"},{"date":"2023-02-22T13:37:21.264169Z","msg":"haha it's for a team astro collab\ncoming out on monday, stay tuned"},{"date":"2023-02-22T13:28:23.998739Z","msg":"happy ash wednesday to you all :)\n\ni made a graphic last year but it got hidden so yeah :P\njust this elite group of subbers celebrating this year.\n\nwishing you all a blessed lent and a joyful easter when it arrives!\n`remember you are dust, and to dust you shall return.`"},{"date":"2023-02-22T13:23:11.077774Z","msg":"@Akbaba\nyeah actually i was wondering if you could make some modifications to the engine - mainly the fact that the physics currently require the player to have the same width and height, which, as demonstrated by the player hitboxes niko made, is not going to be the case. \n\ncould you work it out so that it works with the player width and height being different numbers? thanks :)"},{"date":"2023-02-21T20:23:31.762026Z","msg":"Right. About drawing the sprites, I was gonna cache them all at the beginning and assign a special character to each type. This character is how we would represent them in the chunk (a string of characters is one row of the chunk, which is an array of said rows).\n\nSounds good about the block objects, and though messy, it looks like really the only way we can do it. Just say if the sprite's position is less than so and so away then we'll make it into a block - else we remove it as a block if it is one.\n\nThat's what I was thinking, that we only loop through (and draw blocks of) chunks that are visible. Maybe every time the use switches a chunk, every block in the chunk is converted to a block. That might be the best way to switch, but we'd have to kinda cut down on the chunk size to be efficient.\n\nOn the bright side, that would mean there were only as many block objects in existence at one time as the size of a chunk."},{"date":"2023-02-21T20:21:19.83349Z","msg":"how is your group doing, Astro?"},{"date":"2023-02-21T20:11:51.667897Z","msg":"seconded, mr. niko. nice work :)"},{"date":"2023-02-21T19:15:48.092068Z","msg":"can you explain your thought process? i'd love to hear it."},{"date":"2023-02-21T19:02:16.911832Z","msg":"i haven't yet. probs gonna do that rn"},{"date":"2023-02-21T19:02:01.181164Z","msg":"thanks man, appreciated"},{"date":"2023-02-21T18:36:58.10655Z","msg":"i don't really care. i'll be the first to admit that i would have no idea to go about doing that, so if you're doing it, please make it super easy to incorporate. it would look pretty sweet though"},{"date":"2023-02-21T18:08:40.927196Z","msg":"minecraft"},{"date":"2023-02-20T19:55:39.130283Z","msg":"So you're saying store objects instead of instances? That seems like it would be faster, though it might shoot organization in the foot."},{"date":"2023-02-20T19:43:42.220997Z","msg":"glad it's gonna be a feature tho.\nnext time i'll just file an issue so you can figure it out yourself >:D"},{"date":"2023-02-20T19:41:01.889728Z","msg":"yeah, i was thinking that you spawn with like 5 on each side and when you go beyond that more are spawned. not sure how that would work when we draw them though.\n\ndid you have any different ideas on any part of that? if not, we can start thinking about how to implement."},{"date":"2023-02-20T19:36:15.527302Z","msg":"hello!\n\nlet's jump right in - here's my idea that i've been mulling over for a bit.\n - the world is generated in chunks (first i was thinking 16 by 256, but now i'm thinking 30 by 200 or something).\n - each chunk is stored as an array of strings inside another array (the world array).\n```\n// chunk of 10 by 5\n[\n  '1111111111',\n  '1111111111',\n  '1111111111',\n  '1111111111',\n  '1111111111'\n]\n```\n - when we loop through bricks, we only loop through the currently inhabited chunk to minimize lag.\n - we edit chunks and save them in the world array when blocks are destroyed or added\n - basically, all data is stored in the world array but only a chunk is processed at a time, so we can handle huge amounts of chunks on either side (giving the illusion of infinite world generation?)"},{"date":"2023-02-20T19:27:35.73434Z","msg":"hey!\ni actually would like you to hop into the other thread as well so we can chat about the finer points of generation without spamming the rest of the gang."},{"date":"2023-02-20T19:08:44.754094Z","msg":"'afternoon, everyone!\n\nHere's what the next seven days are looking like. After this post, I'd appreciate it it everyone moved to the new thread I'm making. It'll be easier to scroll through comments (which is getting annoying :/).\n\nMonday (2/20): @Akbaba finishes physics engine\nTuesday (2/21): @NIKO finishes sprites; @DR and @YB begin generation\nWednesday (2/22): Sprites are added to the physics engine (@Akbaba?), CODE IS CLEANED AND OPTIMIZED\nThursday (2/23): Hopefully generation is finished (fingers crossed)\nFriday (2/24): Last day for vitals, scene management(@DR? @YB?)\nSaturday (2/25): Juicing and cleaning\nSunday (2/26): Juicing and cleaning\nMonday (2/27): @DR submits finished product by 1159 PM EST\n\nHere's a list of stuff that needs to get done if you feel like picking up an empty task:\n - image loading with @NIKO's graphics\n - incorporating akbaba's physics into a starter program [DR]\n - *BLOCK BREAKING*. Crucial.\n - scene management\n - generation [DR + YB]\n - add sprites to program\n - maybe AI? back burner, probs not gonna get it done.\n\nIf you all could chime in with things you could do in the new thread, it would be great. If y'all could, I'd appreciate it if you could check into KA at least two times a day and spend at least 10 minutes a day even cleaning code. I really, really don't want to let this sit and then have to grind on the weekend. I can't. We need to have a largely finished program by Saturday.\n\n@Akbaba\neveryone but Mojo and Fer Fer was inactive and unable to continue, so they just disbanded and their members went to other teams.\n\n@NIKO fantastic. they're looking insane."},{"date":"2023-02-18T16:37:13.668218Z","msg":"@NIKO\nyou're free to go if you like, but astro said that he'd like all of us to work on this. your choice whether to stay or not, but we were allowed a seventh member who at this point is Yokie.\n\nastro\naqua\nchase\ndr\nniko\nyokie\nakbaba"},{"date":"2023-02-17T19:36:58.71823Z","msg":"hey! glad you could make it :)\n\nas of right now our game plan is to make a minecraft-like editable platformer that's themed somewhere in space.\n\ni've got nico on graphics, and akbaba's making the platformer physics.\n\nthe main tasks left then would be procedural world generation and actually editing the terrain. not sure if akbaba's gonna add in the editing, so if he doesn't i would ask you to do it.\n\notherwise we're solid. i'd welcome any help on world generation that you could offer come monday when i start doing it."},{"date":"2023-02-17T18:15:18.252753Z","msg":"Em will always be the one that could spit it the fastest, and he's one of the better ones. But Logic and NF especially are the future of rap, and the fact that NF can do it all and not swear every second word makes him that much more admirable than Bobby in my opinion :P"},{"date":"2023-02-17T15:23:06.670977Z","msg":"also a player skin"},{"date":"2023-02-17T15:22:36.177329Z","msg":"ok, just wanted to know. this is what i have to plan the game around, so i just wondered what you were planning on\n\nore would be great. idk if that's stone or not, but it looks nice. other than that, idk. i don't think we'll be doing a lot with light, so don't worry about torches and stuff.\n\nif you could also make a cracking thing (like crack lines going from a little to almost all) that would be great as well because we could superimpose it over the brick when it's being mined"},{"date":"2023-02-17T13:21:56.115632Z","msg":"That's interesting! Thanks for explaining, I need to test that out sometime :O"},{"date":"2023-02-17T01:53:25.258346Z","msg":"literally my sibs would confirm that i was screaming. i was bout to put the NF mix on shuffle and then i saw that it had a new picture and i was like \"no way bro\" XD\nyeah, the past selves hit me so hard for some reason lol\nthe best thing imo is that he no longer has to paint the smile on, which means a lot tbh\n\nyep ?\nthey've got all the track names up at genius lyrics, all thirteen of em :D"},{"date":"2023-02-17T01:26:08.168716Z","msg":"that's awesome xD\n\nit was insane. like insane. he's wearing white. NF wearing white? he's pushing away his old self instead of fear. what i love is that he finally forgave his mom (if you remember back to _How Could You Leave Us_ he said he wanted to but he couldn't. now he did.)\n\nin no way. counting the days to april 7th!"},{"date":"2023-02-17T01:10:09.594829Z","msg":"literally am listening to the track for like the twentieth time, it's fire.\n\nso excited he's getting less sad finally. i feel like this is gonna be a big turning point for him."},{"date":"2023-02-17T00:32:40.572508Z","msg":"let's get some NF love on the HL guys! <3\nhttps://www.khanacademy.org/computer-programming/h-o-p-e-nf/6322114015838208\n\nnot mine it's just gas and i love nf so yeah :D\n\nalso guys collab coming in like a week and a half and it's gonna be super epic so definitely get ready for that!"},{"date":"2023-02-16T23:19:21.403203Z","msg":"i'll handle generation. if you could finish the basic platformer engine within the next three days or so so i can start work on generation by monday, it would be appreciated.\n\njust make it a basic block-based platformer with a manually drawn bitmap (like any normal platformer). what would also be great would be to figure out editable terrain, but we can always do that later. just have the basic physics worked out by monday :)"},{"date":"2023-02-16T20:32:47.753245Z","msg":"you're good!\n\nwe're making a minecraft-like game (so a platformer with editable terrain and a procedurally generated map).\n\nyou and i will be making the mechanics. so far i can split it into physics and map generation, so if you're in any way able to create a basic platformer engine it would be appreciated. you can dm me if you need more details"},{"date":"2023-02-16T17:57:50.280682Z","msg":"sounds good. we could like make it space-themed or something, like MarsCraft"},{"date":"2023-02-16T16:22:20.371632Z","msg":"sure!\ni honestly hadn't given that much thought on it. either would be fine, but it would be more of a recreation if we did pixel.\n\ndo whatever you're more comfortable with. if we have trashy pixel art because you aren't familiar with it, i'd rather have vertex."},{"date":"2023-02-16T16:12:07.47395Z","msg":"other big-brain idea: we make 2D minecraft but the art is different and we call it something cooler"},{"date":"2023-02-16T15:14:02.577168Z","msg":"i'll wait to see if akbaba's got any ideas.\n\nright now the only idea that i'm playing with is a game like yorg . io, don't know if any of you have ever heard of it :P\nit's not an idle game but it has idle properties to it like upgrading and building a \"zombie-defense empire\".\n\ndang :/\nthat won't work then, so we'll just stay here.\n\ngot you, good luck with that :)"},{"date":"2023-02-16T14:41:10.579597Z","msg":"it's better than calling `get()` three times. it's already a slow operation, calling it three times isn't necessary if you're instead storing it and then just calling the _stored value_, not the _function_."},{"date":"2023-02-16T14:34:57.368654Z","msg":"alright so i think we need to figure this out today\n\nso far we're thinking like idle game? i think astro's group is making something original, so it might be fun for us to do a recreation of something.\n\nalso, can we agree on another place to chat or is this is best place?\nidk if y'all have discy, but if you do you can dm me jD2R#3823 (lol rip i forgot the # ?)"},{"date":"2023-02-16T12:24:06.614108Z","msg":"thanks lol it's very minimalistic"},{"date":"2023-02-16T00:13:53.399718Z","msg":"thanks! yeah, it gets difficult. i should really only do one at a time. at least i got a nice homepage out of WCC lol"},{"date":"2023-02-15T23:58:22.078596Z","msg":"ok thanks :)\ni'll try to make something, kinda busy with coc so no guarantees but i'll make an effort :P"},{"date":"2023-02-15T23:29:18.415724Z","msg":"Can you direct me to your program? It should have worked, it might just be another error."},{"date":"2023-02-15T15:10:26.126455Z","msg":"hey! our little gang is actually super stacked haha\n\n\"A video game whose gameplay consists of the player and/or the computer itself performing simple actions (such as clicking on the screen ) repeatedly in order to progress, usually with additional elements to increase the rate of progress.\" says a dictionary.\n\nso like a game where there's not a huge amount of pressure to do stuff, like a clicker.\n\nan example would be an idle mining game where there's a guy who is continually mining and you can upgrade his speed or add more guys or upgrade an elevator or whatever.\n\nanother type of that kinda thing is like an idle farming game, where you buy seeds, farm and harvest, and then sell the crops.\n\nthey're like tycoon games, try to get the most points possible so you can brag about your score."},{"date":"2023-02-15T01:27:34.132117Z","msg":"lol how about \"shot in the dark\"\nas an idea to change, maybe to prevent so much lag you could only draw the enemies and blocks if they're a certain distance from the player? it would be a simple distance check in the loop in the draw function."},{"date":"2023-02-15T01:12:33.448494Z","msg":"ikr astro's a legend"},{"date":"2023-02-15T01:07:31.419378Z","msg":"good evening all!\n\nhere's a CoC collab with Astro:\nhttps://www.khanacademy.org/computer-programming/i/5710788212080640"},{"date":"2023-02-14T20:15:43.691675Z","msg":"you're good! just looked a bit off to me lol"},{"date":"2023-02-14T19:31:40.789661Z","msg":"that sounds like an interesting game. i like the idea of an idle game, whether we do that specific execution or not."},{"date":"2023-02-14T17:54:58.684171Z","msg":"hello!\nthat you are.\n\nnot right now. we could do the theme but it's optional, so i'm debating whether we should even try to do it at this point."},{"date":"2023-02-14T17:53:27.350317Z","msg":"right right that's why it's there but why is it's x value `width/2 - 25` instead of `width/2`?"},{"date":"2023-02-14T17:52:24.760331Z","msg":"just got in :D\ni was wondering why everyone was so quiet lol\n\nwell you're the captain so it's your job! >:D"},{"date":"2023-02-14T17:48:27.094409Z","msg":"yay im late :D\n\n@aqua\nlegit what are you talking about that looks insane o.O\n\n@astro\ni'm good with group 2.\n\n@group 2\ny'all can come here if you'd like\nhttps://www.khanacademy.org/computer-programming/not-a-secret-base/6242670720892928\nas you can see it's clearly not a secret base"},{"date":"2023-02-14T13:46:49.01132Z","msg":"ok, sounds good. should get us enough points that it doesn't matter if we get the late penalty.\n\ndebatable :P"},{"date":"2023-02-13T21:42:21.746699Z","msg":"eyy, nice call! thanks for the clarification on how to fix it :)"},{"date":"2023-02-10T20:53:09.928431Z","msg":"You're fine, my fault for not understanding.\n\nThat code won't work, because animal is the iterator and not the array. You would have to call it like `tickle[animal]`.\n\nIs that what you mean by the order? The variable you initialize in the loop is the one that goes _inside_ the brackets, and the array that you're checking for the length is the variable that the brackets are connected to.\n\nSorry if I'm not understanding lol, I'm not fully getting your wording."},{"date":"2023-02-10T00:45:25.875507Z","msg":"@cake person\nits peaceful and quiet\n\n@promise\ndat true astro drafted a ded boi for his first pick\nheh i am ded how am i supposed to update dev thread >:D"},{"date":"2023-02-09T21:56:49.974199Z","msg":"astro wait what's wrong with my thing ;-;\n\nwait wait nvm i figured it out with my big brain debugging skillz :O"},{"date":"2023-02-09T21:47:57.734569Z","msg":"somewhat but not strongly agree\nthat's actually pretty funny xD"},{"date":"2023-02-09T21:47:04.542938Z","msg":"took me long enough xD"},{"date":"2023-02-09T20:57:14.142283Z","msg":"working on it now. my schedule says it'll be done by 6 EST, not sure what else i can say."},{"date":"2023-02-09T20:47:59.247562Z","msg":"lol i have a yellow screwdriver :P\nit has a magnetic head which picks up screws, a feature that i actually really like"},{"date":"2023-02-09T18:53:46.833773Z","msg":"lol how specific"},{"date":"2023-02-09T12:39:38.53412Z","msg":"haha ig it does give off that vibe doesn't it?"},{"date":"2023-02-08T22:20:55.255762Z","msg":"oh wait that's why xD\n\nbe there in a sec :)"},{"date":"2023-02-08T22:17:30.286068Z","msg":"sure sure"},{"date":"2023-02-08T19:24:18.410842Z","msg":"i added colors yay"},{"date":"2023-02-08T15:09:53.809452Z","msg":"sweet, that means i can pretty much just copy things over from my first round entry and work out some of the glitches.\n\nthanks, should be done by tonight (tomorrow night worst case)."},{"date":"2023-02-08T14:46:40.409407Z","msg":"alright. so to be clear, i'm making:\n - bullets (coming from the mouse for now and going to the player, not coming from the player and going to the mouse)? this is so that we can test what enemy bullets will look like?\n - blocks w/ player and bullet collision"},{"date":"2023-02-07T23:09:04.856405Z","msg":"maybe :D\n\nnot judging, i love those songs! AJR is fire :)"},{"date":"2023-02-07T22:10:12.868832Z","msg":"hi mr. captain of levi's team (i think):\nit would have to be _Returns_ by NF or _Misery_ by Maroon 5."},{"date":"2023-02-07T16:00:09.969806Z","msg":"yw! :D\n\njust anywhere, i prefer at the top of the program. so right before or after`noStroke()` would be fine."},{"date":"2023-02-06T22:39:18.870325Z","msg":"so the player can shoot?\n\ngotcha.\n\nyay :D"},{"date":"2023-02-02T23:52:13.289345Z","msg":"love the feedback bro, always welcome\n\nnoted and noted\nmore particles?!!? :O\n\ngreat point. nice demo, that's a cool color scheme you found :D\ni like how the player pops out against the blue"},{"date":"2023-02-02T19:21:02.936587Z","msg":"it is tho xD\n\nthanks :)\nyep, they're pretty simple. i think they look cool though lol"},{"date":"2023-02-01T13:17:23.360607Z","msg":"not very excited tho\nthis was kind of a letdown"},{"date":"2023-02-01T13:16:39.242056Z","msg":"Yep.\nThat they do. You can tell from the particles that I spent an hour implementing :P"},{"date":"2023-01-31T19:58:39.780352Z","msg":"yw!!\n\ni take none of it back. you were being disrespectful to us elders by flexing on us xD\nstill can't see my thrusts doing any damage and still am disappointed by the collisions, but it's so much better than mine was that i'll just silently sit here and applaud.\n\n*clap clap clap*"},{"date":"2023-01-31T18:55:52.670235Z","msg":"lol sorry bout that"},{"date":"2023-01-31T18:55:24.075618Z","msg":"thanks aussie"},{"date":"2023-01-31T18:55:05.745782Z","msg":"you're too kind"},{"date":"2023-01-31T17:06:30.227574Z","msg":"thanks. yeah, points off on originality for sure."},{"date":"2023-01-31T14:45:21.725167Z","msg":"i sure hope so :D"},{"date":"2023-01-31T13:23:16.600172Z","msg":"thanks\nnice score! :)\ngood point. anything i could add to make it less boring?"},{"date":"2023-01-31T13:22:49.931365Z","msg":"yes zombie alert!!"},{"date":"2023-01-31T13:22:42.175042Z","msg":"nice :)"},{"date":"2023-01-31T13:22:34.301764Z","msg":"thanks"},{"date":"2023-01-31T13:22:19.676311Z","msg":"not really xD\n\ni got you. hopefully our collab'll work itself out."},{"date":"2023-01-31T13:21:53.089488Z","msg":"nice.\n\ngood point. changed."},{"date":"2023-01-31T02:15:26.531437Z","msg":"thanks bro"},{"date":"2023-01-31T02:14:40.900973Z","msg":"```\n{\n    names: 'Dominic R.',\n    captain: 'Astro',\n    link: \"https://www.khanacademy.org/computer-programming/zombie-alert-coc/5586634209017856\"\n},\n```"},{"date":"2023-01-31T02:09:53.655521Z","msg":"My first (rushed) entry for CoC.\n\n*Zombie Alert*\nhttps://www.khanacademy.org/computer-programming/zombie-alert-coc/5586634209017856"},{"date":"2023-01-30T21:09:42.919511Z","msg":"Grinding to finish my first program atm. It'll get done, but it might not be pretty.\nIt'll be better than JSCoder's though lol\n\nI'm good with those pairings if that's good with everyone else :)"},{"date":"2023-01-30T20:19:19.03259Z","msg":":P\n\nyep!\n\ni guess you're right, i am better.\nas of right now i have to go work on another one of my awesome games for CoC. nice chat, ttyl :)"},{"date":"2023-01-30T19:43:53.839414Z","msg":"yep :P\n\nno lol _i was lying everything you make is trash_\n\n\njk jk i meant it. i can't draw a decent graphic for the life of me, so i have somewhat of a special admiration for people who can."},{"date":"2023-01-30T19:40:08.466936Z","msg":"ah, you've discovered the other KA principle.\n`quality < following`\nyou have a large following - presto, you've got voted regardless of whether the program is good or not.\n\nthe code might suck, but the product doesn't. i think a lot of the things you make look pretty darn neat! ;D"},{"date":"2023-01-30T19:33:51.97844Z","msg":"oh you were serious about Cora leaving? do you have a backup to draft?"},{"date":"2023-01-30T19:31:59.218247Z","msg":"not your fault. people seem to like messages about them more than quality programs. i had a program that blew up about 2 weeks ago for insulting the way people write code, it's just the way that the community is.\n\n?"},{"date":"2023-01-30T19:09:23.326993Z","msg":"time lends itself to no one.\n\nunfortunately neither does perseverance to finish.\n\nthe combination is deadly."},{"date":"2023-01-30T19:01:50.193832Z","msg":"you're welcome esteemed sir polar ?\n\nnot very good. i've only half finished mine, and some other members haven't done much either. we can only hope to beat you at this point ?"},{"date":"2023-01-29T20:07:40.583057Z","msg":"aw yeah :D\ngives me some more time to do my entry!\n\ni haven't. quality < network, if you got fanz you got votez.\n\nok..."},{"date":"2023-01-29T19:58:50.936446Z","msg":"tuesday? entries are due monday, sir.\nand i highly doubt that, but maybe.\n\nthose two will battle it out. everyone else has nothing.\n\nlol nice :P"},{"date":"2023-01-29T14:21:39.372746Z","msg":"also haha cameron"},{"date":"2023-01-27T23:12:52.456885Z","msg":"?????"},{"date":"2023-01-27T22:04:51.790778Z","msg":"lol look up 'cleveland baseball team' and you might get it\n\nor maybe you won't. idrc. i had more fun making the reference than anyone will understanding it."},{"date":"2023-01-27T20:55:53.858737Z","msg":"unbased and cringe\n'dominic' is the only real way to spell it"},{"date":"2023-01-27T20:34:23.533124Z","msg":"hmmmmm >:)"},{"date":"2023-01-27T19:29:17.553743Z","msg":"hmmm i knew that >:)"},{"date":"2023-01-27T15:26:59.098352Z","msg":"we have the same avatar mr. levi\nplus you have a shark so you are the evil one i have a rocket like nasa (a non-evil organization)\n\nsimple logik"},{"date":"2023-01-26T23:43:45.507Z","msg":"As a matter of fact, JavaScript is very similar to Python. As CR said, the fundamentals you'll learn here can also be applied to other languages as well."},{"date":"2023-01-26T13:04:07.162591Z","msg":"you didn't see it 'cause you're not on github. you really need to get on one of these days xD\nhttps://www.khanacademy.org/computer-programming/high-iq-spider/4832853171159040\ngonna be some kind of platformer, right now it's just a demo of the spider physics.\n\nthat's sick :O\nlove the art style!\n\n*is jealous*\n\nyeah, he is >:)\nteam astro coming for everybody >:)"},{"date":"2023-01-26T12:37:49.561603Z","msg":"i suppose that's a compliment\n\nhow's team levi coming? does it sound like you guys are gonna finish? levi's entry looks amazing :O\n\njust worried 'bout team ninjaz. sounds like they're all gonna finish and with the firepower they have they're probably gonna take top spot for now. ski's wrong if he thinks he's gonna be top entry though xD"},{"date":"2023-01-26T02:36:05.090281Z","msg":"ik ik :((\nyeah, for now. i'm adding bullets tmrw if everything goes to plan"},{"date":"2023-01-26T01:16:02.953344Z","msg":"does it look ok? i've been building it from scratch for the last three days and i still have a way to go lol"},{"date":"2023-01-25T21:31:34.08693Z","msg":"yes they turn our helpless children to a life of crime >:("},{"date":"2023-01-25T19:56:00.079263Z","msg":"@cbf\nnah bro, i'm just as fine leaving as staying. i'm not here for nothing. i'm here for the clout.\n\nplus, ain't no one gonna replace me. they got skill but not passion. i dare you to find someone who's as good as i am and who's got the dedication to do this plus the other hundred things that are on their plate.\n\nspoiler alert: you won't.\ni wasn't a first round pick for nothing. i'll finish my program if it puts me in the grave >:D"},{"date":"2023-01-25T19:28:42.909383Z","msg":"@mr. cow\nyep! not sure how it's gonna turn out because i'm heading in without a team. hopefully i land some decent teammates xD\n\nalso I know it's gonna be good because they told us not to bring our 'soldering irons' lol\nlike i own one of those i am poor and have no money ?"},{"date":"2023-01-25T19:25:18.318778Z","msg":"ahh motivation and time are not on my side >:(\n\n@astro give us another motivating speech please :D"},{"date":"2023-01-25T19:18:56.501549Z","msg":"lol yes i am copying ski move for move\nexcept that all my code is by me and not him >:(\n\nhonestly my idea may have to wait. i have 5 days left - one of which is useless bc i'm at a hackathon all day - and the other four i'm pretty bogged with school.\n\nat this point, the plan is to make an fps. but an original, different fps than the one he's going to make.\n\nhmmm yes. they're designed to do the physics as well as the detection, so i can get it all out of the way in one swipe.\nif by interesting you mean plagiarized, you'd be mostly correct haha"},{"date":"2023-01-25T16:49:41.269458Z","msg":"_starlight sonata's_ pretty sick. i'd have to go with the one core made though, the lofi girl. there's just so much going on :O\nthis one is fantastic, almost to those levels if i'm being honest lol"},{"date":"2023-01-25T16:06:28.00812Z","msg":"```\nso this might honestly be one of the greatest graphix i've seen on KA.\n```\nnot biased at all ofc"},{"date":"2023-01-25T13:37:36.577268Z","msg":"thanks! feels good to finally have some degree of success. just goes to show you gotta keep at it.\n\nnow for more quality content!\n\n@bio and yes it is the best quote no cap"},{"date":"2023-01-24T15:00:06.338821Z","msg":"thanks :)"},{"date":"2023-01-23T20:36:12.608476Z","msg":"thanks :)"},{"date":"2023-01-23T20:35:55.178819Z","msg":"nice score!\nthanks Fierce! best of luck to you as well :)"},{"date":"2023-01-23T17:51:37.783591Z","msg":"true that."},{"date":"2023-01-23T16:58:00.466129Z","msg":"@ski\nlol team neutron collab got booted down another spot on my top programs list :P \nisn't it funny how people vote sucky platformers? but they don't vote stuff that's actually legit? food for thought."},{"date":"2023-01-23T14:28:02.404157Z","msg":"2 minutes ago"},{"date":"2023-01-23T14:20:09.469706Z","msg":"nice score!\nthanks so much for alerting me to that issue. _that_ earned you a spot on the leaderboard :D"},{"date":"2023-01-23T14:18:21.017593Z","msg":"it is a rather easy game, come to think of it :P\n\ni'll keep it in mind for future programs. this one has had too many scores submitted and to redo the scoring procedure would be ineffective and annoying for both the scorers and myself at this point."},{"date":"2023-01-23T14:06:27.745702Z","msg":"about a year, although you could learn all that i've learned in about six months if you work hard enough :)"},{"date":"2023-01-23T14:05:19.091942Z","msg":"ah, going for the arcade style score of how many thousands of points you got. i think you just want more points >:D\n\nno >:(("},{"date":"2023-01-23T14:02:30.753829Z","msg":"nice work!\nthanks :)"},{"date":"2023-01-23T14:02:19.233834Z","msg":"nice!\nthanks :D"},{"date":"2023-01-23T14:02:09.117282Z","msg":"awesome!"},{"date":"2023-01-23T14:01:58.238007Z","msg":"cool!"},{"date":"2023-01-23T14:01:51.468574Z","msg":"awesome job! :D"},{"date":"2023-01-23T14:01:41.518476Z","msg":"nice! :D"},{"date":"2023-01-23T14:01:29.280921Z","msg":"why no sock?!?! >:("},{"date":"2023-01-23T14:01:12.564255Z","msg":"nice!"},{"date":"2023-01-23T14:01:05.763162Z","msg":"super pog"},{"date":"2023-01-23T14:00:58.892655Z","msg":"nice!"},{"date":"2023-01-23T14:00:44.316514Z","msg":"thank you! :)"},{"date":"2023-01-23T14:00:34.790891Z","msg":"thanks! sorry to hear it bugged, that's still a nice score :D"},{"date":"2023-01-23T14:00:16.017189Z","msg":"thanks! :)"},{"date":"2023-01-23T14:00:10.016273Z","msg":"nice!"},{"date":"2023-01-23T13:59:51.995756Z","msg":"no socks!?!! >:("},{"date":"2023-01-23T13:57:32.460453Z","msg":"yeah that would be a mess\n\nthank you i like taco :D"},{"date":"2023-01-22T21:09:14.339509Z","msg":"cookie ?"},{"date":"2023-01-22T18:47:21.526678Z","msg":"@IA\nit's a quote. from yours truly :D\nmade it a while ago. funny he only uses it now lol"},{"date":"2023-01-22T14:06:50.946159Z","msg":"ha ha ha >:D"},{"date":"2023-01-22T12:35:40.608112Z","msg":"@SMV\nyay! :D\n???"},{"date":"2023-01-22T12:32:24.303545Z","msg":"gracias! :D\nthanks lol\nikr o.O\n\nhmmm\nidk tbh lazy developer ig"},{"date":"2023-01-22T12:31:46.355084Z","msg":"yeah, i've been told that the contrast is a bit high lol. thanks :)"},{"date":"2023-01-22T12:31:09.831552Z","msg":"nice! no, it's not :P"},{"date":"2023-01-22T12:30:38.335152Z","msg":"thank you :)"},{"date":"2023-01-22T12:30:30.803671Z","msg":"nice! added :)"},{"date":"2023-01-22T12:30:18.907996Z","msg":"yes >:)"},{"date":"2023-01-22T12:30:08.312956Z","msg":"not a rule, and it's totally fine to be critical. just keep it to my programs, not sure how others would react to that initial comment xD"},{"date":"2023-01-22T12:29:18.671854Z","msg":"thanks :)"},{"date":"2023-01-22T12:29:09.78034Z","msg":"thanks!\nit is, i was running low on ideas for design lol. i think i made the first level but if my memory serves me wrong i can include credit :)\n\no.o"},{"date":"2023-01-22T12:28:17.628536Z","msg":"nope, i'll trust ya :P\n\nthanks! :D"},{"date":"2023-01-22T12:28:02.508744Z","msg":"thanks! added :)"},{"date":"2023-01-22T12:27:47.700642Z","msg":"nice! :D\n\nthat's great that you think so. thanks :)"},{"date":"2023-01-22T01:10:57.313273Z","msg":"yeah, it's pretty easy.\nagreed. i didn't spend enough time on them.\n\ni'll change if you feel that strongly about it. i'm a big 'give credit where credit is due' person and i felt that it was acceptable, but i'm happy with moving it up  :)\n\nit is though xD"},{"date":"2023-01-22T00:34:43.090481Z","msg":"thanks Liam! no, i'm aiming just a bit higher with that.\n\nthanks! added."},{"date":"2023-01-22T00:29:01.196239Z","msg":"ah no, a glitch :(\nnice!\n\nit's basically like using characters in the ASCII catalog to write text. so writing text using text, essentially."},{"date":"2023-01-22T00:27:19.876292Z","msg":"ahh nice, pullin' out the NF!\n\ndang, probably true. though if i was on your team i woulda been kicked by now for having made no progress on my entry, so kinda happy about that xD\n\ni forgot the font i had used ?\nnow i just have a funny haha note under it\n\n:O\n\nfixed the ascii title. about all i'm gonna do xD\nthe contradiction is beautiful :')"},{"date":"2023-01-22T00:23:43.925532Z","msg":"thanks! good suggestion, added :)"},{"date":"2023-01-22T00:08:55.377447Z","msg":"i very well might!\n\nalr, i was wondering about that. you're correct, as usual.\n\nnever >:(\nit looks better in PJS _imho_\n\nbroo- xD\n\nit's true, the contrast is pretty brutal.\n\nlol get rekt you're not first >:)\n\nhmmmmm\nofc not why would you have any bias lol"},{"date":"2023-01-21T23:58:03.085699Z","msg":"lol they are kinda trippy xD\n\nfantastic! testers are always welcome!\n\ni will admit it's more than a little fun :D"},{"date":"2023-01-21T23:55:19.905404Z","msg":"wow they are actually huge :O\nthanks!"},{"date":"2023-01-21T23:53:22.581967Z","msg":"```\nDominic R.\nIgnes\nhttps://www.khanacademy.org/computer-programming/ice-slide-wcc/6705944713281536\n```"},{"date":"2023-01-21T23:50:41.594868Z","msg":"for some reason, Saturday nights are a good release time for me.\noh look, here's one now :D\n\nhttps://www.khanacademy.org/computer-programming/ice-slide-wcc/6705944713281536"},{"date":"2023-01-21T19:36:38.994282Z","msg":"@ski\nnice bio, lol. that quote was definitely from a while ago xD\n\n@NotJohnBrown\nsure, sure.\nand i doubt it, most people on here are dumb enough to give away their full name (take for example myself)."},{"date":"2023-01-21T19:18:21.858163Z","msg":"10 minutes ago\n\nyou know the thing i just realized that actually makes me sad (more so than the votes)? she gave away her entire name online. like that's just stupid."},{"date":"2023-01-21T18:37:59.349735Z","msg":"9 minutes ago"},{"date":"2023-01-21T17:36:58.592843Z","msg":"@ski\nwhy is it curious, though? it's a fact that reputation gets you further than skill every time, and i'll happily disagree with anyone who says otherwise.\nif that's true, then what's unexpected about something like this, which has a huge meme following, surpassing programs of more skill? checks out to me, and it's the way the community's been for a while. no surprise there.\n\nthat doesn't mean i'm for it. explanations are not supporting statements. heck, this is a pretty awful program in terms of code.\n\ni think the lesson we're all learning from this is that a few rectangles in the right places mean more than they look like - especially to immature kids that are obsessed with the meaning (and who account for many of the votes)."},{"date":"2023-01-21T16:04:42.57755Z","msg":"it's happened before. it'll happen again.\nit doesn't happen every week. besides, it's one of the most high-quality amogus graphics I've ever seen :O"},{"date":"2023-01-21T15:47:05.489703Z","msg":"ski but i love amogus :'("},{"date":"2023-01-20T22:34:34.536088Z","msg":"if you say so mate :P\n\nlol nice game though!"},{"date":"2023-01-20T21:34:34.744804Z","msg":"hmm. that's good to know, thanks :)"},{"date":"2023-01-20T19:54:23.922588Z","msg":"@Astro\nok cool, you making an intro too? I seem to remember that you said you were.\nand yeah i'll probably do numero uno bc yokie's would look very similar to what i was going for with numero dos."},{"date":"2023-01-20T19:52:31.873001Z","msg":"good plan"},{"date":"2023-01-20T00:51:32.676016Z","msg":"idea numero uno\ntop-down scroller, fill enemies with blobs that you shoot and once they are full, they turn into blobs that you eat to get more blobs to shoot, etc.\n\nidea numero dos\npush puzzle, like sokoban type game. more likely gonna do this one, i just have to make it super amazing to stand out.\n\ngreat ideas, right?\nso genius much wow"},{"date":"2023-01-20T00:29:18.663987Z","msg":"yay speech!\n\nhere's mine! :D\n...\n\ni've only a smol idea of what i'm going to be doing but no actual implementation yet!"},{"date":"2023-01-19T23:57:53.977104Z","msg":"ugh fine but i hate optimizing"},{"date":"2023-01-19T23:50:00.764493Z","msg":"@John\ntake that back >:("},{"date":"2023-01-19T13:01:11.336918Z","msg":"sussy baka."},{"date":"2023-01-19T12:43:14.578709Z","msg":"ski said that it's a great deal slower than using `nf.constructor` or `sq.constructor`.\n\n`eval()` is pretty much just a workaround for `new Function()`. If you find yourself using it, you should replace it with one of the options I listed above.\n\nignore this\nvvvvvvvvv\n@WKoA if you see this screw you"},{"date":"2023-01-18T02:11:15.980049Z","msg":"^^^\ntrue that. was just about to say it, darn you ski!\n\nwithout preventing the default event, the page'll scroll up and down with the key events. yuck."},{"date":"2023-01-17T23:33:20.916431Z","msg":"@Astro\nwell we don't need to voice our opinions now! :D\nif one of us goes inactive I'd say probs Niko. We need all the graphic power we can get.\n\n@Akbaba\nhey! :D\nlol i was late too, just showed up this morning."},{"date":"2023-01-17T23:20:20.123438Z","msg":"You know about reverse iteration? Of course you do!\nYou know what annoys me about it? It doesn't look neat, duh.\nYou know what I did? Made a beautiful function, what else?\n```\nArray.prototype.reverseLoop = function(callback) {\n    for (var i = this.length; i--;) {\n        callback.call(this, this[i]);\n    }\n};\n```\nTurns out that you can define methods for a particular type, such as the `Array` type, or even a `String` or `Number`. Here's another example with a string type.\n```\nString.prototype.reverse = function() {\n   return this.split('').reverse().join();\n};\n```\nIt's pretty neat to be able to do this, but keep in mind that you shouldn't need to do it that often. Adding methods to built-in types is *never* preferred to adding methods on your own objects and classes.\n\nAlso, for anyone who is concerned about me using `callback.call()` instead of just calling `callback()` - it's an opinion. Show me it runs faster your way and I'll change it."},{"date":"2023-01-17T22:08:50.924315Z","msg":"dat is certainly what it seems like"},{"date":"2023-01-17T21:40:53.587473Z","msg":"dat is right."},{"date":"2023-01-17T21:39:10.990694Z","msg":"idk about that. Ace did a bad job last year imo, and so did Cyberwolf. Not to mention IA getting banoozled.\nbut yeah, in the end it comes down to three things.\n1) who's staying active.\n2) who's got technical skill.\n3) who can take that skill and translate it into programs.\nif the captain drafts on these principles, he's set."},{"date":"2023-01-17T21:14:29.677695Z","msg":"mango = thelegomango\nnot our lord and savior mngo\n\nprobably, but you've made some decent content. Astro's right (nice subtle praise of yourself there, sir), all of the captains are really talented this year. \n\nhopefully they're as good at leading as they are at writing code - two very different things."},{"date":"2023-01-17T21:09:33.81773Z","msg":"i haven't started yet lol\n\nbrainstorming ideas and never got  a chance to implement."},{"date":"2023-01-17T18:11:01.287383Z","msg":"not as much as you would think. you guys all have active, big name coders (maybe with the exception of mango)."},{"date":"2023-01-17T15:48:42.709281Z","msg":"ah.\n\nvaliant effort. most of it is pretty easy, and the stuff that isn't can be stolen from ski or HS.\n\nunderstandable."},{"date":"2023-01-17T15:32:33.608515Z","msg":"i'm here :)"},{"date":"2023-01-16T19:51:26.039988Z","msg":"good afternoon, LG :D"},{"date":"2023-01-14T23:38:12.085083Z","msg":"i don't think so - i think what he was saying was that we need ours to be better than team bob."},{"date":"2023-01-14T17:35:15.740448Z","msg":"ah ok. just making sure. his team is still my bet to win, if anyone's concerned.\n\nfantastic! good luck :D"},{"date":"2023-01-14T16:08:46.616574Z","msg":"oh ok lol\n\nmust have missed that"},{"date":"2023-01-14T16:04:34.504321Z","msg":"HOW DID YOU FIND THIS\n\nand i thought you were bananaed lol"},{"date":"2023-01-14T16:01:00.771266Z","msg":"Hey! :D"},{"date":"2023-01-14T16:00:49.271171Z","msg":"Polar, I have quick question for you.\n\nlol why are you drafting like this? why don't you just follow the directives to give 12 people you want? why is your team 'open to all'? do you understand how CoC works?\n\ni can't tell if you're losing your mind or if you're just acting dumb for some reason :P"},{"date":"2023-01-13T22:19:27.508798Z","msg":"present!  :D\n\nlol astro we're on the same team for this too"},{"date":"2023-01-13T22:03:19.760755Z","msg":"Yeah, congrats HS!\n\nYay, now I don't have to maintain my page :D"},{"date":"2023-01-13T18:34:08.708313Z","msg":"i think you're either going to ski or levi 4th round, get ready! :D"},{"date":"2023-01-13T16:09:39.821143Z","msg":"@polar\ntruer words were never spoken <3"},{"date":"2023-01-13T01:15:44.393281Z","msg":"i'm sure he knows what he's doing. truthfully, i'd rather be working with him but if my absence leaves a spot open for you, i'm all for it :D\n\nyo excited for Embers, dude! can't wait till that comes out now.\ni'd rather we wait for prima or somethin' like that lol if that's alright with you.\ndecent? the girl is online 24/7.\n\nonly because i've gotten 100+ votes in the past two-ish weeks. you gotta play it with the recents, if you make more recent stuff more people'll know you. guaranteed if i didn't make 16 things or the ignes homepage i would not be #4.\ni would be too lol, i was last year when kevin only picked me as his like 26th option :P\nyeah, it's still a way off. we'll think when we get there :D"},{"date":"2023-01-13T00:20:41.168818Z","msg":"yeah you got the secret weapon xD\nyes sKI lol\n\nwell at least he wants you\ncowboy's actually a bit mad at him for picking a bunch of no names instead of well-established KA devs. personally i think it's a smart move on his part :P\n\ni'm going to be honest with you - the only real advantage i have is time and activity. you have a ton of skill and i'm not sure why people are ignoring it :P\nlike you've put some stuff that's much better than i have. i've finished like 2 games, and they've both been pretty bad lol.\nand no, if you make some cool stuff in CoC, Prima and TCO you're gonna be head and shoulders above the competition. i mean come on they asked paperwad lol you could be better than him if you tried really hard."},{"date":"2023-01-12T23:44:03.497901Z","msg":"you're good. i'm planning to rewrite basically the whole thing so i think you're ok for now. i might run the second draft by you if you don't mind when i finish - just to get a second set of eyes :D"},{"date":"2023-01-12T23:41:46.663526Z","msg":"yay! gl to you guys, you probably got the win xD\nnot if we work hard though >:)\nteam astro ftw\n\nyes we must :D\nwe must build up our reputation and social credit so we can both be captains next year!"},{"date":"2023-01-12T20:25:08.374897Z","msg":"great! not currently :P"},{"date":"2023-01-12T19:36:07.744878Z","msg":"present :)"},{"date":"2023-01-11T21:58:18.457461Z","msg":"lol\n\ndid you see Timothy's draft rankings? you made top 10-20 i think :D"},{"date":"2023-01-11T21:40:26.516263Z","msg":"yeah yeah what's up\n\nif this is about the menu i'm sorry, i haven't had time to work on it :P"},{"date":"2023-01-11T20:45:42.32557Z","msg":"ok lol stop meeping or i will delete this thread >:("},{"date":"2023-01-10T15:41:45.501298Z","msg":"@HS\nlol, nice rant."},{"date":"2023-01-10T15:30:45.408217Z","msg":"yep! good luck on the draft :D"},{"date":"2023-01-10T15:09:45.059931Z","msg":"it's finished. idrk what else i want to do with it. besides, it's honestly too late to change much, they're in the judging process atm."},{"date":"2023-01-10T14:44:13.977785Z","msg":"i actually don't agree with that, i think imagine is the proper case for the context he's using it in.\n\njust my take, might be wrong."},{"date":"2023-01-10T01:52:51.772245Z","msg":"yeah honestly i wouldn't be unhappy with paperwad if none of the other captains had any interest. keep your eyes peeled on the captain's thread, that's where they'll post their wish list for people. i remember back to the day i was 12th on Kevin W.'s list and i was so proud xD\n\nyep yep yep\nfine, they do have a cool avatar lol"},{"date":"2023-01-10T01:16:52.234411Z","msg":"if i was a gamblin' man i would bet lots of money that he's first pick, followed by JS and maybe virtuosa.\nif you don't get drafted i doubt i will :(\n\nooh neat\ndon't bother learning sql on ka. go learn the rough basics off-KA, then apply your knowledge to a more modern technology like mongodb or firebase.\nyEs aLL fOR thE SubBerS\nyes activity is very necessary. if we're not on the same team here (we probably won't), let's go together for primavera."},{"date":"2023-01-10T01:00:36.324725Z","msg":"honestly i'm out of ideas and motivation. hopefully i'll figure something out for the first round of coc (assuming i get drafted, maybe not :O).\n\nmy goals for this year are to one-up on my web design, though.\n - learn react\n - learn next.js\n - become css master\n - fully master js (learn asynchronous stuff)\n - tailwindcss\n - start using linux on my home machine\n - learn git command line\n - make more KA programs to satisfy the program-hungry subbers\n\nyou make any goals for the year in terms of programming?"},{"date":"2023-01-10T00:52:49.405487Z","msg":"even xacer would be amazed :O\nmhm"},{"date":"2023-01-10T00:49:48.168579Z","msg":"oh yeah bet if we landed a Cora collab :O\nif we got longtreader we'd have to make a game. but in canvas and not pjs."},{"date":"2023-01-10T00:42:51.435596Z","msg":"yes that true"},{"date":"2023-01-10T00:39:08.236444Z","msg":"yes i was sitting and waiting from like 7 >:(\nwasted three hours waiting for this dumb competition to start >:("},{"date":"2023-01-10T00:35:48.710239Z","msg":"yeah it was really dumb liam should wake up earlier >:("},{"date":"2023-01-10T00:31:15.892013Z","msg":"yeah!\n\nyeah that's how they did it last year lol\n\nyes i was very quick\noof"},{"date":"2023-01-09T22:04:15.313568Z","msg":"that might do it xD"},{"date":"2023-01-09T21:34:43.512907Z","msg":"thank you!\nunfortunately, the host closed joining about a week ago. if it was open i would totally be pumped if you joined though, your programs are really neat :D"},{"date":"2023-01-09T21:00:00.234453Z","msg":"lol\n\nyess ignesFTW"},{"date":"2023-01-09T19:57:15.031738Z","msg":"Pretty sure it's a one or the other. If you're a judge, it wouldn't really be fair for you to be a contestant - and vice versa."},{"date":"2023-01-09T19:56:14.664441Z","msg":"the irony that only by you getting pizza do i get pizza.\n\njokes on you though, i'm eating pizza tonight whether you like it or not >:D"},{"date":"2023-01-09T19:02:32.930958Z","msg":"ha ha. the irony is killing me."},{"date":"2023-01-09T18:51:46.814718Z","msg":"NO\nyou wouldn't\n\nwhat could convince you not to take away my most fundamental right"},{"date":"2023-01-09T18:48:26.287326Z","msg":"i'll call my lawyer\ni'll sue!"},{"date":"2023-01-09T18:21:27.857083Z","msg":"we are, there are just some things about who he is that bother me. i'm sure he has even more things about me that he dislikes. doesn't mean i dislike him totally, just some things he does :D\n\npOInt GraNTEd\nit's good until it's not. he doesn't get nearly as much stuff out as other people. however, when he gets something out, you can tell he's spent some time on it. i guess it comes down to quality vs. quantity.\ni'm sure it's amazingly fantastic. never done it though xD\nthe issue with that is that he worries about micro-optimizations that don't really matter. if it works one way and you want to switch one method that doesn't really even make much of a difference, why say anything?\n\ni actually don't have a whole lot more. i'll say he's polarizing and leave it at that, which isn't necessarily a bad thing depending on how you think about it."},{"date":"2023-01-09T18:01:10.704368Z","msg":"um let me think\nbEcAuSE he'S NutS\nhe is a perfectionist\neverything you do is one-upped\nhe always has a better way to do it\n\nwant me to continue? i can."},{"date":"2023-01-09T17:54:39.72571Z","msg":"probably like 3 or 4. Astro and Levi are on top for now lol\nplus, i feel like he'd be a strict micromanaging overlord >:("},{"date":"2023-01-09T17:42:46.750671Z","msg":"here's my chart.\n1) Astro\n2) Levi\n3) Polar\n4) Henry\n5) Paperwad"},{"date":"2023-01-09T17:02:57.126034Z","msg":"yes it has! i got first application :D\n\nsame to you! maybe we'll end up on the same team ._."},{"date":"2023-01-09T17:02:12.993513Z","msg":"probably not, but i appreciate it xD"},{"date":"2023-01-09T15:29:47.829557Z","msg":"1. What are your top two programs?\n`https://www.khanacademy.org/cs/i/4996077086621696`\n`https://www.khanacademy.org/cs/i/6220028490858496`\n\n2. How much can you be active?\nI'm planning to be pretty active for this (say 3-6 hours a day). I'm doing another comp during the season, but I'll try to devote more of my time towards this.\n\n3. Anything else we should consider?\nI've not been here super long, but I feel like I've accomplished a lot. I also did CoC last year as ski's replacement for Team Neutrons if that means anything lol\nExpect webpages, game design with PJS/Canvas and logic. Graphics aren't my forte, but I can make some pretty good lookin' ones in a pinch."},{"date":"2023-01-09T14:36:58.365215Z","msg":"lol\n\nno, i wish it was >:(\ni don't know why he doesn't just open it. it's supposed to drop today, though."},{"date":"2023-01-09T14:09:07.118409Z","msg":"yep, it's ohio. or canada. either one.\n\nthanks :)"},{"date":"2023-01-09T13:21:25.667791Z","msg":"it's for looks lol\nsome of us hate the look of the word 'var' because we've been forced against our will to use it for so long >:("},{"date":"2023-01-09T13:05:09.822712Z","msg":"hmmm\nwhat could you mean by that o.O"},{"date":"2023-01-09T13:04:22.548067Z","msg":"yes just one :(\n\nyeah that sounds about right.\nok, i got you."},{"date":"2023-01-09T13:03:41.507863Z","msg":"nice pun bro xD\nthanks!"},{"date":"2023-01-09T13:02:45.475398Z","msg":"yep, yep, yep, yep, and yep!\n\nthanks! once you realize there's no one authority on how to style your webpages, it gets easier because you're free to overuse parallaxes and glassmorphism, a strange boxy font, a fadein that excludes the footer, etc."},{"date":"2023-01-09T01:52:20.558602Z","msg":"oh darn! it's important to put school before stuff like that though.\n\ngood luck at that then :)"},{"date":"2023-01-09T01:47:37.225833Z","msg":"we got captain longtreader, astro, hs and myself leading the charge.\n\ni think we got this lol.\n\nin other news, are you doing coc this year? o.O"},{"date":"2023-01-09T01:41:25.560923Z","msg":"uh, what ways, o.o?\n\n1. work very very hard.\n2. add and style components one at a time.\n3. build on your design as you go.\n4. look up how to do literally everything.\n5. don't reinvent the wheel. use things you already have.\n\ndo this and you shall become great.\n*bows*"},{"date":"2023-01-09T01:33:32.417787Z","msg":">:D\n\nin case you have more than one? idk, i can't follow ski logic very well :P\n\nohh bet so like a huge tutorial library! that would be cool, and we could get people to write posts on something and then we could add them to the program...? idk. it's got potential, though."},{"date":"2023-01-09T01:29:50.263198Z","msg":"@Timothy i though primavera was, o.o. i judged SGJ on skill level as well.\n\nyeah we got the win in the bag. we have what i feel is the perfect mix of activity and skill."},{"date":"2023-01-09T01:28:37.235158Z","msg":"what site map >.<\nyesh\nYESH"},{"date":"2023-01-09T01:28:03.698245Z","msg":"thanks dad! :D"},{"date":"2023-01-08T22:41:06.602698Z","msg":"yesh >:D\n\nno QUEStion!\n\nyeah yeah i got you\nand maybe. that would be an interesting thing to pull off. however, with the deprecation of the API, it would be hard to pull off :P"},{"date":"2023-01-08T22:39:31.975436Z","msg":"no ohio is a blank screen because it doesn't exist smh that's common knowledge"},{"date":"2023-01-08T22:38:35.536053Z","msg":"yeahh we're pretty stacked :O"},{"date":"2023-01-08T21:39:29.395169Z","msg":"got it, that's probably why.\n\nok, thanks."},{"date":"2023-01-08T21:31:33.624355Z","msg":"@Corin\nis the reverse iteration really just a KA bug? the concept seems like it would have an effect on other platforms. it's literally just an issue with the looping and how it'll skip elements when you splice from the front back instead of the back front."},{"date":"2023-01-08T21:27:37.089002Z","msg":"menu still doesn't open. i can see it and everything, the menu just doesn't open properly.\n\nevery time i click on the menu, it directs me to https://www.kasandbox.org/computer-programming/exec/webpage?lang=en&v=230106-1413-25f2973f3daf&host=www.khanacademy.org# .\nThat's probably why."},{"date":"2023-01-08T21:10:35.704858Z","msg":"thank you! :D\nWCC hosted by SMV and Ace Rodgers. link in footer."},{"date":"2023-01-08T21:10:15.921415Z","msg":"yes >:D"},{"date":"2023-01-08T21:04:43.209383Z","msg":"some competition? you guys'll need to really work it to beat us xD\n\nbut seriously, best of luck to your team! :D"},{"date":"2023-01-08T20:45:51.330166Z","msg":"i didn't ask, i implied it's what he would do so when he doesn't his subconscious will torture him late at night >:D\n\nno question >:(\n\nyep it's definitely a \"when-you're-bored\" game xD\noh, you can start it. feel free to annex the idea free of charge. just not a project i want to waste any time trying to do lol"},{"date":"2023-01-08T20:28:00.159792Z","msg":"me too\nyes no paperwad\ni just coerced astro to sign us both, let's hope he does it lol\n\nno never question >:(\n\nthat game is so fun xD i've had my month where i was addicted.\nnope, not yet. don't plan to, either. this community won't be able to support it."},{"date":"2023-01-08T20:24:38.543229Z","msg":"idk he had it when i came. i doubt it's his last name, even i hide my last name when i'm here xD\n\nno i will not survive\nok goodbye\nfine it was a lie sue me\n\ntrust me, it's safer on gh. if we had the convo we're having on gh in KA, we'd all be on a guardian watchlist somewhere lol"},{"date":"2023-01-08T20:22:47.599401Z","msg":"someone refused to be on team bob last year and then went on to resign from coc. i don't think you can :P\n\ndO noT qUesTioN"},{"date":"2023-01-08T20:18:43.119537Z","msg":"ohh bet i'll look into it.\nyeah, except that i wanted to showcase that i could finally build responsive websites :(\n\n_yes you must_\nyeah right when you draft me and lemon in coc got it"},{"date":"2023-01-08T20:15:59.759589Z","msg":"good we shall be first :D\nbut what if different people draft us >:(\n\nif it's ski, it's efficient. don't question the logic."},{"date":"2023-01-08T20:15:02.554535Z","msg":"@S. M. V.\ntwskyglaco = Time Warriors + Sky Glaco (his old name before ski)\n\ncan y'all go back to github? i had 17 notifs mostly because of you guys xD\nleave me in peace .o."},{"date":"2023-01-08T20:07:39.404702Z","msg":"thanks! imho your has better functionality with some of the stuff like the stats page.\nit is. i used it for a CoC tracker last year and thought i'd brush some of the dust off, xD."},{"date":"2023-01-08T20:06:47.082814Z","msg":"tried it, but it still didn't work for me. just took it away for now, if people want to see the fullscreen they can locally save it and run it in the browser."},{"date":"2023-01-08T20:06:01.662528Z","msg":"what new page lol\ni took it away because it wasn't working. probably a KA thing, it worked on StackBlitz.\nok i'll work on it\noh mea culpa i meant to do that lol\n\nstop entering as beginner then >:((\njk but legit stop lol you're so confusing"},{"date":"2023-01-08T20:02:15.779623Z","msg":"not really, i just spent two days doing nothing but this. i hope you have a healthier KA-life relationship lol\n\nthanks! :)"},{"date":"2023-01-08T20:01:40.054346Z","msg":"yes :D\ni shall wake up at 7EST and check.\n\noh that's funny xD\n\nyay ski! weird but functional .-."},{"date":"2023-01-08T15:01:35.962007Z","msg":"thank you :)"},{"date":"2023-01-08T14:56:53.753341Z","msg":"*Name*: Dominic R.\n*Team*: Ignes\n*Link*: https://www.khanacademy.org/cs/-/4996077086621696"},{"date":"2023-01-08T14:25:08.256803Z","msg":"can confirm. it's all preference :)"},{"date":"2023-01-08T01:22:59.710619Z","msg":"cookie! :D"},{"date":"2023-01-07T23:41:17.922072Z","msg":"well im going to be up front with you.\n\nim working on my homepage for wcc and so i can't commit much time\ni shall certainly take a deep look though and let you know what i think is goin' on."},{"date":"2023-01-07T23:34:40.100882Z","msg":"you have a question i suppose"},{"date":"2023-01-07T23:30:59.54505Z","msg":"um yeah sure the one we were just working on? be there in a sec"},{"date":"2023-01-07T23:28:30.509549Z","msg":"yeah, that sucks :P\n\nyeahh thumbnail.js is absolutely sick. game-changer."},{"date":"2023-01-07T22:01:37.862497Z","msg":"yeah it looks really weird xDD\nbut it looks rEgAL o-o"},{"date":"2023-01-07T22:00:56.797998Z","msg":"_?a va, je me rends compte qu'une grande partie de mon travail est de qualit? inf?rieure_"},{"date":"2023-01-07T21:56:32.772112Z","msg":"yeah lol it's not that good\nbut so much better than what i could do so yeah xD"},{"date":"2023-01-07T21:55:56.101768Z","msg":"aren't you pRoUd??!?!?!?"},{"date":"2023-01-07T21:36:43.686033Z","msg":"fantastic :D\nif you delete these after i use them i will be so mad lol >:("},{"date":"2023-01-07T21:35:50.816802Z","msg":"for real lol\nwhat a shame, i felt like that would go somewhere :(\n\nyeahh boi\nrespect <3"},{"date":"2023-01-07T21:30:31.003735Z","msg":"correct it's not for you it's for your crack organization golden games which i left for some reason lol\n\nwas this a collab or did you just do it yourself? o.O"},{"date":"2023-01-07T20:13:40.248135Z","msg":"ohh sick thanks"},{"date":"2023-01-07T20:13:33.660561Z","msg":"not mine, made by Horizon."},{"date":"2023-01-07T12:28:42.471926Z","msg":"yeah, it's cause it's still a wip. i'll get it fixed in due time.\n\nthanks!"},{"date":"2023-01-06T21:56:21.251928Z","msg":"@mr. lemon\nyeah, he's pretty slow normally but he should be about done by now xD\nwe should literally just do a draft like last year...i like that infinitely better than some weird nonsense about \"picking what team you wanna be on\" lol so dumb\n\n@SMV aka \"annoying\"\nleave us please lol"},{"date":"2023-01-06T21:53:09.724166Z","msg":"yes >:D\nwe must trick them >:D"},{"date":"2023-01-06T21:49:18.66781Z","msg":"you kidding me? she already did (ski, right? smh.)\n\nnope we better be first round picks mr. lemon >:(\nfifth? totally. he is epico. promise? maybe. haven't seen as much from her except graphics (she did a great job on those for the neutrons last year)."},{"date":"2023-01-06T21:47:28.872977Z","msg":"ooh, that's not good :(\ni'll see about getting around it."},{"date":"2023-01-06T21:27:47.79102Z","msg":"do you feel the same way about the fireworks? i think it's slow but not sure if it's as slow"},{"date":"2023-01-06T21:04:36.562482Z","msg":"Alright everyone, I've finished the landing page lol\nhttps://www.khanacademy.org/computer-programming/ignes-demo/5149877583790080\n\nplease please please\ni need feedback\nthis probably sucks right now but i need to know why and how to fix it :D\nthanks guys!"},{"date":"2023-01-06T17:58:40.687833Z","msg":"@Polar\nare you stalking or do you have something rigged to alert you any time the word polar is used in the KACP lol\n\nit said it sent the comment in the extension but when i went on to check, it wasn't there. it's happened probably about 5-8 times at this point :P\nstill a fAntAsTIc extension if i do say so myself"},{"date":"2023-01-06T17:56:38.621842Z","msg":"Semicolons, if you please.\n6. Oh, ok.\n9. Who reads documentation anyway? (i do lol) You're right though, maybe I should just link the page.\n10. well ofc it's preference. i'm just stating that i'd personally rather not read a file that have 20000 lines, 10000 of which are blank space. might be taking it a bit far, but idrc.\n12. right. walls of text are intimidating. Maybe I can find some way to share little tips that aren't in walls of text...\n13. true and true.\n\nbecause i only agree with one point of view - mine. mine could change, but if it's not in my mindset then i'm generally not for it.\nplus, wild commenters give me something to do all day lol"},{"date":"2023-01-06T17:51:01.617719Z","msg":"You've got a point. If that works for you in this circumstance, do it."},{"date":"2023-01-06T17:24:07.893088Z","msg":"Your preference. Not saying it's better than mine, but it's good to go with what you know and can work with.\nOk, make a special case for KA then. When you're writing code with other editors, especially if you're porting it to open-source, stick to 1 line at the end.\nCorrect - it's preference. But you can do so much more than just call the two functions. It's kind of an administrator role for the object - everything gets done there.\nWhat about readability? I don't know that WASD is 87 65 83 68, how am I supposed to understand your code?"},{"date":"2023-01-06T01:39:32.167028Z","msg":"its better than crab for sure\n\nplease do. it'll get you to leave me in peace xD"},{"date":"2023-01-06T01:36:10.602074Z","msg":"didn't i responsd? o.O"},{"date":"2023-01-06T01:30:50.886541Z","msg":"dang sorry polar's extension is acting up >:("},{"date":"2023-01-06T01:29:32.073912Z","msg":"lol that nickname though\n\nwell you don't have to wait long. i might just use it as my coc tracker template seeing as hsstudent's one is so cool and will probably win."},{"date":"2023-01-06T01:28:11.004294Z","msg":"pErHApS YoU DiD mY BrAin FAilS ME At ThiS PoInt"},{"date":"2023-01-06T01:22:07.987722Z","msg":"i forget why at this point but yes\n\nyOu ArE a COnTRIbuTer"},{"date":"2023-01-06T01:20:02.915217Z","msg":"haha well woe is you stalker because i ditched this from production weeks ago! the new one i'm working on currently is securely hidden in my stackblitz acc with a private key so it will never be found >:D"},{"date":"2023-01-06T01:05:49.625364Z","msg":"I'm also working on one, it'll be trash compared to y'alls but it's so secret I'm working on it off-platform :O"},{"date":"2023-01-06T00:56:03.823979Z","msg":"JS just invaded their thread bc that's what he does. he did that last year too lol\n\nthat's good. should be some nice competition if i'm being honest."},{"date":"2023-01-06T00:48:00.306846Z","msg":"wait JSCoder's a captain too? who's competing? we're all gonna be first round picks because there's no one else _to_ pick xD"},{"date":"2023-01-05T23:35:35.176768Z","msg":"yo that would be sick :O\n\nmy top are...\n1) Levi\n2) ski\n3) Henry/Astro\n\ni'd rather not do paperwad, so i'm hoping he thinks i suck. i would be fine with polar too."},{"date":"2023-01-05T20:40:26.327592Z","msg":"html (namely canvas) will always be better than pjs.\n\nthanks :D"},{"date":"2023-01-05T15:06:42.976516Z","msg":"mhmm. sure, sure.\n\nyep, readability should be the second thing programmers think of besides getting the job done. if i'm asked to organize a bookshelf and i do it but in my special way instead of the conventional method, i won't be respected and probably won't be asked to do it again.\nit should be something that everyone wants, so i feel that no disclaimer is necessary.\noh yes, this was meant to be a scathing rant. granted, the information was subtly flawed at places but overall i feel like my message was received whether it was with good feelings or not.\ni'll be the first to admit that the small text is more because i wasn't motivated enough to update the page. at the most basic level it was to save my scalp from the wild commentors in chat.\ngood point. i'll attempt to be more concise in the future.\n\nallow me to point out that my intentions were not flawed, my execution was. the way i chose to fix some of the mistakes i made was in no way the best approach style-wise.\nyou're absolutely right about the contributors list, i felt like it was taking up a bit too much room myself.\nyes please. i didn't run this through any kind of editing so i appreciate the attention given to fixing little mistakes :D\n\n1. ok, i'll look into it!\n2. it's necessary until i'm told it's not simply because of the peace of mind. it's literally one line - what's difficult about that? apparently it _is_ too much to ask of the community, >:(. what's your point about the JAVA2D? that you can write that instead?\n3. thanks and thanks. not sure what you mean about the comments, and to the point about the objects, it's convention. run your code through any beautifier and it'll do it for you.\n6. restate, please. are you saying that i should add info about the throwing errors with `throw`?\n9. why don't people know how to do it, then? is the KA explanation not working? personally, no one wants to go watch an instruction video that's 10 minutes long when you can read what i've written in 30 seconds and then do your own research for 5 minutes and probably understand it better.\n10. so you're saying i'm wrong or right? minimize blank lines. blank line at the end of the file. done and done.\n12. why doesn't everyone do it all the time, then? i wouldn't have written it if i didn't see it somewhere.\n13. separating them into objects? arrays work for color values too, iirc.\n14. correct. it's just a simple example, but if you're saying people could get tripped up i can definitely look into it.\n15. right! saying something is low-quality without saying how to improve it is worse than saying good job, because at that point you've both made the dev doubt their skills _and_ left them in the dark about how to improve. \"I like some of what you said\" isn't good either, because it's not specific. Your feedback was perfect because it gives me things to fix right away and things to think about for later.\n\noh, i am. i am."},{"date":"2023-01-05T01:47:41.592019Z","msg":"rebuttal and comments incoming :)"},{"date":"2023-01-04T22:49:21.193887Z","msg":"oh yeah, I know what you mean. i thought it might have been that, but another part of me was convinced it was some crazy deep programming topic i'd never heard of xD\n\nyeah, if that's your goal i would say that if elses accomplish it better than switch :D"},{"date":"2023-01-04T21:21:42.470617Z","msg":"Yeah, I'm really happy with the discussion it generated as well!\n\nThanks :)"},{"date":"2023-01-04T21:20:31.20539Z","msg":"#1 and 5. Thanks!\n\nAbout the manager: why have I literally never heard of this before? It makes a lot of sense, but I'll definitely have to do some thinking now about how to implement that kind of thing into games."},{"date":"2023-01-04T21:18:34.062663Z","msg":"If one line of code makes a difference for even one person, I'd keep it.\n\nPardon, but what do you mean by condense? It's a preference thing though nonetheless.\n\nThank you! :)"},{"date":"2023-01-04T20:30:33.929763Z","msg":"Like I said in the program, there are a bunch of different use cases for each. You're saying to move first and then draw? It makes sense but I just want to be sure.\n\nJust using it as an example lol, but in reality toads are way cooler than frogs.\n\nThanks! Hopefully when, it'd be great to see some new stuff from you at some point :D"},{"date":"2023-01-04T17:08:54.924683Z","msg":"thanks for letting me know!"},{"date":"2023-01-04T15:41:07.680277Z","msg":"Yeah, which is why it's not the best. Stay tuned for more on that though, I'm putting out version 2 of this today with better explained code."},{"date":"2023-01-04T14:08:28.016393Z","msg":"It complicates your program when it gets more complex. If you have to check for 30 keys, you suddenly have 90 lines of code in the key function instead of one or two."},{"date":"2023-01-04T14:07:40.536129Z","msg":"I agree with you mostly! As long as they're learning, I'm all for it.\nAlso about the comments, writing clean code should always take first preference and I'll agree with that. But comments have their place too, even if it's not on the same level.\n\nThanks :)\nbelieve me, this is short compared to some of the other comments I've received xD"},{"date":"2023-01-04T14:03:32.44947Z","msg":"Please read other's comments. The program is not the one solid rule in the least, many if not all of these commenters know more than I do."},{"date":"2023-01-04T14:02:44.193907Z","msg":"real slick there bro xDD"},{"date":"2023-01-04T14:01:12.231288Z","msg":"judgement will come at the end of time for the unclean (un-neat ig lol)"},{"date":"2023-01-04T13:57:24.778848Z","msg":"Properties are pretty simple. They're like variables that are the children of an object, so you access the values like `parent.child`. An example...\n\n```\nvar player = {\n   x: 0,\n   y: 10,\n   name: \"Player 1\"\n};\n\nprintln(player.x);    // 0\nprintln(player.y);    // 10\nprintln(player.name); // \"Player 1\"\n```\nIt's just to stay away from having multiple variables that could all be grouped together in the same \"grouping\" or object. If you have 5 variables that all pertain to the player in the game, why not group them together to make it easier to read?"},{"date":"2023-01-04T13:53:35.39593Z","msg":"Playing around with styles is great in a testing environment or when you're experimenting - but when you start to build more professional, finished code you need to start sticking to one style. It's what makes your code your code. Totally for switching around when you're learning though, or maybe as a personal challenge to yourself to make everything a class :D\n\nTotally agree with the last point. Brainless execution is what we're trying to avoid here lol"},{"date":"2023-01-04T13:49:59.631747Z","msg":"#1. So you would say it's alright to keep it then or should I just go the `false` route?\n\n#5. So you're saying I should, or shouldn't? I understand there are reasons to go either way, especially when projects get more complex.\n\nI totally get your point about the micro-optimizations. Could you elaborate on what a manager is and how to implement it though?\n\nThanks for your comments. I really appreciate it :)"},{"date":"2023-01-04T13:46:56.418267Z","msg":"...\n\nthat true. i could find him though >:D"},{"date":"2023-01-04T13:43:10.653312Z","msg":"@John\nthat's certainly true. if he does, I'll sue him out of his life."},{"date":"2023-01-04T13:38:46.25794Z","msg":"don't you dare, ferret.\n\ni know bc the code is open source. if he put anything there, people would have seen it by now >:D"},{"date":"2023-01-04T13:37:41.28926Z","msg":"yes and i'm bamboozled trying to answer all the hate on 16 things so i didn't have time o.O\n\nplease do not like i have anything else to do"},{"date":"2023-01-03T23:22:41.566999Z","msg":"Nice, I might look into that :D\nTradeoffs, as usual :P"},{"date":"2023-01-03T23:22:01.872727Z","msg":"Thanks!\n\n`*The Response*`\n#1 - ok I'll definitely look into that :D\n#2 - it's preference. I use `update()`, but `display()` works too. the reasoning behind using the word update is that update has a 'do everything' connotation. display to me seems like another word for drawing, but if you think of it a different way it's your deal.\n#3 - don't know why I didn't include that. That's the correct way to do it, so not sure why I didn't put it in. I'll change it when I have time.\n\nthanks for your comments mr. lemon"},{"date":"2023-01-03T21:28:42.513115Z","msg":"'Nuff said. I know you're a busy guy xD\n\nNope, `// jshint esnext: true` just enables you to write `let` and `const`. The one that breaks out of the loop protector might have been the one you were referring to, but idk.\n\n#12 appears mostly in beginner programs, you're right. As to #16, just leave it. Obviously my original intent was lost in transit to some people, and that's probably my fault. I'll look at revising the wording.\n\nI know lol I tend to get a bit mad at mistakes people keep making :P"},{"date":"2023-01-03T21:12:33.647152Z","msg":"@Polar\nYou don't know how much I wish KA could bring TS to the platform. It's just better because as you said, the code is more self-explanatory. This guide was aimed mainly at KA PJS users specifically, and so many things such as comments might not fit exactly how they're supposed to.\nalso HTML comments are hard to write so I'll grant that point\n\n@Astro\nto each his own. well I can see flaws with terribly excessive commenting, a comment every 10 lines or less can and should be written."},{"date":"2023-01-03T21:03:05.351605Z","msg":"You're welcome! Thanks for bringing these issues to my attention.\n\nFor a few reasons, the least of which is that it's storing and removing two values instead of one on every keypress. Not necessary, simply to make the job of the developer easier by providing character options. If you're referencing the `String()` or the `delete` issues, you're correct.\n\nVXS? Because it works. In this case, I doubt the reputation poses much of an issue. Same reason I can use thumbnail.js and not get yelled at, even though the developer is also somewhat infamous.\nAs to the `smooth()` issue, I've been told it does something somewhere and so that's honestly better than not including it and doing nothing anywhere.\n\nThanks! I hoped everyone could find something useful.\n\nAbout the oh-noes thing, I don't feel bad because I've made mention that it is somewhat dangerous. However, it's up to the developer as to whether or not they want to include it.\nA. What's not legal about it?\nB. It's not shady, it doesn't even do anything besides allow the names to be typed. It's honestly just for looks.\nC. What errors?\n\nI agree with you slightly. Good variable names are really really important, as I stated previous! However, if there comes a time when you do need to use short names for whatever reason, and there will be a time, then use comments to clarify.\nEh, I've been told there can never be too many comments. I don't agree with it, but there's a bit of truth to it. You're correct though, when the relationship is 67% comments and 33% code, you might want to reexamine.\n\nYep, and I don't regret it. 'Nice work' is bad feedback for the developer and I'll stand by that.\n\nOk, I think I worded this a bit strongly in the page. What I mean is to stop making programs that are comprised of half stack overflow and half random blog you found. In #2 I mention using code from @dkareh and @VXS. If I hated people using other people's code completely, I would have never said that. And your point about the credit is fantastic! It's always good to credit people who have taught you something! :D\n\nIt's not the hard and fast ruleset, and I'm happy people are disagreeing with some aspects because it means that you're thinking on your own, and I appreciate that. And yeah, we might always disagree on some things. That's just preference."},{"date":"2023-01-03T19:42:04.131664Z","msg":"well said."},{"date":"2023-01-03T19:39:12.557632Z","msg":"you're telling me there's nothing style-wise you would change on this page? hard to believe.\n\nthanks though ?"},{"date":"2023-01-03T19:33:07.770993Z","msg":"that's interesting! I think I've seen IA do that before. I'll have to read up on it. thanks for explaining!"},{"date":"2023-01-03T19:01:17.69911Z","msg":"1, 2 and 4 I can get on board with.\nI need an explanation for 3 please :D\n\nAs to the last one, I've been wanting to learn Vim for a bit now. I've been using nano when I work in the terminal, but it's generally slow lol. Might be a future endeavor :O"},{"date":"2023-01-03T18:58:11.776405Z","msg":"No prob! Keep up the good work and you'll be makin' those advanced games in no time :D"},{"date":"2023-01-03T18:57:39.599379Z","msg":"Thanks! Glad you found it helpful.\n\n#5 also mentioned that everyone's needs are different. Hopefully you can find a way to make it work for you and if not, don't include it!\n\nYep, there are definitely edge cases. For something like that it would be more logical to just draw a rectangle every frame. Why? Because as someone pointed out, drawing an image just means it takes all of the shapes and calls them as one shape. When you're only drawing one rectangle, you don't need to worry about imagizing it because at that point the only thing you're doing is losing quality."},{"date":"2023-01-03T18:54:24.242054Z","msg":"tbh that song slaps so hard when I'm sad :')"},{"date":"2023-01-03T18:52:33.900321Z","msg":"i knew you would love it so I did you the favor :D\nand thanks bro! <3"},{"date":"2023-01-03T18:49:00.294167Z","msg":"```\nfunction response(word, name) {\n   println(word + \", \" + name + \"!\");\n}\n\nresponse(\"Thanks\", \"Phase9\");\n```"},{"date":"2023-01-03T16:09:09.39734Z","msg":"Yep, you can indent anywhere you want to in your code. I just do it because it makes me think about how all the stuff inside is affected by the push/pop on the outside.\n\nA quick google search on how to comment JS code might be beneficial. In general, just describe basically what the line does. Example:\n```\n// returns a reversed string\nreturn str.split('').reverse().join('');\n\n// outputs a random number from 0 to 1 to the console\nprintln(random());\n```\nIt doesn't have to be terribly in-depth for in-line comments, but when writing function descriptions you might need to get a bit more descriptive.\n```\n/**\n   * Outputs a greeting to the console\n   * @param1 {String} default \"Hello\"\n   * @param2 {String} default \"World\"\n*/\nfunction greet(greeting=\"Hello\", audience=\"World\") {\n   println(greeting + \", \" + audience + \"!\");\n}\n```\nI haven't worked much with chains of inheritance, but if it's necessary then you can break these rules. However, always be looking for ways to refactor if you find yourself breaking too many.\n\nOf course! Hope this explanation is helpful as well."},{"date":"2023-01-03T15:41:00.577995Z","msg":"thank you! :)\nyw! should've been more but I wanted to get this out.\nand no it was very late and i was very tired o-o\n\nyay criticism!"},{"date":"2023-01-03T15:39:29.832921Z","msg":"You have some good points here yourself, sir! :D\n\n1. nope, it's not the same. *I* thought it looked cleaner when printing arrays to have no keys instead of a bunch of falsy values, but I've gotten some pushback about that so I might have to reexamine.\n\n8. performance > smooth graphics imho.\n\n13. good point.\n\n16. I'm so split on this, but in general it's a good idea to steal code and I'm glad you mentioned that. You also hit not copy-pasting, which is very correct. If someone's just taking code and using it, it might work but the programmer has gained absolutely nothing because of it. Learning from your mistakes and shortcomings is key."},{"date":"2023-01-03T15:32:13.731271Z","msg":"@Dat\nIt's your style, bud. But don't expect anyone to be able to maintain it but you xD\n\nPolar also has a point. WebGL code is very very tricky to understand if you're new to what it does. Just shoot for basic readability using *excessive comments* and everything else will fall into place."},{"date":"2023-01-03T15:29:32.011524Z","msg":"thanks! thought I'd go minimal, I think it's got a nice vibe :D\n\n1. yep! sometimes it's helpful, but a lot of the time a simple `clicked` variable'll do it better. just about measuring what, where, and why you need something.\n\n2. for games, I'm all for image loading. large graphics, not so much.\n\n3-7. *salutes*\n\n8. totally, expecially when you're drawing them every frame like players or blocks in a game. the sad thing is that it's not even that hard to implement.\n\n12. for sure.\n\n13. yeah, it's definitely a risk - especially when you're using bad, undescriptive variable names that could easily be shadowed without a second thought >:(\n\n14. they're kinda clunky but imho they're cleaner than a bunch of if-elses"},{"date":"2023-01-03T15:15:04.598238Z","msg":"take your time, i hope you find it useful :)\nyw!"},{"date":"2023-01-03T15:14:45.619194Z","msg":"thanks! :)"},{"date":"2023-01-03T15:08:50.846691Z","msg":"Thanks JS!\n\nI've heard that a lot. I might need to start doing some benchmarking, it seems like it would be faster but I want proof.\n\nI'm going with Rur on this one. It's preference, they both have the same use but in different ways. I just find it cleaner to use `switch`, but to each his own.\n\nYeah, it's more targeting people that basically make a hundred different globals when they could have just more easily made an object. Consider yourself above the law :)\n\n@Rur\nObject vs. Array = Readability vs. Speed"},{"date":"2023-01-03T15:02:49.362092Z","msg":"Ok, I'll look into that. Thanks :)"},{"date":"2023-01-03T13:15:03.351243Z","msg":"Thank you! I'll do my best to address or modify the hairs lol :)\n\n#1: Wasn't aware of that. I took PT's code which was the `toString()` and just changed it to `String()` because I wanted shorter code. Guess shorter isn't always faster.\n\n#2: Ok, thanks for letting me know. I saw a demo about what it did and it seemed to blur the edges, but it's good to know what it does in reality to make it look that way.\n\n#8: Also true.\n\n#9: Explain. Can you use the API in PJS? I've never heard of that before, o.O.\n\nThanks for your comments!"},{"date":"2023-01-03T13:10:17.613468Z","msg":"yay thank you!\nno go to sleep >:("},{"date":"2023-01-03T13:09:45.035521Z","msg":"but legally, according to the user that made thumbnail.js."},{"date":"2023-01-03T01:51:42.371292Z","msg":"oh man, i've made so many i can hardly keep track of which one you're referring to! :P\nlol in reality I haven't put a lot of effort besides general design ideas. I have a bunch of fun ideas I'm going to work on when I get more active though (very soon, I hope)."},{"date":"2023-01-03T01:46:34.114576Z","msg":"yep! constructive criticism all the way :D"},{"date":"2023-01-03T01:45:42.868492Z","msg":"ah yes you're picking up what i'm putting down >=D\n\nalmost _too_ impressive ?\nbut that's beside the point. the overwhelming majority are not me, if you're curious."},{"date":"2023-01-03T01:44:25.678232Z","msg":"hard to read, eh? thanks mr polar :D"},{"date":"2023-01-03T01:40:25.860965Z","msg":"yep pretty late for me considering that i stayed up till midnight two days ago :O\nbut to each his own :)"},{"date":"2023-01-03T01:37:46.489498Z","msg":"yes it's a scathing rant for sure\nwell use your _best_ judgement as to which you should be using :D"},{"date":"2023-01-03T01:22:22.345948Z","msg":"yes yes for sure. i'll bribe ski to draft us both."},{"date":"2023-01-03T01:15:24.975777Z","msg":"yeah...and work. hopefully i can get more active for CoC. you doing it this year?"},{"date":"2023-01-03T01:07:52.656092Z","msg":"only if you're active. that ship sailed for me a few months ago and I haven't been able to get back on."},{"date":"2023-01-03T00:50:36.397483Z","msg":"ah yes i am nothing if not not a stalker"},{"date":"2023-01-03T00:50:15.752802Z","msg":"ka allows Tailwind? oh boy oh boy oh boy"},{"date":"2023-01-03T00:42:16.397404Z","msg":"oh no :(\n\ni shall right this wrong immediately"},{"date":"2023-01-03T00:40:02.942366Z","msg":"haha I feel you, I did that last Monday. hopefully you're not doing it every day though :P\n\nyeah, it looks super neat when you get it to work correctly :D"},{"date":"2023-01-03T00:33:24.096349Z","msg":"alright, let's hear it.\n\nnot when you're workin' with HTML, B). that styling takes forever to get right."},{"date":"2023-01-03T00:24:12.610179Z","msg":"relax relax you're only the second to last person to arrive nothing to be concerned about\n\ni might make one. depends on the time it takes me to make, i guess xD"},{"date":"2023-01-02T22:32:27.298118Z","msg":"WHAT! NO! i don't release something for a week and i get unsubbed to?"},{"date":"2023-01-02T22:26:27.735326Z","msg":"oh no D:\nwhere'd it go? retrace your steps."},{"date":"2023-01-02T22:21:32.75482Z","msg":"yep lol i did expect there to be mixed responses. the most common theme was \"ok then\", i probably saw like 5 variations of it xD\n\nwhat, o.O? i'll help you find it unless it fell in the thread at the top of the T&T. then it's a goner for sure O-O"},{"date":"2023-01-02T22:18:31.507031Z","msg":"i got you bro give me a day"},{"date":"2023-01-02T22:15:22.011462Z","msg":"yep haha\n\noh yeah, people had interesting reponses to that xD"},{"date":"2023-01-02T20:28:28.851706Z","msg":"who's all plannin' to make a homepage?"},{"date":"2022-12-30T20:36:00.954092Z","msg":"ok bet :D\n\nthe player and enemy sprites already look pretty dope. what do ya want me to tackle?"},{"date":"2022-12-30T19:14:38.990759Z","msg":"triangle = 3 points = illuminati\nquick maths"},{"date":"2022-12-30T19:13:45.506687Z","msg":"hmmm it's astounding the amount of collabs we've started\nthis was 10 months ago :O\n\nok to finish we would need a menu, a winners screen, an ending screen, and about 5 more levels. we've got the mechanics down - i don't have the time nor perseverance to fret about those anymore.\n\ni think we could get it done. you down?"},{"date":"2022-12-28T19:07:44.260951Z","msg":"@Levi yep :)\nalsoo do you have info on CoC? wasn't sure when or if it was starting up for the year :P"},{"date":"2022-12-28T18:28:27.50707Z","msg":"@Levi\nyeah my brother is always talkin' about rush order tees which is apparently that kind of business. i'll have to ask my friend, she just got me a duck song t-shirt for christmas that was custom-made and i'm wondering where she got it.\n\n@Promise\ni don't know about redundant, :P.\nbut yeah i would totally wear my own, Levi's, and GG's shirts if they had their respective logos on them. all three look really cool :D\nbut only if they weren't overpriced. my nf shirt was like $40 and it hurts because the logo is already coming off >:("},{"date":"2022-12-28T01:06:04.801621Z","msg":"@Levi lol\n\n@Promise\noh neat neat\nsounds like addictive tendencies to me, ngl."}],"QUESTION":[{"date":"2023-03-03T13:37:14.142659Z","msg":"Hi Cora!\n\nI've been informed that you were willing to make the homepage for Primavera 2023. Is that still something you're interested in doing?\n\nLet me know and I can give you details.\n\nThanks :)"},{"date":"2023-02-28T21:28:17.731968Z","msg":"Hi Liam, I had a quick favor to ask.\n\nski and I are looking at hosting a short hackathon right after CoC, and I was wondering if there was any way you could ensure that it didn't cross over with Primavera - based off of the assumption that you're running it again this year.\n\nWe would only need about 2-3 weeks for this. I'm not sure of when Primavera is scheduled to start, but I think we'd both really appreciate it if you carved out these couple weeks even if it means pushing Primavera back a week or two.\n\nThanks for your consideration and looking forward to your response :)"},{"date":"2023-02-17T00:46:50.735187Z","msg":"explain (/\\/*/);"},{"date":"2022-11-30T00:00:52.375238Z","msg":"help mr. polar!\n\nmy header is not working and i'm unsure why. could you take a look?\nthank you.\n\nhttps://www.khanacademy.org/computer-programming/ignes/5506140049293312"},{"date":"2022-10-11T23:57:16.397776Z","msg":"so you're still around? haven't seen much from you since Primavera."},{"date":"2022-10-05T23:11:02.482092Z","msg":"are you an alt"},{"date":"2022-07-29T13:15:20.524132Z","msg":"Where can I learn about this API? _Sounds_ legit."},{"date":"2022-07-28T14:00:42.45923Z","msg":"Few questions.\n\nWho are you, where did you come from, and why are you so good?\nI've literally never seen you prior to TCO. Are you someone's alt?"},{"date":"2022-06-19T19:19:42.213136Z","msg":"Hey Cora, I'm finding that I actually don't have enough time to be a judge. Can you get someone to replace me?"},{"date":"2022-06-10T00:40:43.484665Z","msg":"Hey there, you've been assigned to help out on a program for Team Matrix. If you're interested in pitching in, please report here: \n\nhttps://www.khanacademy.org/computer-programming/team-matrix-hompage/5171487938494464?qa_expand_key=ag5zfmtoYW4tYWNhZGVteXJACxIIVXNlckRhdGEiHWthaWRfMTUyOTE3ODgxOTA2NDc3NDgyMTI2NzY1DAsSCEZlZWRiYWNrGICAo5yywbYIDA\n\n_copy the whole link_\n\nThanks!\n - Dominic"},{"date":"2022-06-10T00:40:38.188979Z","msg":"Hey there, you've been assigned to help out on a program for Team Matrix. If you're interested in pitching in, please report here: \n\nhttps://www.khanacademy.org/computer-programming/team-matrix-hompage/5171487938494464?qa_expand_key=ag5zfmtoYW4tYWNhZGVteXJACxIIVXNlckRhdGEiHWthaWRfMTUyOTE3ODgxOTA2NDc3NDgyMTI2NzY1DAsSCEZlZWRiYWNrGICAo5yywbYIDA\n\n_copy the whole link_\n\nThanks!\n - Dominic"},{"date":"2022-06-10T00:40:22.00256Z","msg":"Hey there, you've been assigned to help out on a program for Team Matrix. If you're interested in pitching in, please report here: \n\nhttps://www.khanacademy.org/computer-programming/team-matrix-hompage/5171487938494464?qa_expand_key=ag5zfmtoYW4tYWNhZGVteXJACxIIVXNlckRhdGEiHWthaWRfMTUyOTE3ODgxOTA2NDc3NDgyMTI2NzY1DAsSCEZlZWRiYWNrGICAo5yywbYIDA\n\n_copy the whole link_\n\nThanks!\n - Dominic"},{"date":"2022-06-10T00:40:03.224779Z","msg":"Hey there, you've been assigned to help out on a program for Team Matrix. If you're interested in pitching in, please report here: \n\nhttps://www.khanacademy.org/computer-programming/team-matrix-hompage/5171487938494464?qa_expand_key=ag5zfmtoYW4tYWNhZGVteXJACxIIVXNlckRhdGEiHWthaWRfMTUyOTE3ODgxOTA2NDc3NDgyMTI2NzY1DAsSCEZlZWRiYWNrGICAo5yywbYIDA\n\n_copy the whole link_\n\nThanks!\n - Dominic"},{"date":"2022-05-28T00:24:09.500785Z","msg":"Hi there. I'm here to beg you to help out your team with our final challenge. Report here if you're interested, we're making Battleship :D\n\nhttps://www.khanacademy.org/computer-programming/decent/5012137982869504\n\nNo worries if you're not, but still get back to me if you're able so I know you're alive, =P."},{"date":"2022-05-28T00:21:51.559641Z","msg":"Hi there. I'm here to beg you to help out your team with our final challenge. Report here if you're interested, we're making Battleship :D\n\nhttps://www.khanacademy.org/computer-programming/decent/5012137982869504\n\nNo worries if you're not, but still get back to me if you're able so I know you're alive, =P."},{"date":"2022-05-27T13:51:18.57802Z","msg":"dad dad dad\nwhy are my animations not working >:(\n\nhttps://www.khanacademy.org/computer-programming/as-a-last-hurrah/5237315451011072\n\nthank u :D"},{"date":"2022-05-06T21:47:52.877794Z","msg":"Hello Evan,\n\nI've heard Google Fonts aren't allowed in PJS. I found a function that loads them, and was wondering if it was ok to use it or not.\n\nhttps://www.khanacademy.org/cs/-/4742162376867840\n\nSay I used the code in my program. What would the consequences be? Would it be hidden from the HL, or from everyone?\n\nThanks in advance for your response."},{"date":"2022-04-20T20:00:45.215321Z","msg":"Hey, this might be out of your expertise area but do you know how to make a keypress detector in HTML?\n\nSo far I'm just setting up an event listener and checking keyCodes, but I heard somewhere that keyCodes are not good to use or something? IDK. Help would be appreciated :)"},{"date":"2022-03-14T18:21:18.811001Z","msg":"Are you going to move people around? Teams seem a little unbalanced currently."},{"date":"2022-03-12T23:18:15.104721Z","msg":"That's really awesome :)\n\nHow do you get the player to turn like that? I've seen Corin do it a couple of times but I'm not sure how you would pull it off."},{"date":"2022-03-10T16:52:29.408054Z","msg":"When does the second challenge end?"},{"date":"2022-02-16T13:00:17.124794Z","msg":"Why does the KA editor auto-complete tags like headers and divs, but not paragraphs (<p>)?\nIt might just be a thing about the editor, but I was wondering if there was a reason."},{"date":"2022-01-30T15:40:03.406514Z","msg":"I'm having a little trouble rotating the player in my game. Could you take a look and tell me how I would go about doing it?\nhttps://www.khanacademy.org/computer-programming/i/6185021661560832\nThanks in advance, it would mean a lot to me to get this up and running."},{"date":"2022-01-18T00:10:22.805174Z","msg":"I've heard there's a problem with using the `new` keyword with objects, something about them being \"not properly disposed of\" or something. So I want to know, why does this code work?\n\n`Object.constructor.prototype.new = (function() {\n    var obj = Object.create(this.prototype);\n    this.apply(obj, arguments);\n    return obj;\n});\n\n`allows you to call`\n\nvar new_object = object.new(parameters);`\n\nAnd also, if you could explain the bug with the `new` keyword, that would be immensely helpful as well.\n\nThanks in advance :)"},{"date":"2022-01-17T23:16:39.498884Z","msg":"Can someone explain regular expressions, or point to a tutorial? I've seen some people using them but I don't know what they are/do."},{"date":"2022-01-13T20:08:16.191642Z","msg":"Why don't you just make an object for the enemies? `var Enemy = function()`\nand then\n`enemies.push(new Enemy(x,y,z,etc))`\n\n*edit* - it might be to make it easier for programmers who are having trouble with OOP?"},{"date":"2022-01-11T13:17:41.803187Z","msg":"How do you make the restart button appear on a project?"},{"date":"2022-01-10T14:12:40.460945Z","msg":"Is `array.push([]);` the proper way to push an array into an array?"},{"date":"2022-01-04T21:53:12.930877Z","msg":"Hi Quinn!\nGetting the user's information via the link you give doesn't seem to be working on my end. Is it just me, or did KA change the accessing method?"},{"date":"2021-12-22T16:25:38.689592Z","msg":"How do you make links between two HTML pages in the KA environment? I don't recall KA ever teaching us anything than linking to wikipedia or another KA page."},{"date":"2021-12-21T19:37:57.027397Z","msg":"How do you know that the fonts/colors work together, or do you just judge it by eye? (in this program)"},{"date":"2021-12-21T15:50:47.811722Z","msg":"Are we allowed to use Google Fonts in our webpages, like linking the style sheet in the `<head></head>` tags?"},{"date":"2021-12-20T19:04:01.205722Z","msg":"So making pixel art sprites for a game would be made in the same way, or do you have to do something like convert them to images first?"},{"date":"2021-12-20T16:29:05.948432Z","msg":"Does the `size(400,400,P2D)` just keep the screen at 400x400 with a 2D canvas?"},{"date":"2021-12-17T13:04:28.704198Z","msg":"What does JS consider a double-click? Is there an amount of time between clicks that qualifies two clicks together as a double click?"},{"date":"2021-12-16T22:19:29.348402Z","msg":"Ok, does the `<em>` tag italicize or embolden words, because I've seen it do both (or is it just the differences with browsers)? Also, why use it when you can just use `<i>` or `<b>`?"},{"date":"2021-12-16T21:27:56.717941Z","msg":"I'm noticing as I do the challenges that if I omit a semicolon inside of the `<script>` tags that the code doesn't break. Do I need semicolons on my JS code like I do in PJS?"},{"date":"2021-12-15T17:10:02.502901Z","msg":"So do I have to write `document.getElementById()` with that _exact_ styling (camel case), or can I write `document.getelementbyid()` or something of the like?"},{"date":"2021-12-13T17:49:56.407914Z","msg":"Could you make a tutorial on platformers with sloped ground instead of blocks, or explain the basics? I think it's really interesting but I don't know how it works."},{"date":"2021-12-13T13:16:18.947379Z","msg":"Can anyone help with circle-rectangle collisions? I'm not sure how they would work, as the only thing I've thought of is checking every point that is radius distance from the center of the circle and seeing if it's in the rectangle, but that seems like overkill."},{"date":"2021-11-29T19:57:19.973867Z","msg":"_sees lava_\n*no touchy*\n\ncool game as usual voted++"},{"date":"2021-10-27T00:18:50.415786Z","msg":"Can someone tell me about JS timers? What are they, how do you use them, etc. It doesn't seem that KA has a tutorial so short of googling it I don't think I could find it. Thanks in advance!"},{"date":"2021-10-20T15:18:56.022803Z","msg":"Can you combine mouse-related functions, such as making a function that is called when the mouse is pressed and/or the mouse is dragged?"},{"date":"2021-10-11T21:03:26.890744Z","msg":"What is the font?"},{"date":"2021-10-11T17:26:29.030518Z","msg":"What's the font? (or is it just grouped shapes or something)"},{"date":"2021-09-30T14:50:09.809903Z","msg":"Could anyone direct me to a tutorial to learn about switch statements, or does KA not teach that?"},{"date":"2021-09-27T23:07:56.13962Z","msg":"Where do I find specific key codes for other keys, such as numbers or letter keys?"},{"date":"2021-09-25T18:09:41.822069Z","msg":"Can you create objects in a loop instead of just naming variables? Say I wanted to make a grid of tiles, and I wanted each tile to be a specific object. Would there be any way to make tile objects other than naming a variable for each object, maybe through a loop?"},{"date":"2021-09-21T19:04:53.332988Z","msg":"Why do we not use '==' as strict equality in JavaScript? Does '==' mean something else, or was it just a choice?"}],"COMMENT":[{"date":"2023-03-12T13:45:08.006547Z","msg":"also make sure to add a learning section in the homepage\ni'm trying to amass a collection of tutorials, i just need somewhere to put them :D"},{"date":"2023-03-09T12:23:24.51397Z","msg":"subscrubbed :)"},{"date":"2023-03-07T23:36:38.41398Z","msg":"nice work, guys :)"},{"date":"2023-03-06T14:00:31.565352Z","msg":"lol i did it before you though\nhttps://www.khanacademy.org/computer-programming/new-beans/4556057804849152"},{"date":"2023-03-06T13:54:26.059478Z","msg":"wow look at the sphere it has no jagged pixelated edges"},{"date":"2023-03-06T13:11:46.271541Z","msg":":O\nHe did a collide\nVote++"},{"date":"2023-03-03T20:07:08.443617Z","msg":"honestly i'm super disappointed bro, i was kinda looking forward to playing this :P"},{"date":"2023-03-03T20:06:27.892424Z","msg":"this had better be just bursting with quality"},{"date":"2023-03-03T15:31:06.624659Z","msg":"for some reason i hadn't resubbed until now :P"},{"date":"2023-03-03T13:31:07.5156Z","msg":"nice nice"},{"date":"2023-03-03T13:29:35.276372Z","msg":"nice work dad!"},{"date":"2023-03-02T22:57:16.294034Z","msg":"that looks cool as heck my boy"},{"date":"2023-03-01T18:51:42.085814Z","msg":"nice game!\n\none tip: don't make fake loading screens. just cut to the game if you're not actually loading any images :P"},{"date":"2023-03-01T16:29:33.448298Z","msg":"nice erosion bro"},{"date":"2023-03-01T14:21:44.867468Z","msg":"~[\"Team 1\", \"Team 2\", \"Team 3\", 5]~"},{"date":"2023-03-01T00:49:52.673671Z","msg":"not as good because the \"rout\" is text, not shapes\ncringe"},{"date":"2023-02-28T20:58:25.427768Z","msg":"welcome back :D"},{"date":"2023-02-28T13:09:50.623876Z","msg":"i got killed by myself ???"},{"date":"2023-02-27T21:44:18.319Z","msg":"yep, that's the image loading alright. what exactly did you do?"},{"date":"2023-02-27T19:54:34.413716Z","msg":"*Make sure to subscribe*! ?\n\nAkbaba\nhttps://www.khanacademy.org/cs/i/5778863486599168\nNIKO\nhttps://www.khanacademy.org/cs/i/5414125302235136\nDominic R.\nhttps://www.khanacademy.org/cs/i/5329071780184064\nTeam Astro\nhttps://www.khanacademy.org/cs/i/5562534333825024"},{"date":"2023-02-27T19:51:53.266872Z","msg":"i love gunz"},{"date":"2023-02-27T13:25:49.117467Z","msg":"the funny thing is that they keep getting better."},{"date":"2023-02-25T23:26:20.595029Z","msg":"my dude left coc and has two programs on the first row of the hl\n\nbruh"},{"date":"2023-02-25T13:40:29.562077Z","msg":"thanks! looks great."},{"date":"2023-02-23T18:49:04.037133Z","msg":"nice nice\n\nmaybe implement a restart button? other than that i like this\nanimations are very slick"},{"date":"2023-02-23T15:55:10.170954Z","msg":"omg where do i sub"},{"date":"2023-02-22T19:01:08.83779Z","msg":"is it always rock?"},{"date":"2023-02-22T13:32:12.84226Z","msg":"ok, looks interesting.\n\nis the sky going to be included in the chunks or do they just cut off at some point? like the x-chunks are going to continue \"infinitely\" but the y-chunks should have designated stopping and starting points."},{"date":"2023-02-20T19:38:02.447964Z","msg":"responsive ski.js? my repo will become obsolete! :O"},{"date":"2023-02-20T19:27:48.224216Z","msg":"`generation thread`\n*YB and DR*"},{"date":"2023-02-20T19:09:21.736446Z","msg":"`chat thread`"},{"date":"2023-02-18T17:52:14.912766Z","msg":"i love chatgpt bro it's so much smarter than i am ?"},{"date":"2023-02-17T01:12:22.273031Z","msg":"was about to say what paperwad said xD\n\nawesome job!"},{"date":"2023-02-17T00:25:41.166339Z","msg":"another NF fan!\n\npumped for the new album :D"},{"date":"2023-02-16T23:41:26.766599Z","msg":"looking great :)\n\ncan you give me any details on what specific blocks you're making? like dirt, rock, ores?"},{"date":"2023-02-16T14:25:43.370947Z","msg":"i love hexagons <3"},{"date":"2023-02-15T23:41:29.18591Z","msg":"ah. you got the bracket in the wrong place.\n```\n// correct\nconst levels = [[\n    \"bp                    b\",\n    \"bb                   xb\",\n    \"bbbbbbbbbbbbbbbbbbbbbb\"\n    \n    ]\n    \n    ];\n```\n\nand also no i didn't have anything as of the current moment. when's the deadline and could you explain the theme? thanks :)"},{"date":"2023-02-14T17:44:47.921636Z","msg":"this looks fantastic!\n\nany reason why the score text isn't completely centered?"},{"date":"2023-02-14T12:15:40.932039Z","msg":"let's submit this because it's something and not nothing. i'd rather submit something than nothing, and we can always change it later before they judge it lol\n\ni want you to release it because you did most of the work. whenever you want to is fine."},{"date":"2023-02-13T23:50:48.642926Z","msg":"nice asteroids bro\n\nwait that's cap they're meteors"},{"date":"2023-02-13T12:37:20.988443Z","msg":"subbed :)"},{"date":"2023-02-13T12:32:45.519363Z","msg":"nice work guys!\n\nas a note, the gun controls are kind of infuriating, especially to Windows users who have to deal with sticky key alerts (press [shift] 5 times in rapid succession). not sure if that's what you were going for :P"},{"date":"2023-02-12T14:09:52.105271Z","msg":"bro.\ni'm bewildered.\n\nthis looks insane xD"},{"date":"2023-02-11T01:10:05.208093Z","msg":"nice work! very long list xD"},{"date":"2023-02-09T22:17:41.738351Z","msg":"no ive been ded for abt five months"},{"date":"2023-02-09T15:14:24.947983Z","msg":"red screwdriver lol"},{"date":"2023-02-08T22:09:14.132836Z","msg":"html thumbnail issues? no sweat with thumbnail.js!\nhttps://www.khanacademy.org/computer-programming/thumbnailjs/6737783223271424\n\npurchase it now and get 59% off with free shipping!"},{"date":"2023-02-08T22:07:35.800428Z","msg":"whhhAT iS ThIS"},{"date":"2023-02-08T22:06:47.81732Z","msg":"not you flexing on how many hits your library gets a month"},{"date":"2023-02-08T18:42:37.423491Z","msg":"interesting job boyz ???"},{"date":"2023-02-08T15:18:15.459948Z","msg":"subbed :)"},{"date":"2023-02-08T15:15:29.346534Z","msg":"might consider including this.\n```\n(function(){return this;})().LoopProtector.prototype.leave = function(){};\n```\nlooks really neat! :D\nlove that orange effect on the edges :O"},{"date":"2023-02-06T21:47:51.602032Z","msg":"neat neat\nfor CoC? o.O"},{"date":"2023-02-06T20:40:21.644487Z","msg":"fantastic, as a fellow ignes-er i am very proud :)\n\nyou could put this in the program to keep it from crashing when you scroll to the T&T.\n```\n(function(){return this;})().LoopProtector.prototype.leave = function(){};\n```"},{"date":"2023-02-06T20:34:36.502011Z","msg":"i'm here if you need anything :)"},{"date":"2023-02-06T14:01:30.327716Z","msg":"eagles!"},{"date":"2023-02-03T23:41:23.008965Z","msg":"what you're going to want to do is 1) use proper platformer physics and 2) slow that player down a bit.\n\nfor #1, you can take a look at one of my programs for now. i'll try to make a more personalized demo for you at some point but atm this is the best thing you can look at.\nhttps://www.khanacademy.org/computer-programming/ice-slide-wcc/6705944713281536\n\nas to #2, we shall delve into how side collisions work.\n\nwhen a player hits a wall from the right, we want him to be pushed left until he is no longer touching the block. likewise with the left.\nnote that *this only works because the system checks once per frame*. if during the same frame a player is moved in and out of a block, no collision will register. hence slow the player down so there's no chance of that happening.\n\nsorry that this isn't super in-depth. please ask if you have any more questions :)"},{"date":"2023-02-02T19:25:00.123745Z","msg":"my dude SPRAYING those bullets\n\nyo the graphics are better than mine tbh tho"},{"date":"2023-02-01T15:27:37.622017Z","msg":"nice work bro!\nknew you could finish it :)\n\nit looks great. devilishly hard though."},{"date":"2023-01-31T18:58:31.061312Z","msg":"looks fantastic WW"},{"date":"2023-01-31T15:43:31.704786Z","msg":"looks pretty neat!\n\nnice work mr. ferret!"},{"date":"2023-01-31T02:10:40.354842Z","msg":"please subscribe\ni am broke and need money\n\nhttps://www.khanacademy.org/computer-programming/subscribe/5329071780184064"},{"date":"2023-01-30T23:39:20.003522Z","msg":"that's fantastic. every element is just perfect.\n\nawesome job levi! this is my new fav of your games :)"},{"date":"2023-01-30T21:48:21.99405Z","msg":"Fantastic work Mr. Lemon!"},{"date":"2023-01-30T19:14:10.461643Z","msg":"hmmm...\novervoted but somewhat true.\n\nmy tips on how to grow your network?\n1) talk to people. every comment is a link to your profile page ?\n2) that being said, comment literally everywhere so people can see you're here and what you're like.\n3) actually make some good stuff. when i see someone talking around, i'll look at their programs. if the stuff you make is trash, i don't really care about who you are or what you do because you're not going to provide any insight to me.\n\nik it might sound harsh, but if you don't add to my value, i'm not likely to like you as a coder. you'll just be that one annoying little \"fan\" that i can't get rid of."},{"date":"2023-01-30T19:07:46.049668Z","msg":"nice bear bro"},{"date":"2023-01-30T18:43:47.812755Z","msg":"nice.\n\nthe message i took too long to learn? if you don't like it, leave.\ntheir site, their rules.\n\nthere are many places that are more worth your time if you're actually thinking about programming something serious."},{"date":"2023-01-30T13:00:44.470502Z","msg":"best homepage no cap\n\ngood luck coding mr. polar!"},{"date":"2023-01-29T14:21:23.40088Z","msg":"@bio\nyour entry isn't the best though. it's legit what you did last year with better art and different weapons. levi's is better no cap."},{"date":"2023-01-27T21:40:08.10512Z","msg":"nicely done mr. cow\n\nwait till the cleveland major league baseball team sees this"},{"date":"2023-01-27T21:35:44.568951Z","msg":"for pete's sake man, touch some grass!"},{"date":"2023-01-26T13:00:41.270343Z","msg":"ooOOh\ni see my evil twin levi is here as well >:)"},{"date":"2023-01-25T19:24:30.808921Z","msg":"Hi Chase!\n\nThis is looking fantastic so far :)\n\nMake sure to use reverse iteration when you're looping through the pipes. You might notice that currently there's a blinking effect going on when a pipe is removed. Change your iteration method on line 332 to fix it.\n```\nfor (var i = pipes.length; i--;) {\n```"},{"date":"2023-01-25T16:50:37.087204Z","msg":"moo. yeehaw."},{"date":"2023-01-25T16:08:01.119051Z","msg":"omg itz a gun !?!?!\nmuch violence ????"},{"date":"2023-01-24T19:54:13.364142Z","msg":"It looks okay so far. I'm going to give you a little tip about how you detect when the key is pressed - you're not doing it the right way. Try this:\n```\nvar keys = {};\nkeyPressed = function() {\n    keys[keyCode] = true;\n};\nkeyReleased = function() {\n    keys[keyCode] = false;\n};\n```\nI know it looks confusing. I'm not even going to explain it right now, just copy and paste it at the top of your program.\n\nNow, instead of calling `if (keyIsPressed && keyCode === UP)`, you can just call `if (keys[UP])`!\n\nHere's code that moves the player left and right. You can try switching the keys to different keys like `UP` and `DOWN` if you like :)\n```\nvar a=1;\n\nvar keys = {};\nkeyPressed = function() {\n    keys[keyCode] = true;\n};\nkeyReleased = function() {\n    keys[keyCode] = false;\n};\n\ndraw= function() {\n    background(255, 255, 255);\n    if (keys[RIGHT]) {\n        // same thing as a = a+1 or a+=1\n        a++;\n    }\n    if (keys[LEFT]) {\n        // same thing as a = a-1 or a-=1\n        a--;\n    }\n    // player\n    fill(255, 0, 255);\n    rect(a,308,12,12);\n    // ground\n    fill(171, 17, 17);\n    rect(0,320,407,81);\n};\nfill(255, 0, 255);\nrect(0,308,12,12);\nfill(171, 17, 17);\nrect(0,320,407,81);\n```\nMore questions?"},{"date":"2023-01-24T15:02:39.209195Z","msg":"no way bro :O\n\nthat's fantastic!"},{"date":"2023-01-23T17:53:47.561063Z","msg":"dat's awesome\ndat's also kid friendly for sure"},{"date":"2023-01-23T15:35:13.512316Z","msg":"karlson must be avenged >:("},{"date":"2023-01-22T00:00:25.207282Z","msg":"the overall vibe of this is just fantastic. keep it up! :D"},{"date":"2023-01-21T23:15:39.590173Z","msg":"this is incredibly cool :O"},{"date":"2023-01-20T21:39:07.246699Z","msg":"level 4 is sus ?"},{"date":"2023-01-20T19:55:25.579657Z","msg":"what does the code from HS do? line 32."},{"date":"2023-01-20T00:48:19.892446Z","msg":"the one thing i would say is to like maybe smooth out the rotation and turning a bit? it's kinda jerky rn\n\ndon't ask me how to do it though lol, maybe use `lerp` in some form?"},{"date":"2023-01-18T02:32:41.340971Z","msg":"i don't know how to benchmark ;-;"},{"date":"2023-01-18T02:29:13.85872Z","msg":"resubscabbed :D"},{"date":"2023-01-18T02:26:45.261187Z","msg":"well. joke's on the people who only got 8, because by harnessing the power of a line of code that *I specifically mentioned in 16 Things*, I got to 11 and could have gotten further had I not become bored with waiting.\n\n```\n(function() {return this;})().LoopProtector.prototype.leave = function() {};\n```\n\nIt crashes because the loop protector goes nuts after it waits for long enough. Removing loop protection removes crashes :)\n\nProps, fractals suck to make. They're fun to look at, though! :D"},{"date":"2023-01-17T15:35:07.534829Z","msg":"nice :)\n\nwhy not just use ski.js? concerned that it'll dock us CoC points?"},{"date":"2023-01-17T15:23:33.470269Z","msg":"you guys are absolutely stacked"},{"date":"2023-01-14T22:09:37.650341Z","msg":"that's neat. is it supposed to look blurry on the inside? o.O"},{"date":"2023-01-14T20:21:56.492693Z","msg":"i don't vote graphics B)"},{"date":"2023-01-13T00:51:20.107735Z","msg":"very minimalism\nvery animation\n\nmuch nice"},{"date":"2023-01-13T00:46:35.137778Z","msg":"Nicely done! Had a lot of fun playing this :)\n\nOne thing I would suggest improving for future games would be to implement reverse iteration. If you notice during the boss fight, sometimes the lava will blink as it comes at you. This is because you're iterating through the loop the normal way instead of reverse.\n\nHere's a quick explanation: https://www.khanacademy.org/computer-programming/why-reverse-iteration/5054876917743616"},{"date":"2023-01-12T15:53:27.819787Z","msg":"`*Daily(ish) Dev Tips*`\n\nPost a single period here (.) to instantly get tips, pointers, and guides to concepts in web and game development.\n\nNote: I am a bit more active in this thread than my regular sub thread, so be aware that you will get more notifications - think about 1 every two days or so.\n\n_keep at top, thanks =)_"},{"date":"2023-01-11T21:36:18.193356Z","msg":"nice"},{"date":"2023-01-10T12:21:57.906127Z","msg":"I'm actually so excited to play this right now xD\nI'll get back to this with gameplay comments, all I can say right now is that it looks super slick!\n\nedit:\n13614! really cool game, i love all the little touches you added that add to the ux. and yes, you ctrl-f proofed it and that is sad :("},{"date":"2023-01-10T12:11:54.770269Z","msg":"honestly, i don't dislike it. it just lacks some of the functionality of the others.\n\nit's a good-looking homepage for being made in PJS. well done! :)"},{"date":"2023-01-09T20:21:18.620891Z","msg":"nicely done. took me a while to get the concept, but after a while i figured it out xD"},{"date":"2023-01-09T18:43:48.82825Z","msg":"don't you dare choose to exercise that option i unknowingly agreed to\n\ni like pizza too much :(("},{"date":"2023-01-09T18:32:41.458363Z","msg":"Fantastic job. I love how smooth everything feels, and how you had the nerve to use canvas instead of PJS. Astro's right, this is one of the best recreations I've seen on KA :O"},{"date":"2023-01-09T17:56:06.180012Z","msg":"amazing where did you get your inspiration :O"},{"date":"2023-01-09T14:25:48.778491Z","msg":"#savageninjaski"},{"date":"2023-01-09T13:25:41.017997Z","msg":"Nice game overall. Kind of bummed that that's all the gameplay there is to it, but the graphics look really cool and the box-action is pretty neat."},{"date":"2023-01-09T13:21:36.670601Z","msg":"meep meep"},{"date":"2023-01-09T13:07:44.251444Z","msg":"Another fantastic, original concept executed flawlessly.\n\nWonderful job Mr. Indie :D"},{"date":"2023-01-07T21:27:39.294601Z","msg":"nicely done mr. lemon!\n\ntoo much self-advertisement though xD"},{"date":"2023-01-06T21:25:23.771389Z","msg":"i got you bro\nthanks :D"},{"date":"2023-01-06T21:05:50.703934Z","msg":"notes - it's pretty much fully responsive and looks good on any kind of device as far as i know\n\nworking on the other pages atm :D"},{"date":"2023-01-06T01:14:42.46308Z","msg":"this is awesome, dude. fantastic work.\n\ni love the videos :O"},{"date":"2023-01-05T18:06:12.975891Z","msg":"happy birthday! :D\nwhy isn't your beautiful corner logo that i made on this >:("},{"date":"2023-01-03T01:02:26.087609Z","msg":"yay thanks Astro!\n\nsucks we don't have the intellisense though, xP."},{"date":"2023-01-03T00:44:48.604184Z","msg":"subbed, my good man!\n\nhow did I miss this? o.O"},{"date":"2022-12-28T00:19:55.412772Z","msg":"festive greetings; ho ho ho and all that.\n\nget anything good? i got NF merch, B).\nas well as bulk Tootsie rolls to fuel my sugar addiction but that's unimportant and beside the point"},{"date":"2022-12-20T15:24:29.417728Z","msg":"very interesting mr. xacer"},{"date":"2022-12-17T01:57:05.429493Z","msg":"wow, it's so bright :O\n\nnice work! looks like you got the basics down, time to move on to more advanced stuff like better UX and responsive design :)"},{"date":"2022-12-17T00:04:16.002374Z","msg":"oh yeah dude you got minecraft in the bag haha\n\nwhy does it have that fade effect when you drag the mouse though? and when are you gonna get the cursor lock enabled?"},{"date":"2022-12-14T14:15:27.885785Z","msg":"very happy you're making these. super helpful for those of us who are smol brain."},{"date":"2022-12-13T22:21:54.12429Z","msg":"the aesthetics are beautiful\nnicely done sir"},{"date":"2022-12-13T22:08:39.471099Z","msg":"nice, :D!\ncan confirm about the extension."},{"date":"2022-12-12T23:18:01.885427Z","msg":"`then i said \"imma end this mans whole career\"`\n\nbest quote of 2022 imho"},{"date":"2022-12-12T01:50:40.373005Z","msg":"anytime you can one-up old vexy, you should.\n\nnicely done chap."},{"date":"2022-12-09T22:40:49.669284Z","msg":"yay! :D\n\nalso lol everyone knows Christmas is better than CoC"},{"date":"2022-12-08T12:16:31.620818Z","msg":"anything but platformer and dodge gamez.\n\nfor me, i know how to make the elements of the game - i just falter on putting them together and getting a finished product. maybe make a tutorial about smooth transitions and scene changes?\n\nalso show us how to make battle royale ai that fight each other >:)"},{"date":"2022-12-07T17:57:39.925811Z","msg":"ohhh such kwality :OO\n\nthank you for blessing us all with this meme"},{"date":"2022-12-06T15:20:56.079426Z","msg":"i won with a score of upwards of 3 trillion. not sure if that's possible.\nto clarify, i say i won with a certain amount of hope in my circle as the game doesn't seem like it'll end anytime soon :P\n\nvery mysterious..."},{"date":"2022-12-05T17:49:42.743761Z","msg":"greetings.\n\nhow's life? glad to hear you're alive haha, i almost forgot that you existed .-.\n\ngood to hear you'll be back. the HL is in grave need of `_*kwality*_`."},{"date":"2022-12-02T16:32:07.929147Z","msg":"impressive! :)"},{"date":"2022-12-01T20:04:17.907752Z","msg":"wow graphic"},{"date":"2022-11-29T15:29:58.513413Z","msg":"super pumped that we're on the same team again.\n\ngood luck with this, I'm sure it'll look great! :D"},{"date":"2022-11-29T13:08:56.575356Z","msg":"hey Cardstock! :D\nyour code makes me sad. it's too complicated haha, do this instead:\n\n```\nvar pluscreativity = new button(300, 140, 40, \"+\", function () {\n    Creativity = constrain(Creativity + 1, 0, 10);\n});\nvar minuscreativity = new button(100, 140, 40, \"-\", function () {\n    Creativity = constrain(Creativity - 1, 0, 10);\n});\n```\nor just add and subtract in the functions and constrain the values when the mouse is clicked or something, I understand the above could be considered a bit overkill :P"},{"date":"2022-11-21T14:03:39.638212Z","msg":"sounds like you haven't been drinkin' your water, >:(.\n\nhave a good hiatus :)\nbut come back plz the HL will suffer without your presence"},{"date":"2022-11-18T20:23:14.919561Z","msg":"yeah, nodejs ftw! :D\n\ngreat to hear that you're doing well. you should check in more often lol, i almost forgot about you :P"},{"date":"2022-11-16T21:43:56.877431Z","msg":"Hey, nice game!\n\nAre you new around here? I'm seeing you on the HL a lot recently lol, really like the vibe your games give off."},{"date":"2022-11-07T19:08:36.930934Z","msg":"well gosh"},{"date":"2022-11-05T22:31:08.789958Z","msg":"this is totally better than any one of your collabs will be no cap"},{"date":"2022-11-02T15:45:26.234948Z","msg":"it's nice, but make the navbar responsive. when i make the screen smaller it just hides some of the other items and when I make it bigger, it just leaves a bunch of blank space."},{"date":"2022-11-01T01:00:56.766882Z","msg":"twenty-one pilots lets goo :D\nnice graphic!"},{"date":"2022-10-28T23:36:09.864027Z","msg":"wut happened, o.o?\n\nprobs classified lol"},{"date":"2022-10-27T12:24:28.171663Z","msg":"switch the player switchin' code to the keyReleased function please :D\n\n`keyPressed = function() {\n    keys[keyCode] = keys[String(key).toLowerCase()] = true;\n};\nkeyReleased = function() {\n        \n    if (keys[81]) {\n        currentPlayer = currentPlayer === 1 ? 2 : 1;\n    }\n    \n    delete keys[keyCode];\n    delete keys[String(key).toLowerCase()];\n};`"},{"date":"2022-10-27T12:21:51.352901Z","msg":"Not bad, Lemon :D\n\nLove the juicing. However, you don't die when you fall on the 7th level, and the 6th level played twice for me for some reason :P"},{"date":"2022-10-22T13:29:13.079785Z","msg":"make a game with html canvas :D"},{"date":"2022-10-20T13:57:18.070347Z","msg":"subscrubbed :D"},{"date":"2022-10-19T16:34:13.822071Z","msg":"woah woah woah\n\nis this gonna have neural networks for the user drawing?\nr e s p e c t"},{"date":"2022-10-17T23:16:03.174098Z","msg":"yesss recursion :D"},{"date":"2022-10-14T22:52:04.776441Z","msg":"sorry mine is broken again xP\n\ni'll check on levers in a minute. aren't they just buttons that stay on until you push them off?"},{"date":"2022-10-14T22:27:45.994834Z","msg":"disappointment\nhere's an idea\n`\n// Rocket Dodge\n// Original by Dominic R.\n// https://www.khanacademy.org/computer-programming/rocket-dodge-khantober/6380979532382208\n`"},{"date":"2022-10-12T19:36:39.614187Z","msg":"never take an L no more"},{"date":"2022-10-12T13:01:00.974747Z","msg":"i had a dumb history teacher. she failed me for butchering my citations rip"},{"date":"2022-10-12T00:14:07.143306Z","msg":"you're so good that it's becoming slightly concerning. i remember when you made snow pounce, that seems so long ago that i feel old lol"},{"date":"2022-10-11T23:47:17.754339Z","msg":"added the ice\nhttps://www.khanacademy.org/computer-programming/alr-added-ice/5435052948766720\n\ni might put some levels together? need to go work on a khantober entry though lol"},{"date":"2022-10-11T16:11:06.984003Z","msg":"yep. screw the devs tbh"},{"date":"2022-10-11T14:20:17.482519Z","msg":"This is really polished, and everything feels really smooth.\n\nNice work :D"},{"date":"2022-10-11T14:02:57.442477Z","msg":"that's the second best rick astley i've ever seen"},{"date":"2022-10-10T13:55:56.604702Z","msg":"Fantastic work! Love the physics :D"},{"date":"2022-10-10T12:21:20.613219Z","msg":"well done :D"},{"date":"2022-10-09T23:30:41.521966Z","msg":"the intro is absolutely dope\n\ni want to watch it all right now but i have school :(\n\nallow me also to note this is the first time I've seen you use PJS for something other than testing or one-upping people in a while."},{"date":"2022-10-08T16:21:57.259451Z","msg":"This is really neat to watch :D\n\nMaybe replace the printing to the console with some text instead? When I comment out line 442 it runs about 10 frames faster, and I think replacing that with text wouldn't lag nearly as much."},{"date":"2022-10-07T12:57:43.130435Z","msg":"yay html thumbnails :D"},{"date":"2022-10-06T18:29:05.430973Z","msg":"https://www.khanacademy.org/computer-programming/tutorial-reference/5518849343537152 is the collection i put together for my personal use, maybe you can find something interesting."},{"date":"2022-10-06T14:14:00.945154Z","msg":"so much cringe\nbut it's better than my best so who cares :D"},{"date":"2022-10-06T01:10:52.649306Z","msg":"Fantastic! :)"},{"date":"2022-10-05T21:49:02.07358Z","msg":"don't tell anyone but this is my new wallpaper"},{"date":"2022-10-05T21:37:13.057009Z","msg":"screw you for one-upping me\n\nbut can you turn an external image into ascii? >:)"},{"date":"2022-10-05T18:20:48.858871Z","msg":"very ready for all the good work done by khantober to get destroyed in three days.\n\nnice work guys"},{"date":"2022-10-05T00:15:52.090299Z","msg":"why is it flapping all around? you're calling random every frame, so it's giving you a new random number every frame."},{"date":"2022-10-04T19:47:46.39544Z","msg":"that's you? a bit like I imagined honestly\n\nnice work :)"},{"date":"2022-10-04T19:08:34.642367Z","msg":"hi cyberwolf!\n\nluwagga's down for the count. should I just do this challenge alone or do you have someone else I can work with?"},{"date":"2022-10-04T12:40:16.316061Z","msg":"very impressive :D"},{"date":"2022-10-04T12:17:49.161831Z","msg":"it crashed :("},{"date":"2022-10-04T11:55:28.325179Z","msg":"that's actually fascinating :O\n\nthis could be the next big game development thing on KA :D"},{"date":"2022-10-04T11:38:08.382161Z","msg":"this is cool.\n\ni think i'll update it so it's easier to change the density of the pixels with a variable. shouldn't be too hard."},{"date":"2022-10-03T14:51:47.357321Z","msg":"love this game :D\nso satisfying!"},{"date":"2022-10-03T14:35:48.03519Z","msg":"is your new thread hidden for just me? that's disappointing :P"},{"date":"2022-10-03T14:26:29.385865Z","msg":"toasty and astro made the best ones imo, so kudos to them :D"},{"date":"2022-10-03T14:20:50.458844Z","msg":"best pool physics i've ever seen tbh"},{"date":"2022-10-03T00:00:12.525288Z","msg":"ever wonder why both of you got banned? seems pretty obvious to me (spam, *off-topic conversation*).\n\nKA isn't the place for that. the people who are here are here to code, not to be involved in an emotional support center :P\nnot a bad thing, it's just that the guardians aren't very forgiving when it comes to off-topic convos and spam.\n\nand this program is possibly making it worse. don't ask for spinoffs, it's against the guidelines."},{"date":"2022-09-27T16:03:33.655698Z","msg":"I'll join for Wednesdays :D"},{"date":"2022-09-27T13:57:40.728549Z","msg":"nice work!\n\ncongrats on two years :D"},{"date":"2022-09-26T16:16:22.590116Z","msg":"it's kinda unfair that you got your bro for the first round of khancorrenza lol\n\nkinda worried about how good luwagga'll be, o.o."},{"date":"2022-09-26T16:11:57.140342Z","msg":"Hey, it seems I'm your teammate for the first round of Khancorrenza. We're up against ski and Fer Fer, so we won't have it easy.\n\nIf you can, please try to let me know what times you'll be on and what skills you bring to the table in the nest day or so :D"},{"date":"2022-09-22T20:47:16.022529Z","msg":"woah, I couldn't decide whether it was breathing or not until I scaled it up, o.O."},{"date":"2022-09-21T12:53:13.841012Z","msg":"Make sure to use other people's code, though. The best programs are not accomplished by one person, but by many people building off of one another's ideas and code. Just give credit where credit is due :D"},{"date":"2022-09-20T00:23:13.827456Z","msg":"Um, is that even a question?\n\nIf you chose quantity, you'd be fully responsible for the demise of the HL. Your pick."},{"date":"2022-09-19T14:11:28.398142Z","msg":"Nice concept. A step above the classic dodge game, so I commend you for that.\n\nSome things to maybe improve...\n - Make the background move like a parallax so it looks like you're actually going somewhere.\n - Maybe put some more work into the graphics like the tunnel.\n - Try to cut back on lag by image-izing some normal things, like the rocks or the player.\n - Make a loading system, and don't just make me sit here and watch the computer crash as it tries to load the 3 images you do have. This is something you do for all of your games/graphics, and it gets kind of annoying that you can't implement a system that would fix a bunch of problems for the future. I _highly_ recommend you look into adding one to your future games. (https://www.khanacademy.org/cs/-/4894256982441984)\n\nOverall it's not bad. Looking forward to Avatar War :D"},{"date":"2022-09-19T14:00:16.316547Z","msg":"cool graphic :D"},{"date":"2022-09-18T00:38:03.975257Z","msg":"nice work my guy ski\n\ndidn't expect anythin' less though. bold of you to turn in your entry before the comp starts."},{"date":"2022-09-17T14:48:40.061581Z","msg":"notes to myself in the T&T because oh boy i sure do love clean code with no unnecessary comments at all whatsoever"},{"date":"2022-09-16T13:26:14.254306Z","msg":"i love how you're singlehandedly pushing KA to it's limits and challenging everything that anyone has ever made.\n\nprevious font fix? gone, this is better.\nggscript? gone, ski.js is better.\nleaf's thumbnail fix? gone, thumbnail.js is better."},{"date":"2022-09-16T13:23:12.063957Z","msg":"add `user-select: none;` to the title. i don't like the fact that I'm able to highlight it.\n\nlooks great! hopefully this isn't what I'm up against."},{"date":"2022-09-16T13:20:53.81802Z","msg":"neat.\n\n\"doesn't have a safe zone\" is a good way of describing you haha"},{"date":"2022-09-14T15:28:10.114629Z","msg":"tournament, you say?"},{"date":"2022-09-13T19:01:14.113502Z","msg":"wow nice"},{"date":"2022-09-13T11:45:19.624296Z","msg":"nice work :)\n\nalways great to see a decent game on the HL."},{"date":"2022-09-12T18:19:51.392907Z","msg":"Sometimes it seems like Willard did a great thing making this, but other times it seems like he was just setting the HL up to fail with these spinoffs, =P."},{"date":"2022-09-09T18:00:01.766521Z","msg":"that star shape is neat :o"},{"date":"2022-09-09T17:59:00.662797Z","msg":"heyyy\njust found out I don't actually have enough time to manage this so I'm dropping out, sorry :(\n\ngood luck though, rooting for you guys :D"},{"date":"2022-09-09T15:01:02.014261Z","msg":"I like the effect you got with the leaves :D"},{"date":"2022-09-06T19:04:03.973597Z","msg":"woah, o.o."},{"date":"2022-09-06T14:01:44.546226Z","msg":"look its a hi-kwality meme\n\nalso allow me to s?t?e?a?l? borrow all of your code"},{"date":"2022-09-05T12:31:02.048775Z","msg":"he's helping him! :D\n\nnice."},{"date":"2022-09-04T20:09:08.074967Z","msg":"nice font :D"},{"date":"2022-09-02T18:32:40.78674Z","msg":"subscrubbed"},{"date":"2022-09-02T17:54:20.983764Z","msg":"ugh spiderz =P"},{"date":"2022-09-02T13:40:29.378378Z","msg":"lol the silence is deafening\n\nand yeah make a motivation thread i've hit rock bottom"},{"date":"2022-08-31T17:50:31.309575Z","msg":"6 months later..."},{"date":"2022-08-30T14:20:24.463978Z","msg":"really nice webpage :D\n\nalso you're not clearly better than we are lol"},{"date":"2022-08-30T14:01:51.770035Z","msg":"awesome job, you two! :D"},{"date":"2022-08-30T13:49:39.599507Z","msg":"so squish much wow"},{"date":"2022-08-30T13:22:22.813625Z","msg":"fantastic :D"},{"date":"2022-08-30T00:28:00.958529Z","msg":"this looks great! maybe format the data at the bottom in a table?\n\ni'm advanced btw ;D"},{"date":"2022-08-29T18:06:52.433967Z","msg":"So long, Ace.\n\nGood luck out there :)"},{"date":"2022-08-29T12:55:22.973681Z","msg":"oooooh neat! looking forward to this :D"},{"date":"2022-08-29T12:20:37.629179Z","msg":"that's pretty neat :O"},{"date":"2022-08-28T14:03:00.872767Z","msg":"got it"},{"date":"2022-08-26T12:13:11.207188Z","msg":"1. :D\n2. 15 and like 1/3 or something like that lol\n3. I kinda thought that actually\n4. Oh nice! I can barely touch my toes smh\n5. :(\n6. Yeah I've got you in height by almost a foot tbh lol\n7. I'm not a nerd, I just learn really fast so I get good grades haha. The only thing I nerd out about is coding\n8. Not even gonna try to guess lol\n9. aw man I love bunnies they're so cute <3\n10. rap is so awesome tbh\n11. yeah  science is a drag for me honestly. math is fun though :D\n12. star wars is neat! just rewatched episode V :D\n13. yeah I'm a total introvert lol\n14. nice! :)\n15. that's sad, I don't have a ton of irl friends either.\n16. i didn't know Zoe, but it's sad when someone dies :(\n\ni love the backgrounds on this program! nice work :)"},{"date":"2022-08-26T11:52:17.389905Z","msg":"subbed :)"},{"date":"2022-08-25T17:31:18.90823Z","msg":"#whaleanddolphingang"},{"date":"2022-08-24T22:47:04.31996Z","msg":"glad to see you back! :)"},{"date":"2022-08-24T12:55:42.450197Z","msg":"so cute :D"},{"date":"2022-08-24T12:55:01.94999Z","msg":"Nice! :D"},{"date":"2022-08-24T12:51:56.691816Z","msg":"Yeah! We need more of these kinds of games on KA :D\n\nalso love that it's mobile-friendly ngl"},{"date":"2022-08-24T12:48:29.349202Z","msg":"Fantastic work, Lemon! Looking forward to the sequel :D"},{"date":"2022-08-23T17:29:01.564826Z","msg":"nice job, Astro! :D"},{"date":"2022-08-19T12:58:23.011754Z","msg":"Subbed! :D"},{"date":"2022-08-18T14:46:00.955756Z","msg":"Awesome! I love how they go from gray to colored :D"},{"date":"2022-08-18T14:22:57.924406Z","msg":"nice work, Joe! :D\n\n\n\nwait wait wait are you Ky? no way"},{"date":"2022-08-18T12:38:03.216523Z","msg":"yesss thank you manager boi\n\nalso isn't the height thing annoying?"},{"date":"2022-08-17T20:11:28.803946Z","msg":"nawww\nthat's actually incredible.\n\nthanks for this timeless wisdom, cappy!\n\np.s. i copied your transition object and am going to use it under my name. sue me."},{"date":"2022-08-17T19:36:24.4691Z","msg":"`*REQUESTS THREAD*`\nTell me anything you want to see a post about! \nAny programming concepts, game development tricks, or something you think would be fun :)\n\n_keep at top, please_"},{"date":"2022-08-17T19:35:19.034926Z","msg":"`*BLOG THREAD*`\nPlace a period ('.') in this thread to get updates when I post.\n\n_keep at top, please_"},{"date":"2022-08-17T18:08:54.009799Z","msg":"it's not showing anything :("},{"date":"2022-08-17T18:02:45.54005Z","msg":"no no the bacon must perpetually dance\n\ndance bacon dance"},{"date":"2022-08-17T14:04:55.844575Z","msg":"not ski finally making his rpg\n\n\n\nalso i want your manager's autograph"},{"date":"2022-08-17T14:03:40.38051Z","msg":"subbed to a nonexistent sub thread :D\n\nalso what's with your name haha"},{"date":"2022-08-16T14:22:56.062964Z","msg":"and now, time for the big reveal.\n\nfun fact: i didn't actually win the voting to be a judge, i just disguised an alt to vote for me >:D\n\n\ncongrats to Harry though, he did a great job as did the rest of the contestants. Hoping you'll host this next year, Cora. maybe then I'll have enough support to _legally_ become a judge lol"},{"date":"2022-08-16T12:23:40.946325Z","msg":"looks great amigo :D"},{"date":"2022-08-11T17:03:09.873136Z","msg":"he he he haw"},{"date":"2022-08-11T16:34:37.111479Z","msg":"My day just got better lol"},{"date":"2022-08-09T14:50:39.819916Z","msg":"Fantastic work Toasty! :D"},{"date":"2022-08-05T15:36:33.590743Z","msg":"pew pew"},{"date":"2022-08-02T11:56:30.649453Z","msg":"yess you should totally do that. just a simple top-down scroller base, the hard part would be correctly proportioning everything and stairs.\n\ngl, :D!"},{"date":"2022-08-01T18:52:59.070312Z","msg":"fantastic work, this looks amazing :)"},{"date":"2022-08-01T16:32:50.082382Z","msg":"holy moly"},{"date":"2022-08-01T12:25:05.055556Z","msg":"nice work LC, this looks fantastic :D\n\nexcept the transitions. don't like the transitions lol"},{"date":"2022-07-31T20:39:32.292568Z","msg":"Nice game! You're new to KA?"},{"date":"2022-07-30T12:47:27.277704Z","msg":"The oceans are finally transparent! Fantastic work :D"},{"date":"2022-07-30T12:40:21.178915Z","msg":"Nice work LC! :D"},{"date":"2022-07-28T14:05:47.605636Z","msg":"fantastic game. I approve."},{"date":"2022-07-28T00:22:14.359455Z","msg":"That it is. The devs looked to have changed it.\n\nOne of these days we'll wake up and they'll have done a complete site overhaul :P"},{"date":"2022-07-27T23:02:55.245161Z","msg":"HuH whHAT the DEadlINe IS TomOORow?\n\nWHywhy Did I sSUBMIT EarLY SMh"},{"date":"2022-07-27T22:29:33.911952Z","msg":"totally entering\ni've won so many already so why not lol"},{"date":"2022-07-27T16:18:07.710519Z","msg":"hmmHmmmmMmm wat dis be"},{"date":"2022-07-27T13:43:01.702621Z","msg":"love the art style :)"},{"date":"2022-07-27T00:20:21.027814Z","msg":"Congrats on the TCC win! Looking forward to many more awesome programs.\n\nSubbed :)"},{"date":"2022-07-27T00:10:12.045732Z","msg":"Fantastic work! :D\n\nThe lag though, =P. A few tips for future platformers:\n\n - Only draw blocks when they're on the screen.\n - Break out of the loop protector."},{"date":"2022-07-27T00:05:17.169296Z","msg":"and why you're on KA instead of being out there making money is anyone's guess"},{"date":"2022-07-26T21:26:36.59118Z","msg":"nice :)"},{"date":"2022-07-25T13:18:53.033913Z","msg":"looking great! tip: check out a game on Scratch called Zombies by theChAOTiC. it's a fantastic top-down shooter in this kind of style.\n\nsince it's a simpler concept though, I would be sure to add tons of skins, guns, and achievements to keep the player grinding to collect them all."},{"date":"2022-07-25T13:14:58.243076Z","msg":"Looks great! Sorry I didn't comment when it came out, I saw it on the HL but was on vacation lol\n\nlooking forward to release :D"},{"date":"2022-07-25T12:51:58.383375Z","msg":"Fantastic! The lag is really bad though speaking from experience, how I went around it was writing it all in an `sq.constructor()`. Still not sure how or why it worked, but the lag decreased so much xD"},{"date":"2022-07-24T22:28:40.607233Z","msg":"remind me to collab with you when you get back\n\nthis is pretty dope"},{"date":"2022-07-24T20:02:41.054251Z","msg":"what would you say if I made a battle royale in one day for the next challenge?"},{"date":"2022-07-21T12:36:43.948244Z","msg":"subscrubbed :D"},{"date":"2022-07-21T12:35:18.813271Z","msg":"fantastic stuff. loved this show as a kid, you did a great job recreating it xD"},{"date":"2022-07-19T22:51:04.166753Z","msg":"nice work :)\n\nI got 13.2 lol"},{"date":"2022-07-19T22:48:38.706812Z","msg":"`*STEELERSSSSS*`\n\nno cap. eat it up, browns."},{"date":"2022-07-19T21:14:47.070752Z","msg":"It would mean a lot to me if you subbed :)\nhttps://www.khanacademy.org/computer-programming/subscribe/5329071780184064"},{"date":"2022-07-19T18:07:17.230372Z","msg":"wow, nice! :D"},{"date":"2022-07-18T15:55:33.536871Z","msg":"Awesome work :)"},{"date":"2022-07-18T13:52:51.190983Z","msg":"Also it still says 'bee' in the code instead of 'lion' lol"},{"date":"2022-07-16T14:11:28.514658Z","msg":"well well well, a parallax? fancy.\n\ngood luck, sir. you'll need it, >:)."},{"date":"2022-07-16T12:47:10.779352Z","msg":"beautiful."},{"date":"2022-07-14T20:43:50.034173Z","msg":"Nice work, you two! The particles that follow the player are a nice touch, help me make sure I'm not going down the same path twice lol :)"},{"date":"2022-07-13T18:31:16.063728Z","msg":"Nice! Love the art style."},{"date":"2022-07-13T18:29:34.34799Z","msg":"i'm happy to rejoin as a judge or participant.\n\nor just call the game. your call."},{"date":"2022-07-12T16:44:26.894756Z","msg":"and what exactly is the big program you're undertaking? I'm open to collab if you'd like to."},{"date":"2022-07-11T21:54:25.896025Z","msg":"That's fantastic. Good to see another program from you lol, it's been a while but I think we're all happy to wait for such `_*kwality*_`"},{"date":"2022-07-11T14:28:13.208259Z","msg":"Nice work GW!\n\nPlan to make a game with the 3D, or you're just gonna keep making models? Just curious :D"},{"date":"2022-07-11T12:13:15.104362Z","msg":"such style much wow"},{"date":"2022-07-07T18:10:33.723226Z","msg":"that's pretty legit :O"},{"date":"2022-06-27T14:18:33.24916Z","msg":"lets goo first :)\n\nlooks great. might join, but I'm dead so maybe not lol"},{"date":"2022-06-21T21:19:45.014735Z","msg":"funeral preparations for my framerate are underway\n\nbut cool nonetheless."},{"date":"2022-06-17T12:20:43.912691Z","msg":"nice lol. did not expect this quality from a speedround, ngl"},{"date":"2022-06-15T12:40:14.373815Z","msg":"Awesome game! I like the button animations, and how original the game is. Keep it up! :D"},{"date":"2022-06-15T12:24:54.172363Z","msg":"Nice particles! I love the little effects, like the planets.\nI know it was a speed round, but here are some things I'd like to see next time:\n - parallax effect with the stars and planets\n - smooth movement (maybe changing a velocity when the key is pressed, and changing the x by that velocity?)\n - maybe some text in the program that says how to control it?\n - and move everything out of the `draw` loop, it's a bit crammed. maybe use OOP for the stars, planets, and rocket? it's a bit overboard, but it would've gotten you more points for sure.\n\nOverall, fantastic work! So psyched to see your next entry to the comp!"},{"date":"2022-06-14T22:01:15.933821Z","msg":"Nice!"},{"date":"2022-06-14T14:10:05.871917Z","msg":"Hands down the best game I've seen all Primavera. Why?\n\n- The graphics are incredible and really fit the mood.\n- The platforming itself is so polished, and I love the wall jumping.\n- You did it in canvas. Crazy stuff.\n- The juicing is really awesome.\n- The lights are raytraced, and that's fantastic.\n\nHowever, I've got a few suggestions/observations.\n- More particles spawn on the walls than on the floor. IDK if this was intentional lol\n- My brother said it would be cooler if you could squish enemies lol\n- The text is a bit loud. Maybe tone it down a bit in the how tab?\n- Maybe introduce abilities of the player in-game instead of making them visit the how to know how to do things like walljumping? And make a way for the player to discover things like the lights without dying.\n\nAs I said, fantastic game. Y'all should be super proud of what you accomplished :)"},{"date":"2022-06-14T11:57:31.180256Z","msg":"safe to say mountaintop had the biggest finale of any of the teams lol"},{"date":"2022-06-09T19:08:40.392139Z","msg":"this epic\napproved"},{"date":"2022-06-09T18:38:55.197662Z","msg":"responsive, smooth, and a slick gradient. knocked it out of the park, man! :D"},{"date":"2022-06-09T15:42:12.782452Z","msg":"sub for a turtle named Bob/Fred/Dominic (idk lol)\nhttps://www.khanacademy.org/computer-programming/subscribe/5329071780184064"},{"date":"2022-06-08T21:19:17.526784Z","msg":"Oh yeah baby D for Dominic\n\nedit: does this mean my bribery was in vain? o.O"},{"date":"2022-06-01T12:45:49.636839Z","msg":"your activity is stunning\n\nedit: 'accepted' not 'excepted' :)"},{"date":"2022-05-31T18:17:40.723963Z","msg":"squishy boi"},{"date":"2022-05-31T14:31:01.750227Z","msg":"love the juicing my dude"},{"date":"2022-05-31T00:15:37.805518Z","msg":"cringe imagine stalking"},{"date":"2022-05-30T13:07:11.602617Z","msg":"Nice work! :)\n\nMaybe add `user-select: none;` to the `box` selector to prevent the user from highlighting the words on the box?"},{"date":"2022-05-30T11:25:19.951884Z","msg":"wait wait wait\nyou leaving? D:\n\nedit: no this isn't in the questions tab. sue me."},{"date":"2022-05-29T19:38:27.243911Z","msg":"bro lines 22-25 are genius, ngl"},{"date":"2022-05-28T00:16:46.803616Z","msg":"put `e.preventDefault()` in the keyDown event listener. It'll prevent the page from scrolling up and down when you press the keys\n\nother things you need to get done rn?"},{"date":"2022-05-26T12:08:56.539909Z","msg":"dang that's cool. didn't think it was moving at first lol"},{"date":"2022-05-26T12:07:08.411461Z","msg":"*Terratrice Chat Thread*\nPlease report in here so we can discuss our final entry.\n\n`TDJ\nBladesmith\nPaperwad\nDominic R.`"},{"date":"2022-05-26T12:05:35.582115Z","msg":"nice dad"},{"date":"2022-05-23T19:46:32.316722Z","msg":"nice job LS! this is amazing :)"},{"date":"2022-05-23T19:34:53.14426Z","msg":"Pretty good! :D"},{"date":"2022-05-23T19:12:19.606268Z","msg":"eyyy a f4stb01 graphic! nice work :D"},{"date":"2022-05-23T18:04:41.350352Z","msg":"woah o.O"},{"date":"2022-05-23T15:22:09.159999Z","msg":"bEanS"},{"date":"2022-05-22T23:00:08.251657Z","msg":"masterpiece"},{"date":"2022-05-19T20:43:27.792306Z","msg":"That's really awesome! Maybe use something to break out of the loop protector to prevent crashing and speed things up a bit."},{"date":"2022-05-18T00:18:44.377749Z","msg":"Is the workaround for Google Fonts allowed in the PJS environment? I didn't think so, but I might be wrong."},{"date":"2022-05-17T22:11:02.326241Z","msg":"Change line 296 to this to get rid of the spacing between blocks:\n\n`ctx.translate((-player.x + width/2) | 0, (-player.y + height/4) | 0);`\n\nThe `| 0` simply truncates the decimal which causes the spacing, you could also use `floor()` or `~~`."},{"date":"2022-05-12T23:02:42.830731Z","msg":"sorry I'm getting to this late lol, was working on my own one-hour thing - they're tough =/\n\nthis is really good for 50 minutes! nice work as usual :D"},{"date":"2022-05-12T21:27:28.933817Z","msg":"one two three four\nclick this link and join the subber corps\n\nhttps://www.khanacademy.org/computer-programming/subscribe/5329071780184064"},{"date":"2022-05-09T21:06:37.55177Z","msg":"nice work LS :)"},{"date":"2022-05-09T20:00:11.394482Z","msg":"good job :D"},{"date":"2022-05-09T19:02:32.109446Z","msg":"b.r.u.h"},{"date":"2022-05-09T13:19:23.653004Z","msg":"nice work :)\nI like the car lol"},{"date":"2022-05-09T12:20:44.163954Z","msg":"Is that the donut from Scratch? lol"},{"date":"2022-05-08T13:54:57.159198Z","msg":"wow, nice! :)"},{"date":"2022-05-08T00:58:32.939781Z","msg":"it's only scary to people who like efficient code."},{"date":"2022-05-06T17:24:47.839971Z","msg":"I think you guys did a great job with this game. The button animations are really legit. Also, the code is really clean and organized. I got 13, only because I got four shades of white that were almost identical haha"},{"date":"2022-05-06T14:23:13.348469Z","msg":"no way. schools are awesome, and they've taught me 90% of what I know."},{"date":"2022-05-04T20:16:12.610701Z","msg":"this is so relatable that it's not even funny"},{"date":"2022-05-04T20:15:21.862907Z","msg":"One of the better games I've seen this week. Voted :D"},{"date":"2022-05-04T17:26:13.507934Z","msg":"*waits for the ferret to appear*"},{"date":"2022-05-04T16:34:09.516905Z","msg":"so you can de-vote with the extension? I need to get this lol"},{"date":"2022-05-04T15:45:23.217512Z","msg":"Nice work ED! Hard to believe this is all in 29 lines, o.O."},{"date":"2022-05-04T14:51:54.372107Z","msg":"cool haha\nbut you told me not to vote so I didn't :D"},{"date":"2022-05-04T12:22:26.257609Z","msg":"good job dad"},{"date":"2022-05-03T19:02:54.285302Z","msg":"that's talent right there, ngl"},{"date":"2022-05-03T14:19:02.372423Z","msg":"i refuse to vote this but its so beautiful"},{"date":"2022-05-03T00:35:48.190556Z","msg":"*Subscribe* for the full game: https://www.khanacademy.org/computer-programming/subscribe/5329071780184064\n\n_keep at top, thanks =)_"},{"date":"2022-04-28T12:18:43.180853Z","msg":"Subbed :)\n\nYou're a real legend man, keep makin' those great programs!"},{"date":"2022-04-27T15:08:24.868138Z","msg":"Nice work lol\n\nKind of a weird lookin' dude, but the animation is really smooth."},{"date":"2022-04-27T12:06:17.07961Z","msg":"you're killing us americans with your kgs and cms, =P.\nthank goodness for google amiright.\n\nI was once underweight, but then I rediscovered Taco Bell. Things have been goin' downhill from there xD\n\nI got roughly 20.3 lol"},{"date":"2022-04-27T11:59:32.556723Z","msg":"looks like all of that work paid off, o.O.\n\nI like the jitter effect lol, putting that one in my toolbox."},{"date":"2022-04-27T11:53:04.923769Z","msg":"wow, clean code from a graphics maker.\n\n_`*respect*`_"},{"date":"2022-04-22T18:14:57.034991Z","msg":"You could simplify this greatly by taking advantage of one of PJS's predefined functions.\n\n`noStroke();\n\nmouseDragged = function() {\n    fill(random(0,255),random(0,255),random(0,255));\n    ellipse(mouseX, mouseY, 20, 20);\n};`\n\nSo whenever the mouse is dragged, it generates a new color and draws a new ellipse. No draw function needed! :D"},{"date":"2022-04-22T14:06:27.276713Z","msg":"Taco Bell is amazing, best restaurant on Earth hands down.\nStill mad they got rid of the Frito Burrito though >:(\n\nNice fax tho lol, listening to Perception rn o.O."},{"date":"2022-04-21T23:22:52.234194Z","msg":"how jank"},{"date":"2022-04-21T20:35:23.375016Z","msg":"Looks pretty good! Nice work.\n\nHere's a T&T crashing protector lol\n`\n// Credit to Daniel (@dkareh)\n(function() {return this;})().LoopProtector.prototype.leave = function() {};\n`"},{"date":"2022-04-18T22:01:42.114059Z","msg":"`*Subscribe Here*`\n\nPost a single period (.) here to be instantly notified when I release new programs. Thanks for subbing!\n\n_keep at top, thanks =)_"},{"date":"2022-04-13T16:06:17.627569Z","msg":"LOL got some strong opinions going here xD\nNice work! I like the gradients :)"},{"date":"2022-04-12T20:29:07.2167Z","msg":"Really good! Nice work on this, I love the feel of the parallaxes :)\n\nCrashed while I was in the T&T though, please use something to leave the loop protector lol\n`/* Credit to Daniel (@dkareh) */\n(function() {return this;})().LoopProtector.prototype.leave = function() {};`"},{"date":"2022-04-12T15:40:06.082407Z","msg":"sub sub sub\nhttps://www.khanacademy.org/cs/-/6663821525565440\n\n_keep at top pls thank u ^-^_"},{"date":"2022-04-09T14:48:55.779409Z","msg":"watch out green ghost =]"},{"date":"2022-04-07T18:06:34.94974Z","msg":"that's an `u b e r` sweet lookin' castle right there"},{"date":"2022-04-07T18:00:13.251156Z","msg":"Dat's pretty cool."},{"date":"2022-04-02T13:35:01.590625Z","msg":"bye =("},{"date":"2022-04-01T18:09:25.728674Z","msg":"s m h"},{"date":"2022-03-31T12:31:05.892861Z","msg":"no pjs yes"},{"date":"2022-03-29T00:40:36.645483Z","msg":"cool :)"},{"date":"2022-03-28T20:40:45.94213Z","msg":"Cut myself while cutting rolls after being told *not to*, but never on a grape. I'll have to try it sometime o.O\n\nIn all seriousness though, I'm not insane and will never be. Being a brilliant intellectual is fun ;D\n\n_cheetos_"},{"date":"2022-03-28T14:52:02.417524Z","msg":"that kiwi is adorable mate"},{"date":"2022-03-26T18:39:46.067354Z","msg":"sub because I am smol and need money ;-;\nhttps://www.khanacademy.org/cs/-/6663821525565440"},{"date":"2022-03-25T18:13:16.751544Z","msg":"Not used to seeing graphics from you, but it's quite good! Nice work."},{"date":"2022-03-24T15:41:05.445484Z","msg":"Eyy, a dedication! Thanks so much GR, looks great :D"},{"date":"2022-03-23T19:48:51.054443Z","msg":"Eyy it's Veggietales :D\nNice work! Looks really cool."},{"date":"2022-03-23T19:47:08.348339Z","msg":"Looks good! Get rid of the draw loop though, you don't need it because this is art, not moving stuff. Then it doesn't crash when you scroll to the T&T :D"},{"date":"2022-03-22T21:56:03.663806Z","msg":"Nice intro! :D"},{"date":"2022-03-21T11:37:23.039691Z","msg":"dang those eyes tho UwU\n\nI don't know why anyone would flag this haha but I like the warning :D"},{"date":"2022-03-15T22:42:10.365317Z","msg":"those buttons are legite"},{"date":"2022-03-15T12:07:49.48047Z","msg":"First! Where's the thread lol\nEdit: found it and subbed :)"},{"date":"2022-03-15T11:46:02.227884Z","msg":"Looks great! Nice work on this, love the graphics :)\n\nEdit: Just realized it has music :O"},{"date":"2022-03-15T00:22:30.547942Z","msg":"It's a nice concept! I think you did a good job on this."},{"date":"2022-03-14T22:55:32.828754Z","msg":"Nice work! Kind of hard to play, maybe explain a bit more =]"},{"date":"2022-03-14T22:22:54.454327Z","msg":"Looks really clean, even from the thumbnail. Nice work on this apex :D"},{"date":"2022-03-14T13:00:01.48845Z","msg":"Nice job on this - the transitions are so smooth, and the game is really fun to play."},{"date":"2022-03-13T22:31:37.218596Z","msg":"First! Cool graphic :D"},{"date":"2022-03-13T14:23:24.289568Z","msg":"ha much funny very art"},{"date":"2022-03-13T14:06:36.166814Z","msg":"*hurt noises*\n\nlooks good lol"},{"date":"2022-03-11T22:30:47.369027Z","msg":"*happy LtCD noises*\n\nnice graphic :)"},{"date":"2022-03-11T20:08:11.423301Z","msg":"First! Nice job on this :)"},{"date":"2022-03-11T19:08:47.168034Z","msg":"Congrats!\nHow did I not see this before? I'll be spending a while pondering all this excellent information :D"},{"date":"2022-03-11T13:22:15.754692Z","msg":"Some pixel art tutorials =]\n*KWC*: https://www.khanacademy.org/computer-programming/pixel-art-tutorial/5439200909410304\n*Gray Wolf*: https://www.khanacademy.org/computer-programming/creating-pixel-art/6192620261818368\n\nThis looks awesome btw. I'm thinking about making a Paper Minecraft remake, so these would be _really_ helpful xD"},{"date":"2022-03-09T15:51:49.842631Z","msg":"UGH YOU TRICKED ME LOL\nI voted this up before it loaded thinking it was going to be an epico graphic.\noi oi oi *you can't just do that bro you can't just do that*"},{"date":"2022-03-09T14:04:33.878344Z","msg":"Nice work Bladesmith! It's so hard though haha"},{"date":"2022-03-09T13:25:04.588523Z","msg":"Looks good! You didn't have to change the `IMAGE_CIRCLE()` code though, just comment out the call to the circle function and uncomment the call to the pixel function."},{"date":"2022-03-09T01:09:58.905703Z","msg":"Amazing stuff. Very much hi-kwality."},{"date":"2022-03-08T23:32:22.073109Z","msg":"Wow Andrew, this is incredible! The gameplay is excellent, I love how the jumping and the choos work :D\n\nIf I had to suggest one thing, it would be new graphics. I realize that this is an old wip, but you could definitely make some new graphics that are more simplistic and fit the theme better.\n\nAgain, this is really awesome! More judging feedback to come from myself and the judges after the deadline. :)"},{"date":"2022-03-08T23:16:55.156639Z","msg":"Excellently and extreme hi-kwality.\nheh"},{"date":"2022-03-08T21:12:40.135911Z","msg":"Love the cleanness and minimalism of your games. My 2000th vote-up goes to you :D"},{"date":"2022-03-08T12:42:52.506823Z","msg":"Nice work - juice it up a bit and you'd have a really awesome game ;D"},{"date":"2022-03-07T21:34:23.419954Z","msg":"This is really awesome and clean! Love the design.\nMaybe add a few themes with different colors?"},{"date":"2022-03-07T18:00:59.503274Z","msg":"Haha, I love this! The shading and everything is really well done. Awesome job! :)"},{"date":"2022-03-07T14:10:57.304223Z","msg":"G'bye Levi :(\n\nEnjoyed knowing of you, if not knowing you personally. You were such an inspiration to us, we're all gonna miss you.\n\nGood luck in your future endeavors =]"},{"date":"2022-03-05T12:21:15.450408Z","msg":"My, someone's gettin' a lot of things done this weekend xD"},{"date":"2022-03-03T12:36:54.855845Z","msg":"Nice job guys - love the UI :D"},{"date":"2022-03-02T17:44:37.420323Z","msg":"cool :)"},{"date":"2022-03-02T00:32:37.828438Z","msg":"Pfft. He turned into IA, not Sal Khan.\njk nice program :D"},{"date":"2022-03-01T15:36:02.207026Z","msg":"lol *you're really askin' for it*.\n\nalso, to quote your subpage, \"I post around twice a month, so no spamming will take place.\"\n_yeah right_\n\nnice graphic though ;D"},{"date":"2022-02-28T12:29:23.111481Z","msg":"You are now literally one of my favorite gamemakers xD\nAwesome job on this, Cyberpack! It was a pleasure competing with y'all :)"},{"date":"2022-02-27T23:35:58.274772Z","msg":"Your clean code is making me happy :D\nNice work on this!"},{"date":"2022-02-27T20:02:46.34197Z","msg":"Awesome!\n_yay, I'm a friend :D_"},{"date":"2022-02-26T15:27:27.348607Z","msg":"awesome!\nthis is really good and underrated lol, recreatin' monopoly is *not* an easy task to pull off."},{"date":"2022-02-26T15:23:57.47231Z","msg":"yay, meme text! lol\n\nnice work! looks really cool :)"},{"date":"2022-02-26T15:06:40.766491Z","msg":"happy birthday! :D"},{"date":"2022-02-25T13:29:47.039619Z","msg":"subbied :)"},{"date":"2022-02-24T19:11:01.021555Z","msg":"dis `*mazterpiec*`\ni vote up an suB coz u cool :3\n\n*dictionaries are for the wEaK*"},{"date":"2022-02-23T21:10:26.453098Z","msg":"StAHp MakIng GraPhiCs lol\ncool :)"},{"date":"2022-02-23T14:23:20.045576Z","msg":"Subbed!"},{"date":"2022-02-23T14:14:15.213864Z","msg":"*Team Orange Leaf Sub Thread*\nComment a period (\".\") in the thread below to recieve updates when we release programs!\n\n_keep at top, thanks_"},{"date":"2022-02-23T12:45:58.377513Z","msg":"fascinating.\n\nSo Winston being a \"stop sign ahead\" sign is maybe because everyone, in his or her coding journey will reach a point where they hit a mental \"stop sign\".\nAnd you saying \"go have a snack\". It's clearly because having a snack is one of the cures of this mental block (I find that a nice bag of Takis is the perfect thing to \"set your mind alight\", one might say.)\n\nSo now we get down to the math. Four points on the sign, one Winston. What's four minus one? *Three*. And we know what three means, don't we? :)\n\n_wink wink nod nod_\n\n*edit*: woah woah woah, eight votes? this took me two minutes to write lol"},{"date":"2022-02-23T12:36:55.85156Z","msg":"cool :)\nI think you could've done some things to make this `hi-kwality`, such as making smooth scrolling with `lerp()`.\n\n\n\nthe absence of my name is startling O.o"},{"date":"2022-02-22T15:13:48.086738Z","msg":"love the transitions xD\n\n_kableeshaboom_"},{"date":"2022-02-21T21:34:40.048365Z","msg":"This is really awesome! Learned so much cool stuff about ciphers :D"},{"date":"2022-02-21T21:05:34.212584Z","msg":"the right one is what everyone wants their graphics to be\nthe left one is what everyone's graphics turn out to be :P\n\nunless, of course, you're F4stBo1.\n\n\nbut I would give anything to make my graphics look like either, so good job both of you ;D"},{"date":"2022-02-21T13:44:25.761556Z","msg":"muy chulo :D"},{"date":"2022-02-20T20:25:57.974621Z","msg":"yeah, going to sub to the stalky thread now so I can make your life miserable >:)\n\njk but watch out for I am the *KiNg* of stalkers"},{"date":"2022-02-20T20:23:33.342128Z","msg":"lookin' good :)"},{"date":"2022-02-19T23:35:44.190151Z","msg":"now I'm curious as to what your big game will be lol O.o"},{"date":"2022-02-17T23:19:36.958943Z","msg":"Nice information!"},{"date":"2022-02-17T15:22:45.568404Z","msg":"Forget algebra homework, I'm just doing this lol"},{"date":"2022-02-15T20:36:39.222902Z","msg":"Looks cool :D"},{"date":"2022-02-15T20:24:31.446372Z","msg":"literally spent weeks on this lol\nbut _finally_ got 24.17.\nthat's pretty good, right? :P"},{"date":"2022-02-15T15:57:33.511579Z","msg":"Uncle Bob is named after Bob Ross, right? lol\nThis is an awesome story. A wee bit creepy, but the descriptions are awesome.\nYou clearly have a gift for this :)"},{"date":"2022-02-14T18:44:41.534439Z","msg":"Yes, another `size()` advocate! :D\nReally cool, much better than I could do lol :P"},{"date":"2022-02-14T13:45:43.523326Z","msg":"subbed :)\nI love this subpage btw xD"},{"date":"2022-02-14T13:01:59.419273Z","msg":"*wAiT*\nthis must mean you live in Spain? lol idk\nbut she must live in France.\n\ncAsE cLoSeD\nno problem is too big for the big brain detective O.o"},{"date":"2022-02-13T21:33:11.968534Z","msg":"I want another collab with 21262 :D\nKhantrast was awesome, but I'd love to see what you could do without a deadline."},{"date":"2022-02-12T20:45:29.114593Z","msg":"lookin' good :)"},{"date":"2022-02-12T17:38:25.281428Z","msg":"*rages*\nIt's so hard though lol\nnice game :)"},{"date":"2022-02-11T21:49:01.096783Z","msg":"*reaction time, boyzzz*\n1. ouch\n2. good for you lol\n3. ...you're starting to really sound like someone I know lol\n4. nice :P\n5. *bOLd oF yOU To AsSumE ThAt YoU'Re A LEgEnD/fAmoUS* xD\n6. cool, but I got ya by 3 inches lol\n7. sameee (it helps that I only have two lol)\n8. IDK either :P\n9. sameee\n10. yep, I identify with that XD (being a genius is so hard, no one understands your amazing thoughts like putting buffalo sauce in cereal instead of milk :P)\n11. wait, I'm gettin' more content than I signed up for lol *subs again*\n12. off-topic, much? lol\n13?. _`*hi-kwality*`_"},{"date":"2022-02-10T14:51:47.872994Z","msg":"I like the range idea instead of just perpetually having them follow you :D"},{"date":"2022-02-09T12:58:06.439301Z","msg":"cute :D"},{"date":"2022-02-09T12:31:59.021623Z","msg":"3rd personally and my team got third too. Not bad for my first contest lol ?"},{"date":"2022-02-08T12:27:21.441414Z","msg":"1. You're pretty good at it to not use it in real life.\n2. O.o that's a lot\n3. wow lol I have a stalker who votes all of my wips up (don't know who and I wish they'd stop :P)\n4. hahaha that's funny everyone knows it stands for \"Laggiest Computer\" (jk jk)\n5. _same_ and I wish you would, your projects are cool :D"},{"date":"2022-02-07T14:38:16.859343Z","msg":"oOh hE's sO cUtE :3\nUwU"},{"date":"2022-02-07T14:23:33.753263Z","msg":"so many trust falls lol"},{"date":"2022-02-03T17:24:01.638851Z","msg":"subbed :D"},{"date":"2022-02-01T23:07:07.910074Z","msg":"autocorrect has saved my life many times lol O.o"},{"date":"2022-01-29T15:11:56.129181Z","msg":"wow, this is really good :D"},{"date":"2022-01-28T20:13:40.354535Z","msg":"idk, trig is actually really cool xD"},{"date":"2022-01-26T21:12:25.749051Z","msg":"Line 76, \"where\" instead of \"were\".\nReally informative! I'm looking forward to building my own scrolling games thanks to this :D"},{"date":"2022-01-26T18:46:23.285894Z","msg":"First and I am so hyped for this :D"},{"date":"2022-01-25T21:52:14.609215Z","msg":"I thought the ad was the game and I was like _no wonder 99% can't solve it because of this dumb hand that blocks my way >:(_\n\nannnd then I realized that it was just an ad XDDD"},{"date":"2022-01-25T19:33:28.117004Z","msg":"So cute, I love it :D"},{"date":"2022-01-24T22:02:12.979792Z","msg":"haha nice :)"},{"date":"2022-01-24T17:29:05.665462Z","msg":"Don't understand it at all, don't care.\n_I'm votin' up anyway :D_ \n\ncool game\nbut you better go study for your finals XD"},{"date":"2022-01-24T15:03:00.194723Z","msg":"OH YEAH that's epic\nresubbed because why not"},{"date":"2022-01-24T15:01:14.020147Z","msg":"subscribbled :)"},{"date":"2022-01-24T00:16:45.185452Z","msg":"U2FsdGVkX1/MBpM4R1gUmAn0A+w3eUZwt8KbVMGdsJqVBiJogccNAyHwuNBDB8UstU+/zdDKoGBq+GleplEkYvGS7vnImlAh1ohpBpNBt4SQ9DnClvrKnF2hkEeqFHMZkDjkWaTnYBC3DJ77OXl5w0T7UV8eb6bk5/KVC0exrJVrp5VO9RjRAwT0TsdeDSG1uoi+6HrnhOUaXDfOPjRLjSMj+r59jogouS02FZCJv00vyfQwiShvlFlQnzXFsNlj\n[*passcode=uwu*]\n\n`#secretcodesFTW`"},{"date":"2022-01-21T23:08:02.883621Z","msg":"Wow :O\nI love the pixel art :D"},{"date":"2022-01-20T16:19:40.390742Z","msg":"Cool, but it's *You're* not *Your*"},{"date":"2022-01-19T12:33:02.037484Z","msg":"lol what a trailer\n*this is a cinematic masterpiece*"},{"date":"2022-01-18T01:35:09.654649Z","msg":"creative :)"},{"date":"2022-01-17T13:53:14.713515Z","msg":"*i can't land* XD"},{"date":"2022-01-16T20:32:06.049253Z","msg":"lol the purchase goes to your subpage"},{"date":"2022-01-14T19:52:47.330604Z","msg":"first but I can't vote because I just went on a No Name graphics viewing spree and I _had_ to vote them all up lol\n*i'll vote later*\n\n*edit* the last scene killed my eyes, now I can't see the vote up button XD"},{"date":"2022-01-14T17:35:46.682712Z","msg":"yess new 3D tutorial for me to destroy my brain on =)"},{"date":"2022-01-14T15:23:35.345986Z","msg":"makes the avatars look cuter :3"},{"date":"2022-01-13T21:20:52.732886Z","msg":"`TEAM CHAT THREAD (OLD)`\n*members of Team SP only*\n\n_feel free to vote down, this is an outdated thread_"},{"date":"2022-01-13T19:02:38.961929Z","msg":"Nice, this reminds me I need to make my game for TWC :P\nit won't be as good as this lol"},{"date":"2022-01-10T20:56:28.399032Z","msg":"Subbed 1st tier, why can I see other people's periods XD"},{"date":"2022-01-09T20:54:40.870416Z","msg":"subscrubbed"},{"date":"2022-01-09T20:45:46.678021Z","msg":"cool =)\nand for 255 lines of code, it isn't bad at all"},{"date":"2022-01-09T20:35:57.857747Z","msg":"cool :)"},{"date":"2022-01-08T16:31:46.454558Z","msg":"oh yeah"},{"date":"2022-01-08T14:07:29.733935Z","msg":"uwu cat"},{"date":"2022-01-06T21:24:03.421485Z","msg":"`ARCHIVED SUB THREAD`\n\n`NEW SUB THREAD`\n`_*https://www.khanacademy.org/cs/-/5329071780184064*_`"},{"date":"2022-01-06T20:38:23.570769Z","msg":"subscribbled"},{"date":"2022-01-05T19:37:38.03244Z","msg":"Woah, this is really cool! I love the smoothness of everything and the fade-ins and outs. Really great job on this :)"},{"date":"2022-01-04T13:23:52.248361Z","msg":"rip slimy snek boi"},{"date":"2022-01-03T17:38:55.984238Z","msg":"*gets spammed with notifs of people signing up*\ngahhhhhhhh"},{"date":"2022-01-03T17:16:34.013736Z","msg":"*aRe YoU gOiNg To EaT tHaT cRoIsSaNt*\n\ncool tutorial"},{"date":"2022-01-03T00:19:58.001069Z","msg":"Brilliant!"},{"date":"2022-01-02T23:19:08.107568Z","msg":"Cool, but I think it looks better with `noStroke()`."},{"date":"2022-01-02T14:45:25.433329Z","msg":"yesss inspo for *team sneak peak* mwhahaha\njk i won't steal your stuff \nnice webpage tho :)"},{"date":"2021-12-27T16:05:54.104644Z","msg":"i subscribbled\n*merry christmas*"},{"date":"2021-12-23T22:56:26.012688Z","msg":"now i hungry darn XD\n\nreally nice job! the graphics are beautiful"},{"date":"2021-12-22T12:27:45.210542Z","msg":"bruh this is hilarious"},{"date":"2021-12-21T20:46:18.728043Z","msg":"Well this didn't age well XD"},{"date":"2021-12-21T19:52:05.941902Z","msg":"*CEREAL FIRST LOVERS UNITE*!\n\n`#cerealgoesfirst\n#nomushycereal\n#cerealbeforemilk`"},{"date":"2021-12-21T17:36:48.218269Z","msg":"*BRUH*\n\nthis is gold"},{"date":"2021-12-20T23:41:24.736625Z","msg":"I thought it was a rickroll but it was just rick standing still. *You rickstilled me*, I hope you're happy with yourself XD"},{"date":"2021-12-20T16:23:04.2146Z","msg":"A game like this could only come from the mind of a genius.\n_Or from a guy who really likes birds, pigs, and flaming popsicles XD_\n\nNice job on this, the graphics are *gold*"},{"date":"2021-12-18T20:58:45.232762Z","msg":"kool XD"},{"date":"2021-12-16T15:07:58.721838Z","msg":"`Note: my highscore with the below \"hacks\" is 2^34.\nOtherwise known as the 17,179,869,184 tile.\nthat's over 17 *billion* btw`\n_beat that plebes lol_\n\n*try setting grid size to 20 and just holding the up arrow key*\n\nits so beautiful\n\n*edit*\noh since someone upvoted I actually changed the code to make it better\n\njust delete the entire `keyPressed = function()` and replace the `draw = function()` with this:\n\n`draw = function() {\n    crunchUp();\n    spawnRandom();\n    drawGrid();\n};`\n\n`*oh yeah*`\n\noh and apparently Levi was inspired to let _everyone_ get the 2^34 tile so he just coded it in starting lol good for him"},{"date":"2021-12-12T20:08:08.203456Z","msg":"Looks good, maybe add an acceleration feature?"},{"date":"2021-12-11T21:03:50.071208Z","msg":"*I sUbScRiBbLeD*\n\nu welcome"},{"date":"2021-12-11T21:02:01.882924Z","msg":"YES been waitin for this XD"},{"date":"2021-12-11T20:44:13.558527Z","msg":"ah that is so beautiful"},{"date":"2021-12-07T00:21:08.913247Z","msg":"i subscribbled"},{"date":"2021-12-06T20:33:49.583368Z","msg":"but you should really make an option to speed the sugar up because waiting takes foreeeever"},{"date":"2021-12-01T21:00:53.809798Z","msg":"Looks good!"},{"date":"2021-10-27T16:44:59.114871Z","msg":"Really cool! There are some ways you could simplify your code. Instead of `*y2 = y2-2*`, try `*y2-=2*`."},{"date":"2021-10-27T11:47:47.696496Z","msg":"*World Series Game 1 Alert*\n\ncheck da score hehehehe"},{"date":"2021-10-26T19:11:56.308426Z","msg":"*I can never cheer for the Astros again after what they did*\n\n_And plus, everyone knows the Dodgers are superior. (get rekt Astros)_\n\nSo no, never cheering for the Astros.\n\n(but I approve of this epic logo, nice job)\n\n\nalso everyone vote up the comment by Dark Owl so the whole world can see the superiority of the Braves on a project endorsing the Astros XD"},{"date":"2021-10-25T20:16:33.18458Z","msg":"*Fantastic*! Loved it the entire way through. It's so simple yet fun. Amazing job!"},{"date":"2021-10-25T14:05:45.966683Z","msg":"Put the speed at max for about 5 minutes.\n\n*my man can eat anything he wants for the rest of his life and he won't ever be back to his original weight*\n\nNice job on this! voted++ :)"},{"date":"2021-10-22T19:00:14.518337Z","msg":"Really cool, has a lot of potential. Nice work! voted++"},{"date":"2021-10-15T14:24:28.054099Z","msg":":O I love the waterfall! Very creative artwork, excellent job! voted++"},{"date":"2021-10-13T12:32:43.738073Z","msg":"cute"},{"date":"2021-10-10T19:29:51.702165Z","msg":"I just learned about Baba Is You, and this is a very creative spin-off the game. Somewhat hard to understand at first, I would suggest putting more instructions (but I also understand this is a demo so it's understandable). Overall, very nice work! :)"},{"date":"2021-10-06T16:12:55.446766Z","msg":"subbed because you are epic"},{"date":"2021-10-01T16:41:54.596415Z","msg":"Sadness sets in realizing the administrator of this device has locked the console and I can't access it or the dev tools :("},{"date":"2021-09-30T13:16:11.079085Z","msg":"Very cool!"},{"date":"2021-09-29T15:14:34.415792Z","msg":"My new best game ever: 583 (my team) to 519, each player brought in over 100 flames, I brought in 228."},{"date":"2020-10-20T19:45:41.611139Z","msg":"I got a 470."}],"ANSWER":[{"date":"2023-03-09T02:21:51.390804Z","msg":"so i haven't asked SMV yet but as of right now the understanding is that she's making all of the stages of all six avatars.\n\nas she's got plans for them all already, i'm going to just let her do her. i'm sorry if that was the only thing you were interested in doing - i'm more than happy to get you another task if you'd like!\n\nyou too are awesome :D"},{"date":"2023-03-04T21:19:10.281887Z","msg":"but you weren't able to dig into it, were you? >:D"},{"date":"2023-03-03T21:25:37.800986Z","msg":"it means being hit with the song \"never gonna give you up\" by rick astley when you don't expect it."},{"date":"2023-03-03T00:41:08.283918Z","msg":"we're not planning to as of right now.\n\nSMV will be making six new, original avatars for the competition."},{"date":"2023-03-01T19:58:14.377825Z","msg":"Do you have code you could show me?\n\nThat's a problem sometimes. It all depends on how you check collisions. My method (and probably a method used by a ton of others as well) requires two separate loops to go through the blocks - one to check player y collisions, and one to check player x collisions.\n\nIn each loop, you'll check for a rectRect collision between the player and the block, and then if there is one, you'll do the following.\n\nY COLLISION:\n```\nthis.yv = 0;\nthis.canJump = b.y < this.y ? false : true;\nthis.y = this.y < b.y ? b.y - this.h : b.y + b.h;\n```\n\nyou might be wondering what the ? and : are about. it's called a ternary operator, and it's basically an if-else statement in one line.\n```\ncondition ? if true : if false\n```\n\nX COLLISION:\n```\nthis.x = this.x < b.x ? b.x - this.w - 0.1 : b.x + b.w + 0.1;\n```\n\nChange the velocities and stuff in between the loops (yv after y loop, xv after x loop).\n\nHopefully that makes a bit of sense."},{"date":"2023-03-01T19:48:34.340758Z","msg":"no, it kind of requires a mouse to break and place.\n\nmake an alternate command? idk, i don't think i would be able to engineer this for a phone if that's what you're asking :P"},{"date":"2023-03-01T14:10:08.801862Z","msg":"No, ski and I will be hosting Primavera 2023."},{"date":"2023-02-25T17:05:30.244524Z","msg":"https://www.khanacademy.org/computer-programming/-/5032527948464128"},{"date":"2023-02-17T00:43:40.386225Z","msg":"NF, the greatest rapper of all time."},{"date":"2023-02-15T23:12:38.669677Z","msg":"You can use the keyword `var` to declare variables in the PJS editor, as I'm sure you're aware of.\n\nThat line just allows you to use the other two keywords that are available with regular JS, namely `let` and `const`.\n\nUnlike regular JS though, they don't actually have any effect on the code. KA just goes through and replaces every `let` and `const` with `var` in the final code.\n\nTLDR; it's just a way that you can use `let` and `const` to declare variables instead of `var`.\nIf you delete the line, you'll notice that errors will be thrown wherever there is a `let` or `const` because PJS won't know what they mean."},{"date":"2023-02-15T01:14:01.470379Z","msg":"it's a spoof on a painting called american gothic by grant wood."},{"date":"2023-02-10T18:48:04.859103Z","msg":"Good day to you as well! :D\n\nIterating through an array with a for loop is easy. First you're going to want to set up a loop to traverse the array.\n\n```\nvar testArray = ['a', 'b', 'c', 'd', 'e'];\nfor (var i = 0; i < testArray.length; i++) {\n  // ...\n}\n```\nInside of the loop, accessing the elements is as simple as calling the element at the position of the iterator (`testArray[i]`).\n\n```\nvar testArray = ['a', 'b', 'c', 'd', 'e'];\nfor (var i = 0; i < testArray.length; i++) {\n  println(testArray[i]);\n}\n```\nThis program will output the following in the console.\n\n```\na\nb\nc\nd\ne\n```\nNow, does the variable have to be named `i`? By no means. This works as well.\n\n```\nvar testArray = ['a', 'b', 'c', 'd', 'e'];\nfor (var foo = 0; foo < testArray.length; foo++) {\n  println(testArray[foo]);\n}\n```\nAnd that's about it. Be sure to ask if you don't understand! :D"},{"date":"2023-02-09T19:07:20.602553Z","msg":"Complicated.\n\nShort answer? Have it always be shown on top of the page and toggle the width from x to 0 (where x is how wide you want it to be) when the associated button is pressed.\n\nLong answer? Look in the third style tag and the first script tag and try to piece a picture together. I'm happy to clarify anything in the code, but I can't give you a long answer at the moment."},{"date":"2023-01-25T19:49:41.398526Z","msg":"The Winter Coding Challenges, run by SMV and Ace Rodgers.\n\nhttps://www.khanacademy.org/computer-programming/wcc-2023/5317909013905408"},{"date":"2023-01-24T16:08:42.21297Z","msg":"Can you post a link to your program? I might be able to help :)"},{"date":"2023-01-22T12:26:16.535227Z","msg":"because it's sus\n\nread: i didn't put in that functionality lol"},{"date":"2023-01-22T12:26:05.815281Z","msg":"Hi,\n\nTo publish a program, you just hit the 'Save' button. Every saved program is available to the community."},{"date":"2023-01-10T13:53:18.686052Z","msg":"I think he said they're allowing 1-2 days for joining and then they'll begin the draft."},{"date":"2023-01-09T14:05:28.214775Z","msg":"Nope, it's just an unofficial team homepage. If it becomes the official one, a sub thread will be posted."},{"date":"2023-01-06T01:16:08.206998Z","msg":"use a transparent color in the background.\n`background(255, 255, 255, 0);`\n\n...\nfine, even i acknowledge his collisions are there to be stolen (with credit ofc) xD"},{"date":"2022-12-14T20:57:49.954599Z","msg":"Sit back, grab the popcorn, and hit the play button on the video you intend to watch.\n\nReally though, if you want to learn faster you'll pause the talkthrough and play with the code as the video goes on. The best way to learn is to experiment with something yourself."},{"date":"2022-12-14T20:56:29.897228Z","msg":"Type the following into the PJS editor and it'll show up.\n\n`image(getImage(`"},{"date":"2022-12-14T20:48:27.869749Z","msg":"My suggestion to you would be to check the spin-offs of this program and see if you can dig up some of the datasets that other people have copied into their copy of the program."},{"date":"2022-12-14T20:45:41.98127Z","msg":"Here's a simple example. Scrub the numbers around a bit and explore what you can do with just these couple functions.\n\n```\nrect(100, 100, 200, 100);\n\npushMatrix();\nrotate(30);\ntranslate(80, 10);\nrect(100, 100, 200, 100);\npopMatrix();\n```"},{"date":"2022-12-14T20:44:39.694652Z","msg":"You get 95% of the sticks. In this case I believe it's a *score of 38 or above*."},{"date":"2022-12-14T20:41:12.105136Z","msg":"Changing the line color is as simple as `stroke(r, g, b)`.\n\n```\nstroke(255, 0, 0);\nstrokeWeight(2);\nellipse(width/2, height/2, 200, 200);\n```\n\nAs to rotation, you can use `rotate()`. You probably won't understand all of the technicalities for a bit, but it's a quick fix. It helps to put `pushMatrix()` and `popMatrix()` around whatever you're rotating so everything else on the screen doesn't rotate too ;)\n\nAnother note - using `translate(x, y)` gives you more mobility as to how and where to move the rectangle after you rotate it. Why not stick that in there as well?\n\n```\nrect(100, 100, 200, 100);\n\npushMatrix();\nrotate(30);\ntranslate(80, 10);\nrect(100, 100, 200, 100);\npopMatrix();\n```\n\nHope this helps. Don't hesitate to ask if you don't understand."},{"date":"2022-12-14T20:35:38.816403Z","msg":"It means that something in the syntax of your code is not right, which caused your JS to be parsed incorrectly by the compiler. Check that all your code is written correctly according to JS syntax."},{"date":"2022-12-01T14:27:46.202476Z","msg":"Ah, thanks for letting me know.\n\nIf I had to guess, KA deprecated the comment API meaning that my JSON calls don't reach anything anymore - resulting in nothing displaying on the screen."},{"date":"2022-11-20T01:25:02.033843Z","msg":"set the background to white. should answer some questions."},{"date":"2022-10-12T00:02:54.647176Z","msg":"Honestly, do whatever you feel moved to do.\n\nThese guidelines are here to inspire your creativity. If you're paying so much attention to following the guidelines for a particular project that you're pushing creativity and learning away, then you're doing the equivalent of taking a class for an A. You're not learning anything.\n\nAs for tips, use a variety of different shapes and colors. You've learned quite a bit in this course already, why not challenge yourself to use as many techniques as you can?"},{"date":"2022-10-07T17:59:32.427986Z","msg":"Great question! Call the function `noLoop()` inside of the draw loop. This'll stop it from looping. To start it again, call `loop()`."},{"date":"2022-10-07T17:58:01.617155Z","msg":"Rounded rectangles can be made using the normal rect() function but with added parameters. So if you include x, y, w, h, and the last one which rounds the corners.\n\nNow here's the part that most people don't know - rect() actually has not four, not five, but *eight* parameters. The four corners of the rectangle all have an _individual_ corner-rounding parameter. Pretty neat, right?\n\n`rect(200, 200, 200, 200, 0, 100, 50, 10);`"},{"date":"2022-10-07T15:53:37.077338Z","msg":"It depends on what you want to do. If you want a new random number to be generated by the program automatically without you needing to hit the restart button, you need a draw loop.\n\n`draw = function() {\n   println(random(0, 10)); // prints a random number from 0 to 10 every frame\n};`\n\nBut to have a program that prints a random number every time you hit the restart button, no draw loop is required.\n\n`println(random(0, 10)); // prints a random number from 0 to 10 every time the program is restarted`"},{"date":"2022-10-04T16:59:09.005079Z","msg":"I use the characters on line 22.\n\nNote how they go from bigger to smaller characters. This is so that it looks like the brightness is different.\n\nLastly, the loop on line 45 actually draws out the text.\n\nedit: check out the spin-off by electric dolphin. it makes it so that you can copy the text too :D"},{"date":"2022-09-19T18:15:31.506738Z","msg":"A parameter is a way to get user information into a function in a way that alters how the function is run. Take this unit conversion function, for example. The value it returns changes with how many feet we want to convert.\n\n`var feetToInches = function(feet) {\n   var inches = feet * 12;\n   println(\"There are \" + inches + \" inches in \" + feet + \" feet.\");\n};\n\nfeetToInches(4); // \"There are 48 inches in 4 feet.`"},{"date":"2022-09-19T18:11:22.859814Z","msg":"Absolutely. The webpage you're on right now uses JS, as well as pretty much every webpage you've ever seen."},{"date":"2022-08-29T14:38:44.8177Z","msg":"At the most basic level, all computers know binary - the language which is expressed in 0s and 1s.\n\nOf course, coding in binary would be extremely tedious and perhaps impossible, and so programming languages that take more human-friendly code and convert it into binary were created."},{"date":"2022-08-23T15:50:33.738493Z","msg":"Probably somewhere between Intermediate and Advanced :)"},{"date":"2022-08-10T12:51:14.346915Z","msg":"There are a couple ways to do it, but the one that most accurately does what you want is accomplished by changing the `frameCount()` to something like 30. Just don't set it to 0, which is like setting it to as fast as it'll go.\n\nAlso note this will slow all objects down, because it's literally changing the frameCount (how many frames are drawn in a second)."},{"date":"2022-08-01T22:48:54.240378Z","msg":"As soon as you save the program, it will share it with the community. This means for projects you will have to create a 'spin-off' with your changes."},{"date":"2022-07-30T01:06:30.754598Z","msg":"I'm positive that someone will answer in more CS-related terms, but I'll give you a plain-English rundown.\n\n`return` is like when the function gives something back to you. Take this for example. Below I have two functions. One prints something, the other returns something that we will print.\n\n`function add(a, b) {\n    println(a + b);\n}`\n`function add2(a, b) {\n    return a + b;\n}`\n\nNow watch this.\n\n`\nadd(1, 2); // prints 3\nprintln(add2(1, 2)); // prints 3 \n`\n\nTo put it simply, return just returns whatever it's given to return in a function, and then you can do things with it like this.\n\nprintln(add2(add2(1, 2) + add(4 + 2))); // basically (1 + 2) + (4 + 2)\n\nHope this helps a bit. Please don't hesitate to ask if you don't understand something, this and parameters were the hardest things for me to grasp when dealing with functions."},{"date":"2022-07-25T14:40:26.929707Z","msg":"The default text size is twelve.\n\n`\nfill(0, 0, 0);\ntext(\"Default: Testing\", 10, 240);\n\nfor (var i = 2; i < 20; i++) {\n    textSize(i);\n    text(i+\": Testing\", 100,i*20);\n}\n`"},{"date":"2022-07-25T14:31:26.365591Z","msg":"That's the computer's way of knowing when the line is finished. It's a bit like a period in English."},{"date":"2022-07-25T13:09:14.297858Z","msg":"0 wins and 1 loss."},{"date":"2022-06-14T21:22:48.7687Z","msg":"I mean sure, I'll get to work on that. It's not that hard once you get the scrolling event down."},{"date":"2022-06-01T17:00:46.70187Z","msg":"ski said that Evan said it was, so I'm going off that.\n\nGo see our thread over in the tips and thanks if you want to see his wording."},{"date":"2022-05-31T15:11:21.0541Z","msg":"Not that I know of. After a restart, every variable value is erased unless you're using something like localStorage that stores values on the browser instead of in the editor, so to speak.\n\nMaybe you could find a workaround to restarting the program?"},{"date":"2022-05-31T15:07:24.094541Z","msg":"`function randomColor() {\n    return color(random(0,255),random(0,255),random(0,255));\n}`\n\nThen just use `fill(randomColor());` or something of the like."},{"date":"2022-05-31T15:04:37.101796Z","msg":"The *break* statement terminates a loop.\n\n`while (i < 6) {\n   if (i === 3) {\n      break;\n   }\n   i = i + 1;\n}\n\nprintln(i) // outputs 3.`\n\nThe *switch* statement is a simplified if-else chain.\n\n`var scene = \"play\";\nswitch (scene) {\n   case (\"play\"):\n      println(\"The video is playing.\");\n      break; // breaking out of the statement when we're done.\n   case (\"pause\"):\n      println(\"The video is paused\".);\n      break; // more on this later.\n}`\n\nThe above code will print \"The video is playing\".\nAs to the last break statement, it's not required. The last break statement in a switch statement is optional, but it's good to put it there anyway.\n\nAs to using *get*(): https://www.khanacademy.org/computer-programming/using-get/6532044731498496\n\nAs to *do* and *in*, google 'w3schools' or 'MDN' and look them up there. I would give you the links, but KA auto-hides links, =P."},{"date":"2022-05-31T14:49:40.652207Z","msg":"A boolean is just a variable that can store one of two values, true or false. So this variable down here is a boolean.\n\n`var skyIsBlue = true; // stores the value as true`\n\nThe values true and false aren't strings, rather they are values that the computer stores as ones and zeros.\n\nDoes this help? Please let me know, it wasn't a very in-depth explanation."},{"date":"2022-05-31T14:44:45.042492Z","msg":"Check this out.\n\nhttps://www.khanacademy.org/computer-programming/scrollbar-demo/5072421414027264"},{"date":"2022-05-31T14:42:18.606566Z","msg":"Nope, you can build fully functioning games with just JS, whether in the PJS or HTML environments here on KA."},{"date":"2022-05-19T20:05:40.371977Z","msg":"I suggest zooming out on your screen."},{"date":"2022-05-18T19:47:25.098641Z","msg":"WAD to move P1, S to shoot.\nUP LEFT RIGHT to move P2, DOWN to shoot.\n\nPlay against yourself or others, but mostly enjoy the physics that I spent days developing."},{"date":"2022-05-18T14:46:01.424791Z","msg":"might. might not. if I ever make a really big game, it'll have mobile support."},{"date":"2022-05-16T21:18:48.667516Z","msg":"Try the `rotate()` command."},{"date":"2022-05-13T14:26:27.022848Z","msg":"yeah, I have it in a `mouseClicked` PJS pre-defined function. if you were to change it to `mouseDragged`...points go brrrr."},{"date":"2022-05-12T11:53:11.948944Z","msg":"I could, yeah. Maybe I'll do that later."},{"date":"2022-05-11T12:06:32.544888Z","msg":"You can make sure by importing font libraries from google to make sure each computer has a copy of what the font should look like.\n\nGo here: *fonts[.]google[.]com* (remove [ ])\n\nSelect a font, and then scroll down on the selected fonts menu to \"use on the web\". Copy and paste the <link> import into your HTML document.\n\nHope this helps. Please ask any further questions if you have them :)"},{"date":"2022-05-10T13:27:03.318609Z","msg":"It's going to (hopefully) be a platformer creator. I've been considering releasing it for Primavera, but recently I think it'll take a while to finish so I might just take my time and not worry about submitting it.\n\nYou're welcome to help - I have both this side (the graphics) and the game side (see https://www.khanacademy.org/computer-programming/entry-iii/4700818350587904). For graphics reference, I'd suggest going to a guy on Scratch called TimMcCool. He made the platformer creator that I'm largely basing this off of."},{"date":"2022-05-08T20:26:44.046143Z","msg":"RGB stands for red, blue, green. It's the value of a color in terms of how much red, blue, and green are in each pixel."},{"date":"2022-05-07T15:11:42.197197Z","msg":"Use the noFill() command."},{"date":"2022-05-06T23:17:18.152737Z","msg":"Arrays are containers of data. They're like a big box that can hold other boxes, but in the computer programming world they're really powerful because they can hold huge amounts of data in many data types.\n\n[ ] <-- square brackets. That's what the big box is. Inside of this 'box', we can hold many things like integers (numbers), strings, or even other arrays! Let me show you what I mean with an example.\n\n`var myArray = [0, 1, 2, 3, 4];`\n\nThis is an array that holds five integers: the numbers 0 - 4. Try printing the array to the console using a println.\n\n`println(myArray);`\n\nWow look, it shows you all the numbers! But that's not useful right now, we want to access the different elements of the array themselves. So we use square brackets.\n\nprintln(myArray[0]);\n\nThis will print '0'. This is because arrays start at 0 and count up.\n\nSo as a recap, arrays are *containers of data*. We create them \n and access specific elements using *square brackets*. As a last point, arrays *start from 0, not from 1*.\n\nHopefully this makes sense. Please don't hesistate to ask if you have any more questions."},{"date":"2022-05-06T23:09:22.209862Z","msg":"Yep! -- subtracts one from a variable, just like ++ adds one."},{"date":"2022-05-06T23:08:29.381422Z","msg":"If you have an array of strings, then you can use random() to pick a random string.\n\n`var greetings = [\"hello\",\"hi\",\"hey there\",\"wassup\",\"yo\"];\nvar r = floor(random(0, greetings.length + 1)); // returns a number from 0 to 5\nprintln(greetings[r]); // prints one of the greetings\n\nDoes that make sense? Please let me know.`"},{"date":"2022-05-06T13:35:29.573993Z","msg":"floor(random(0,5)) actually does give 5 possible outcomes - 0, 1, 2, 3, and 4. random() might return the bottom number (0) but will never return the top number (5). If you wanted it to return numbers 1 - 5, then just alter the call to floor(random(1,6)).\n\nAlso, floor is unnecessary. If you wanna look really smart and have faster performance, use the binary operator '~~'.\n\n~~(random(0,5));\n\nCheck it out:\n\nvar r = random(0,5);\n\nprintln(floor(r));\nprintln(~~(r));"},{"date":"2022-05-06T13:30:48.396931Z","msg":"Hey Rokon,\n\nHere's the link. He commented as a comment, not as a reply, so you might have been looking in the wrong place.\n\n*COPY ALL OF THE LINK*\n\nhttps://www.khanacademy.org/computing/computer-programming/programming/looping/pt/for-loops-a-new-kind-of-loop?qa_expand_key=ag5zfmtoYW4tYWNhZGVteXJpCxIIVXNlckRhdGEiRnVzZXJfaWRfa2V5X2h0dHA6Ly9pZC5raGFuYWNhZGVteS5vcmcvNzlkMjcxYzA4MWI2NDkyN2I5NjIzZTY0ZWJhMzhmMmIMCxIIRmVlZGJhY2sYgIDD3-eBwgsM"},{"date":"2022-05-05T23:03:31.116531Z","msg":"Yeah, there's something called a try...catch. Basically you wrap your program in it and it catches an error if there is one.\n\ntry {\n// your code here\n} \ncatch(e) {println(e);}"},{"date":"2022-05-05T23:00:12.988299Z","msg":"They don't have to be, but it's good practice and you should."},{"date":"2022-05-05T11:39:40.776576Z","msg":"Good question! There are some custom CSS properties that control the scrollbar.\n\n::-webkit-scrollbar {\n                width: 8px;\n            }\n            \n            ::-webkit-scrollbar-thumb {\n                background-color: rgb(255, 0, 0);\n                border-radius: 4px;\n            }\n\nThe top one controls general stuff about the size of the scrollbar. The bottom one controls how it looks - colored red with rounded borders (that's what border-radius does). Try playing around with these values!"},{"date":"2022-05-05T11:34:45.958594Z","msg":"Maybe this will help as to the timer bit: https://www.khanacademy.org/computer-programming/i/5403197272227840\nSetting the frameRate to 100 is a great way to make a timer work, although it's a bit of a problem if you're using it in a game. If you're doing a game, I'd suggest just directly checking frameCount.\n\nTo make it start in the middle of a program, maybe just use a frameCount check."},{"date":"2022-05-05T11:31:56.227299Z","msg":"KA teaches PJS, HTML+CSS+JS, and SQL. As to beyond that, there's W3schools and Codecademy.\n\nOh, and Youtube exists as well."},{"date":"2022-05-05T11:31:07.05531Z","msg":"You can add other links! Just use an *a* tag.\n\n<a href=\"google.com\">Google</a>"},{"date":"2022-05-05T11:30:13.947003Z","msg":"It's actually supposed to do that. If you look at the actual background code for the function (println(arc);), you'll see that there's a line at the top that says that if the width is <= 0 then just return and don't draw anything. I don't know why they did this, though.\n\nAs to how you can do it, I'm not sure. Maybe rotate and scale it in a way that looks like it's actually turning?"},{"date":"2022-05-05T11:27:10.518723Z","msg":"Nope! She's using the built-in KA editor, which you can also use - found here: https://www.khanacademy.org/computer-programming/new/webpage"},{"date":"2022-05-05T11:26:13.271242Z","msg":"That's actually how it's supposed to work. Only images from KA are allowed, but you can also use images from Wikipedia."},{"date":"2022-05-04T19:59:04.502327Z","msg":"You can't do much. This homepage will most likely be hidden from the HL, but if any of your members or yourself have a subpage and would be interested in posting it, you might get more views."},{"date":"2022-05-04T15:30:20.205844Z","msg":"?Para escribir texto? Usar?as la funci?n text(). Para dibujar formas, solo use los comandos de forma que aprendi? en lecciones anteriores.\n\nTo write text? You would use the text() function. To draw shapes, just use the shape commands that you learned in previous lessons."},{"date":"2022-05-04T15:27:36.430833Z","msg":"Yeah, if the character set is UTF-8 it should be able to handle pretty much every character imaginable.\n\nAs to how to get them, I would suggest looking them up and copy-pasting as they're not available on a normal keyboard."},{"date":"2022-05-04T15:20:27.196445Z","msg":"Try this code:\n\n`var drawSmiley = function(faceObj) {\nfill(168, 124, 70);\nellipse(faceObj.centerX, faceObj.centerY, 150, 150);\nfill(0, 0, 0);\nellipse(faceObj.centerX-30, faceObj.centerY-30, 20, 20);\nellipse(faceObj.centerX+30, faceObj.centerY-30, 20, 20);\nnoFill();\nstrokeWeight(3);\narc(faceObj.centerX, faceObj.centerY+10, 64, 40, 0, 180);\n};\n\nvar SmileyFace = function(x, y) {\nthis.centerX = x;\nthis.centerY = y;\n};\nSmileyFace.prototype.draw = function() {\n    drawSmiley(this);\n};\n\nvar face = new SmileyFace(200, 300);\nface.draw();`"},{"date":"2022-05-04T15:16:06.252786Z","msg":"Did you forget this line of code in the Tulip constructor?\n\n`Tulip.prototype = Object.create(Flower.prototype);`"},{"date":"2022-05-04T15:08:43.111891Z","msg":"Nope, it shouldn't crash your computer unless you use a crazy amount of text or have an infinite loop or something of the like. You should be able to put a lot of text in there without it lagging a whole lot."},{"date":"2022-05-04T15:07:12.009912Z","msg":"Use `triangle(x1,y1,x2,y2,x3,y3)`. It takes three points (six parameters) that hold where the three vertices of the triangle are on the canvas."},{"date":"2022-05-04T15:06:03.466544Z","msg":"Here's a library that shows you 288 images that KA offers.\nhttps://www.khanacademy.org/computer-programming/i/6526312608169984\n\nBeyond that, you can use images from Wikipedia."},{"date":"2022-05-04T15:04:02.518104Z","msg":"Are you coding in the HTML environment, or the PJS one? You should be doing HTML in the HTML code editor.\n\nHere's the link if you're unsure where to find it: https://www.khanacademy.org/computer-programming/new/webpage"},{"date":"2022-05-04T15:03:00.158456Z","msg":"The documentation can be found below a program in the \"Documentation\" tab."},{"date":"2022-05-03T20:47:00.024539Z","msg":"HTML: https://www.khanacademy.org/cs/new/webpage\nPJS: https://www.khanacademy.org/cs/new/pjs\nSQL: https://www.khanacademy.org/cs/new/sql"},{"date":"2022-05-03T14:11:00.047156Z","msg":"Use lines and ellipses."},{"date":"2022-05-03T14:10:48.436649Z","msg":"A spin-off is a copy of a program that you can change and save."},{"date":"2022-05-03T11:44:27.344643Z","msg":"PJS draws shapes in the order you call them. So the shape you call first will be drawn first.\n\nTherefore to draw a line over another shape, just call the line after the shapes you want it to be drawn over."},{"date":"2022-05-03T11:41:39.085762Z","msg":"Firstly, you must understand that OOP is different from plain objects - you can access objects directly by calling them by name:\n\n*var obj = {\nx: 10,\ny: 5\n};\nprintln(obj.x); // prints 10*\n\nWith OOP, we create an object that we can then create instances from using the *new* keyword (i.e. var winston = new Winston()).\n\nSo now we get to your question. *Winston* is the main OOP object, so we won't ever be referencing *Winston* except to create new copies of the object. The function you're mentioning takes one parameter, an object - ideally a copy of the *Winston* object. So we're just mentioning that in the function, the parameter which holds a *Winston* object.\n\nPlease ask if you have any questions, I might not be totally clear about what you want to be answered."},{"date":"2022-05-03T11:30:57.868129Z","msg":"Put the if statement inside of the mouseClicked function. That way, if you have multiple conditions, you only need one mouseClicked function with multiple conditionals inside of it."},{"date":"2022-05-02T21:42:56.137581Z","msg":"Yep, that's absolutely possible! Now try doing it a thousand times. Not so hot, huh?\n\nThat's why loops were made - to do the same tasks over and over again, something computers are excellent at doing."},{"date":"2022-05-02T20:14:14.280969Z","msg":"How about this?\n\n`draw = function() {\nbackground(255, 255, 255);\nfill(0, 0, 0);\nellipse(mouseX,mouseY,10,10);\n};`\n\nBy just drawing any shape at x = mouseX, y = mouseY, it becomes somewhat of a cursor."},{"date":"2022-05-02T20:11:58.023269Z","msg":"Yep, adding an image is as simple as `<img src=\"your_link_here\">`. However, note that in the KA environment only certain images work - either from the built-in image library or from Wikipedia."},{"date":"2022-05-02T20:10:11.503639Z","msg":"Yeah, it absolutely does. If you use the wrong slash you'll get an error. So always use a forward slash with tags.\n\nYou'll find out later that backward slashes are used for different things like escape characters. We don't want to get the two messed up."},{"date":"2022-05-02T20:08:30.719821Z","msg":"An object is a container of named values.\n\n`var obj = {\nx: 100,\ny: 100\n};`\n\nParameters in functions enable us to pass custom information to the function instead of basing it off of the same thing or randomness.\n\n`var myFunction = function(param) {\nobj.x = param; // sets the obj.x to whatever was in param\n};`\n\nSo the difference is that an object is a container of data, while a function with parameters allows us to specify data. Please ask for clarification if needed, your question was a bit hard to follow so I just generalized."},{"date":"2022-05-02T20:03:11.142555Z","msg":"`rect()` draws a rectangle on the screen.\n\nFor example, to draw a 100px by 100px rectangle in the top corner of the canvas, we would do this:\n\n`rect(0,0,100,100);`"},{"date":"2022-05-02T20:01:39.558327Z","msg":"Structured Query Language.\n\nIt's a programming language that allows us to make *structured queries* to a database."},{"date":"2022-04-26T17:23:15.945946Z","msg":"I'd love to make this into a full game someday - maybe after Primavera :)"},{"date":"2022-04-22T18:02:56.6902Z","msg":"Ah - that's probably because you aren't closing your functions properly. Make sure you include the curly brackets.\n\n`var myFunction = function(); // will give an error\nvar myFunction = function() {}; // this is correct`"},{"date":"2022-04-22T13:49:41.268086Z","msg":"Just spin-off of the program by hitting the button that says \"Spin-Off\". Then save the program, and you'll be able to access it via your profile."},{"date":"2022-04-22T13:48:59.708745Z","msg":"Nope, it's a problem I struggle with too. It really wasn't set up in an efficient way, but I generally just go to a random program and post my question. As you grow in your knowledge not only of programming, but of the people in the community, you can go to specific people with questions.\n\nHere's some helpful people who can answer more specific questions:\n\n@MKaelin368 - Pretty much anything\n@grantjenkins - PJS\n@notpolar - HTML"},{"date":"2022-04-22T12:43:19.634425Z","msg":"Kinda confused what you're asking. Could you clarify?"},{"date":"2022-04-21T22:45:11.469431Z","msg":"Yep. Just wait for the `addEventListener()` lesson, that teaches you how to do buttons with JS."},{"date":"2022-04-21T20:20:54.190713Z","msg":"There's not one super programming language that does everything. Take web development for example.\n\nYou need HTML for structure, CSS for styling, and JS for interactivity at the most basic level. Then you could throw in some server stuff, like SQL and PHP. \n\nEach language specializes in its own special thing - Python is for programming and manipulating files, SQL is for database management. They can't do each other's job."},{"date":"2022-04-21T20:16:59.79549Z","msg":"Please specify as to what you want to do. You can loop through an array with a `for` loop.\n\n`for (var i = 0; i < yourArray.length; i++) {\n}`"},{"date":"2022-04-21T20:15:38.599734Z","msg":"Because PJS uses the order of operations, and it doesn't matter what order we're multiplying them in. You could always add parentheses if you'd like, I do that a lot (makes it easier to understand) :D"},{"date":"2022-04-21T18:35:59.26338Z","msg":"It depends where they're from. For example, I've found that pictures from Wikipedia work just fine. Check this out: https://www.khanacademy.org/computer-programming/gifs-in-webpages/6552721669799936"},{"date":"2022-04-18T23:17:46.952035Z","msg":"Hi there! I'd be happy to answer some questions :)\n\n1. About 5 years ago on Scratch. I spent 4 years there on and off, then moved here to KA. Here is where I started programming seriously.\n2. I grew up playing Scratch games, and I was amazed what you could do with just some simple blocks. I always wanted to be the one who could make games like that, the one who inspired others.\n3. That's a really loaded question. It honestly depends on what I'm making and how long my interest lasts. We'll average and call it around a week.\n4. Games are the best. It's wonderful to take an idea and implement it into a player that jumps around the screen :D\n5. PJS all the way. Even though it's outdated garbage, it can still do some really cool things.\n6. Ask questions. The community here is super valuable in that we have a bunch of people who are more than willing to answer your questions.\n7. The main reason I'm here would be the community. I've met some really great people here who have inspired and challenged me to keep going and keep prioritizing quality over quantity.\n\nHave a great rest of the day :D"},{"date":"2022-04-17T22:51:06.744123Z","msg":"Use the mouse to draw (left mouse) and erase (right mouse). Use space to play the simulation."},{"date":"2022-04-13T17:49:13.479707Z","msg":"Yep, feel free to use with credit :)"},{"date":"2022-04-13T17:04:13.021985Z","msg":"Yes, it is! There are several ways to do it, but I'll show you the easiest way.\n\n`var keys = [];\nkeyPressed = function() {\nkeys[keyCode] = true;\n};\nkeyReleased = function() {\nkeys[keyCode] = false;\n};\n`\n\nThen you can call keys like this, in a draw loop:\n\n`draw = function() {\nif (keys[LEFT]) {\nprintln(\"Left key is pressed\");\n}\n};`\n\nTo do specific keys, you have to find the keyCode for the object. Go into a new program and put this line of code in:\n\n`\ndraw = function() {\nprintln(keyCode);\n};`\n\nThen press whatever key you want to check, and use that number inside the key checking.\n\n`draw = function() {\nprintln(keys[90]); // check for the 'z' key\n};`"},{"date":"2022-04-11T18:31:52.27196Z","msg":"Oh ok this I wanna hear\n\nyep, that's right, =P.\n\n1) nice idea, but I'm lazy so I won't implement it\n2) nice idea, but I'm lazy so I won't implement it\n3) nice idea, but I'm lazy so I won't implement it\n4) nice idea, but I'm lazy so I won't implement it\n5) `_*loot*_`"},{"date":"2022-04-05T11:27:40.644092Z","msg":"Huh. Maybe reload the page?\n\nThe controls are WASD or arrow keys, and you click to shoot. If you're on mobile then you might not be able to play, sorry ;-;"},{"date":"2022-04-04T12:07:07.715532Z","msg":"First off, I didn't make that part. WalkWorthy (@PowerCoder) did, but I'll try to explain it anyway.\n\nUsing the modulus operator (%), we're able to cycle through frames. Every sixth of a second, the costume is changed to the next one - this is possible by using a basic timer property that we have thanks to the modulus operator.\n\n`if (frameCount % 5 === 0) {}`\n\nThis means every time that `frameCount % 5 = 0`, we switch to the next frame. Just basic timer stuff.\n\nI would encourage you to google the modulus operator if you haven't heard of it. I use it _all_ the time while I'm coding for bullet fire rates and the like. It's incredibly useful for making timers that execute a function every time a certain time interval has elapsed."},{"date":"2022-03-29T00:46:36.866252Z","msg":"You're listed for me. Try checking again."},{"date":"2022-03-19T19:46:13.903219Z","msg":"Let's think about this - there are two possible solutions.\n\n1) Use randomness to control the color of the fish. It would be a little difficult to find the right colors, and you wouldn't have control of what color each fish was. It would also create a multicolor problem if we incorporated a draw loop.\n\n2) Pass the color through a parameter. This way, you control the exact color of the fish and it takes care of some bugs that would occur if we used randomness. I'm going to take this approach as it seems easier.\n\nTo accomplish this, just write your function to take a color parameter where you'll pass a color (ex. color(255, 100, 0)). Then when you're drawing the fish, fill it with the color.\n\nThen when you call the fish function, include a color as a parameter and you'll be set."},{"date":"2022-03-19T17:05:59.090566Z","msg":"https://www.khanacademy.org/api/internal/scratchpads/5059654232932352?format=pretty\n\nChange the 5059654232932352 to the id of the program you wish to get the date of, then look for an attribute labeled `date`."},{"date":"2022-03-15T00:19:29.021877Z","msg":"Liam K said this earlier - \"If you really want to get started on the next challenges, you may, but it would be best to put a lot of effort into the current challenge, so you can score the most points.\""},{"date":"2022-03-15T00:19:12.560769Z","msg":"It's because there are an excess of coders your level on Team Buzzaw currently. Alter your level, wait it out, or choose another team."},{"date":"2022-03-15T00:18:46.059471Z","msg":"Liam K said this earlier - \"If you really want to get started on the next challenges, you may, but it would be best to put a lot of effort into the current challenge, so you can score the most points.\""},{"date":"2022-03-15T00:17:36.012981Z","msg":"It's because there are an excess of coders your level on the teams not listed. Alter your level, wait it out, or choose another team."},{"date":"2022-03-14T21:05:41.105936Z","msg":"Go to the page of the program that says \"Joining\". Fill out the prompt, then go to the tips and thanks and paste your clipboard into a comment.\n\nAs to teams, pick whoever you want! It'll give you some options in the prompt :)"},{"date":"2022-03-14T00:03:02.199507Z","msg":"Hi Katie!\n\nFirst off, a `keyPressed()` function does not need to be put in a `draw` loop. I think what you're trying to do is keypress detection (i.e. finding what keys are pressed), and there's a _much_ easier way to do it.\n\nStart off with this code.\n\n`var keys = [];\nkeyPressed = function() {\n    keys[keyCode] = true;\n};\nkeyReleased = function() {\n    keys[keyCode] = false;\n};`\n\nNow keypress checking is a breeze! You're trying to see if the up arrow is pressed, and then printing the message \"ww\". Let's make the program so it does just that!\n\nYou can use our new system to make it a lot easier. For example, checking if the up arrow is pressed is as simple as:\n\n`if (keys[UP]) {\n    // up arrow is pressed!\n}`\n\nMake sure to put this in a draw loop. So your program would now look like this:\n\n`draw = function() {\n    if (keys[UP]) {\n        println(\"ww\");\n    }\n}`\n\nAny key can be called this way, such as the down arrow.\n\n`if (keys[DOWN]) {\n    // down arrow is pressed!\n}`\n\nHope this helps. Shoot me a message if you don't understand something :)"},{"date":"2022-03-13T23:41:54.801688Z","msg":"If you want 2D, then just use `ellipse()`.\n\nIf you want 3D, here's a tutorial on P3D. It makes wonderful spheres.\nhttps://www.khanacademy.org/computer-programming/basic-p3d-tutorial/5841608027471872"},{"date":"2022-03-13T23:40:31.348838Z","msg":"Make sure you have the right fill color. If that doesn't work, save the program and reload the page or add this line of code to the top:\n\n`size(400,400,P2D);`\n\nSometimes the KA editor has a glitch where it only shows the first 100 x 100 pixels of the canvas. That code, or reloading the page, usually fixes it."},{"date":"2022-03-13T23:37:52.491753Z","msg":"Right! Say we had an array called `names`.\n\n`var names = [\"Ryan\", \"John\", \"Sophia\"];`\n\n`names[0]` would be \"Ryan\",\n`names[1]` would be \"John\",\nand `names[2]` would be \"Sophia\".\n\nRemember - with arrays, we always start counting from 0 :)"},{"date":"2022-03-11T23:12:11.134591Z","msg":"Hi Timothy!\n\nI combined what Storm and Ranger said to create this code. If you want the cursor to be visible, just remove the `cursor(\"NONE\")`.\n\n`draw = function() {\n    background(255, 255, 255);\n    \n    cursor(\"NONE\");\n    image(getImage(\"avatars/aqualine-ultimate\"),mouseX-50,mouseY-50,100,100);\n};`"},{"date":"2022-03-11T23:08:34.586912Z","msg":"Hi there!\n\nKeyboard controls are relatively straightforward. Start with this code:\n\n`var keys = [];`\n`keyPressed = function() {\n    keys[keyCode] = true;\n}`\n`keyReleased = function() {\n    keys[keyCode] = false;\n}`\n\nNow, you can call keyboard controls in the following manner.\n\n`if (keys[LEFT]) {\n    // move left\n}`\n\nHope this helps! Don't hesitate to ask if you have any more questions :)"},{"date":"2022-03-11T23:00:51.170443Z","msg":"When someone (like myself) responds to a question, the asker of the question (like yourself) is notified."},{"date":"2022-03-11T15:53:20.240118Z","msg":"Hit the *H* key."},{"date":"2022-03-10T22:16:06.21468Z","msg":"Not currently, no."},{"date":"2022-03-10T22:15:57.120867Z","msg":"Yeah, it's for a collab. You're free to use it with credit if you'd like :)"},{"date":"2022-03-10T15:56:23.010749Z","msg":"Probably because you have the wrong syntax or misspellings. Make sure to triple-check your code and look out for errors."},{"date":"2022-03-10T15:55:13.559275Z","msg":"Absolutely! KA actually has just a system for that. Spinning-off a project makes a program that has all the code in it, but you can alter it and make it better."},{"date":"2022-03-10T15:40:05.404809Z","msg":"Hi Kav!\n\nYes, it wouldn't show anything because the rectangle is both out-of-view and non-existant. Let me explain:\n\nThe first parameter is the x coordinate.\nThe second parameter is the y coordinate.\nThe third parameter is the width. You have it at 0, so the rectangle is 0 pixels wide - non-existent.\nThe fourth parameter is the height. You have it at 0, so the rectangle is 0 pixels high - non-existent.\n\nThe fifth parameter of rect is the border-radius. It curves the rectangle. If you don't want a curved border, just leave it blank (it's an optional parameter)."},{"date":"2022-03-10T15:25:28.012351Z","msg":"You don't learn about taxes in this course. Find out more about them here: https://www.khanacademy.org/college-careers-more/personal-finance/pf-taxes"},{"date":"2022-03-09T21:59:48.063657Z","msg":"You can, and you'll learn key interaction later."},{"date":"2022-03-09T21:59:01.5274Z","msg":"Not on Khan, no."},{"date":"2022-03-09T21:55:12.203155Z","msg":"You can't. Khan only allows the predefined library of sounds to be used.\nHowever, you could combine these sounds to make new sounds, and there are custom sound makers out there."},{"date":"2022-03-09T21:54:37.277264Z","msg":"It's always good to include _all_ tags, even if they're optional."},{"date":"2022-03-09T21:53:54.425561Z","msg":"Use nested `for` loops.\n\n`for (var x = 0; x < width; x += 10) {\n    for (var y = 0; y < height; y += 10) {\n        rect(x,y,10,10);\n    }\n}`"},{"date":"2022-03-07T18:54:51.610753Z","msg":"That's really strange. It seems to work without lag for some, but others such as yourself are having big lag problems. No idea why.\n\nI don't know what to say to make it better. Check out this post about the lag issue: https://www.khanacademy.org/computer-programming/invasion-coc/6282804909359104?qa_expand_key=ag5zfmtoYW4tYWNhZGVteXJpCxIIVXNlckRhdGEiRnVzZXJfaWRfa2V5X2h0dHA6Ly9pZC5raGFuYWNhZGVteS5vcmcvMWMyODdmMDdhNGQ4NDRkYmJiNmIwMGJjZmEzYjdlMWMMCxIIRmVlZGJhY2sYgIDDjrC90AkM"},{"date":"2022-03-07T16:33:44.052504Z","msg":"Hi Riler!\n\n`cursor()` changes the cursor. It takes a variety of parameters.\n\n - `cursor(\"default\");` sets the cursor to the default form\n - `cursor(\"pointer\");` sets the cursor to a pointer, like when you hover over the buttons in this program.\n\nHope this helps! :)"},{"date":"2022-02-28T21:20:19.050844Z","msg":"I always say the coding was made because computers can't speak English. Coding gives us a way to harness the power of a computer and make it do what we want.\n\nProgramming languages in general were made so the programmer could communicate with the computer without having to type out 0s and 1s manually."},{"date":"2022-02-25T20:01:38.676149Z","msg":"#1. You're wrong, it only has about 2.2 times the number of all your projects combined.\n#2. It's because WW has a reliable subscriber base that get his projects onto the hotlist, and once on the hotlist, it's easy for it to get _lots_ of votes."},{"date":"2022-02-24T19:04:34.734442Z","msg":"Using a simple `atan2()` function points the towers toward the player."},{"date":"2022-02-24T19:03:42.519034Z","msg":"This is actually built from a template.\nhttps://www.khanacademy.org/computer-programming/game-template/4920704444923904"},{"date":"2022-02-23T13:20:15.14653Z","msg":"It's always good practice to include an ending tag.\nSome elements such as <p> and <li> don't require one, but it's always good to include them."},{"date":"2022-02-18T14:38:13.798813Z","msg":"1. For the `.speak()`, your function needs to accept a parameter. It should look more like this:\n\n`SmileyFace.prototype.speak = function(message) {\ntextSize(30);\ntext(message, this.centerX-90,300);\n};`\n\nThen when you're calling `.speak()`, you just put a message in the parentheses.\n\n`face.speak(\"Hello there!\");`\n\n2. You need to make more than one smiley, as directed in step 5 of the challenge."},{"date":"2022-02-18T14:32:16.144187Z","msg":"\"++\" is the shortcut for \"+=\".\nso logically, \"--\" is the shortcut for \"-=\"."},{"date":"2022-02-18T14:30:38.783161Z","msg":"No, you could certainly also do that. They just do it that way because it's somewhat easier to understand, but if you'd rather do it your way, then go for it!"},{"date":"2022-02-17T21:37:33.118316Z","msg":"It helps to have completed the Intro to JS course to do the Advanced JS courses."},{"date":"2022-02-17T21:36:29.2215Z","msg":"You can unlock *Hopper* by creating a program from scratch.\nYou can unlock *Cool Hopper* by completing a coding challenge."},{"date":"2022-02-17T21:34:09.986624Z","msg":"Of course! KA has a course specifically dedicated to game building in JS. Of course, you have to start somewhere :)\nhttps://www.khanacademy.org/computing/computer-programming/programming"},{"date":"2022-02-17T21:31:57.374595Z","msg":"Energy points are a kind of reward here on KA. As you get more EPs, you can unlock avatars and earn badges."},{"date":"2022-02-17T21:30:51.486496Z","msg":"You can color a line using the `stroke()` tool.\n`stroke(0,0,0);` makes the line black.\n`stroke(255,0,0);` makes the line red.\n\nCheck out the official documentation here: https://www.khanacademy.org/computer-programming/stroker-g-b/839545910"},{"date":"2022-02-17T18:15:54.158757Z","msg":"Actually, you'll learn later how to do that :)\nIn the Advanced JS: Games and Visualizations course, they teach you how to translate the coordinate plane to the center of the canvas. Just wait and see :D\n\nOf course waiting is boring, so here's some quick code to do just that!\n\n`point(0,0);` // draws a point in the top left corner of the canvas.\n\n`pushMatrix();\ntranslate(width/2,height/2);\n// anything you draw in here will be like you want it.\npoint(0,0); // draws a point in the _middle_ of the canvas.\nline(0,0,-200,-200) // draws a line from the center of the canvas to the top left corner!\npopMatrix();`\n\nSo basically just put `pushMatrix();` at the beginning of your code, `translate(width/2,height/2);` right after that, and then `popMatrix();` at the end of your code!\n\nYou might still encounter some problems because you don't understand, that's fine. As I said, you'll learn about _all_ of this later."},{"date":"2022-02-14T13:10:17.512372Z","msg":"Italic text is slanted, not straight, like normal text.\nThis is normal text.\n_This is italic text._"},{"date":"2022-02-12T21:37:28.894357Z","msg":"You can make a green fill with `fill(0,255,0)`.\nThis is because the second parameter of `fill()` controls green, so setting it to 255 makes the color green."},{"date":"2022-02-10T15:52:41.681432Z","msg":"Write `<img src=\"\">` and click inside of the double quotes. A little popup should appear that says something like \"select image\".\n\nThe animal/landscape/food pictures are under the second tab of pictures, next to Clipart."},{"date":"2022-02-10T15:35:14.383819Z","msg":"A _basic_ example would be to wrap everything inside the `draw = function()` in `pushMatrix()`/`popMatrix()`, then translate according to the player position.\n\nHere's the improved code. Delete everything inside of your `draw = function()` and replace it with the following code.\n\n`pushMatrix();\n     translate(-x+width/2,-y+height/2);\n     background (108, 203, 235);\n     fill (0, 237, 4);\n     sun ();\n     //left cloud\n     fill (242, 242, 242);\n     ellipse(100, 100, 126, 97);\n     ellipse(100 + 62, 100, 70, 60);\n     ellipse(100-62, 100, 70, 60);\n     //right cloud\n     fill (242, 242, 242);\n     ellipse(284, 166, 126, 97);\n     ellipse(168 + 60, 165, 70, 60);\n     ellipse(399-62, 165, 70, 60);\n     //land\n     fill (0, 255, 115);\n     rect (-38,334,9968,100);\n     player ();\n     //bottom block\n     block(147,243,50,30,30);\n     //exit block\n     block(-4,107,180,30,80);\n     // left block\n     block(288,190,100,30,12);\npopMatrix();`\n\nAgain, it's really basic. If you need any more help, please ask :)"},{"date":"2022-02-09T01:58:48.71843Z","msg":"Ok, I don't think you realize exactly how much work that would be. And I don't know about you, but my man Willard has life to deal with so yeah. The rule of thumb is that if you want something added, make it yourself."},{"date":"2022-02-09T01:56:17.178567Z","msg":"I doubt it, but there is a secret. Un-comment the lines around line 590 in the code and you will get a new block, TNT ;D"},{"date":"2022-02-09T01:55:10.75596Z","msg":"Press the W key."},{"date":"2022-02-09T01:54:56.300844Z","msg":"Right-click to build, left-click to mine."},{"date":"2022-02-08T21:28:41.560423Z","msg":"At the very top of the project, there are `<title></title>` tags. The text inside the tags sets your title.\n`<title>your title here</title>`"},{"date":"2022-01-14T00:45:06.013196Z","msg":"Funny, but try to keep comments like this to the tips and thanks in the future :)"},{"date":"2022-01-13T19:07:42.506324Z","msg":"Use the `fill()` command.\n`\n// draw an ellipse at (200, 100) with width 80 and height 100\nfill(230, 255, 0);\nellipse(200, 100, 100, 100); \n// draw an ellipse at (200, 100) with width 80 and height 100\nfill(0, 0, 0);\nellipse(180, 90, 20, 20);\n// draw an ellipse at (200, 100) with width 80 and height 100\nellipse(240, 90, 20, 20);\n// draw an ellipse at (200, 100) with width 80 and height 100\nfill(255, 0, 0);\nellipse(210, 130, 40, 40);\n`"},{"date":"2022-01-12T15:49:21.751655Z","msg":"It's just syntax. The programmers wrote it that way, and I don't think they're going to change it."},{"date":"2022-01-12T15:47:51.595036Z","msg":"https://www.khanacademy.org/computer-programming/new/pjs =)"},{"date":"2022-01-11T15:00:31.998476Z","msg":"`// this function returns the most recent key being pressed\nvar findKey = function() {\n    // returns the key\n    return key;\n};\n\ndraw = function() {\n    // setup stuff with fonts\n    background(255, 255, 255);\n    textSize(63);\n    fill(0, 0, 0);\n    \n    // prints the key at 100,150\n    text(findKey(),100,150);\n};`"},{"date":"2022-01-11T14:55:06.345641Z","msg":"Yep, Python is a popular programming language. KA doesn't teach it, but there are many other places to learn it (code.org, w3schools.com)."},{"date":"2022-01-10T14:38:35.001486Z","msg":"The variable i is the incremented variable. It's the variable that is changed every time we go through the loop, and it's super helpful for checking if it's time to break out of the loop yet.\n\nIn your code, i is activated with the value 0 (note the word var, for activating a variable). Every time we go through a loop, we check if \"i is less than xPositions.length\". If it is, then we break out. If not, we'll keep going. The last parameter increments the variable by a certain amount, in your case, 1.\n\nSo here's the basic rundown:\nfor (declare the variable and set it equal to something; check to see if we should break out of the loop yet; increment the variable by a certain amount) {}.\n\nHope this helps, if not, please tell me and I'll go more in detail."},{"date":"2022-01-09T21:09:07.275674Z","msg":"Use `stroke()`."},{"date":"2022-01-07T20:50:22.698068Z","msg":"The documentation can be found right underneath a program, in the tab labeled \"Documentation\" :)"},{"date":"2021-12-18T18:48:21.886111Z","msg":"Right! By drawing a shape, but moving it one pixel to the right every frame we can create a basic animation. Try subtracting one every time, or changing the y position instead of the x."},{"date":"2021-12-18T18:46:25.612487Z","msg":"Say you're making a game and you need to know when the player presses the arrow keys, which will move the player around.\nThere are several ways to use `keyCode` for this type of situation, a big way being the simple key checker to see if a key is pressed. Here's how it works:\n\n`var keys = {};\nkeyPressed = function() {\n   keys[keyCode] = true;\n};\nkeyReleased = function() {\n   keys[keyCode] = false;\n};`\n\nWith the above code in place, we can now just use a checking code by means of an `if () {}` conditional.\n\n`if (keys[65]) { // 65 is the keyCode of the letter \"A\"\n   println(\"key pressed\");\n} else {\n   println(\"key not pressed\");\n}`\n\nA final note: if you don't know the keyCode of a character, then use this script.\n\nkeyPressed = function() {\n    println(keyCode);\n};\n\nOr use this program by ????? ????:\nhttps://www.khanacademy.org/computer-programming/key-code-finder/6173271610834944\n\nHope this helps, and don't hesitate to reach out if something doesn't make sense."},{"date":"2021-12-17T17:11:24.17326Z","msg":"Hello again :)\n\nJavaScript can be practiced in a lot of different environments, but the JS you are learning right now, processing.js, is not exactly the JS you can use everywhere.\nProcessing.js is a JavaScript library, and it's not the same thing as the JS you can build into webpages and such. The syntax is mainly the same (such as `var` to declare variables and `var myFunction = function() {}` to make a function, but all of PJS does not work in a webpage.\n\nBasically what I'm trying to say is that there isn't really another great place to practice coding with the PJS library, but when you start to learn JavaScript for building with HTML in webpages, there are a ton of great editors out there.\n\n*Others* - correct me if I'm wrong or if you know another place where there is a good PJS editor, I just haven't found one as of the current moment."},{"date":"2021-12-17T17:05:06.467554Z","msg":"*EDIT*: Just realized you were talking about JS and not HTML XD\nIgnore this then; it's a guide to HTML, *not* JS.\n\nHi Ashi!\n\nYes, we can absolutely change the font of text and make text italic or bold. Take a look below:\n\n`<!DOCTYPE html>\n<html>\n    <head>\n        <meta charset=\"utf-8\">\n        <title>New webpage</title>\n        \n        <style>\n            p {\n                font-family: Arial;\n            }\n        </style>\n    </head>\n    <body>\n    \n    <p>This is my sample webpage!</p>\n    <p>Using tags, we can make text <b>bold</b> or <i>italic</i>.\n    </p>\n\n\n    </body>\n</html>`\n\nTry inputting the code above into a blank HTML project (found here: https://www.khanacademy.org/computer-programming/new/webpage)\n\nTo explain the code, I'll start with making the text bold. Bold text is made by putting <b></b> tags around the text you want to make bold.\nNext is italic. We can made text italicized by placing the <i></i> tags around it.\nAnother way of decorating text is underlining. This is accomplished by placing <u></u> tags around the text to be underlined.\n\nIn conclusion:\n<b>Hello</b> --> *Hello*\n<i>Hello</i> --> _Hello_\n\nFonts are harder, and you will learn more about them later in the HTML course.\nThere is a tag in the <head> of the webpage that says <style>. See it? Inside this tag goes all the properties that help us style text and do things like changing the font.\nNow look at the line with a \"p {\" on it. This line and the next two lines are modifying all <p> tags (So all of our text in the body of the webpage). Under that line you see \"font-family: Arial\". This is the font! You can change \"Arial\" to any font you want, but a lot of fonts don't work in the KA environment. :(\n\nHope this clears some things up. Don't hesitate to reach out if you're having problems :)"},{"date":"2021-12-17T15:11:44.815798Z","msg":"`var x = 65; // declaring our variable\n\nif (x > 50 && x < 75) {\n   // code to execute\n}`\n\nBasically we can check 2 things at once if we use a more advanced comparer, such as `&& (AND)`, `|| (OR)`, or `! (NOT)`. I'm using `&&`, which checks if x is greater than 50 and less than 75.\n\nThe outcome of this specific code would be `true`."},{"date":"2021-12-16T21:52:18.814735Z","msg":"Khan Academy has course material on HTML, CSS, JavaScript (including the processing.js library), SQL, and I believe jQuery."},{"date":"2021-12-16T19:07:10.937635Z","msg":"Here's a good place to start! https://www.khanacademy.org/computing/computer-programming/programming"},{"date":"2021-12-16T15:50:32.296456Z","msg":"https://www.khanacademy.org/computer-programming/levis-sub-page/6272917622194176"},{"date":"2021-12-14T18:32:16.517233Z","msg":"No, the other snakes are just AI (it's like you're playing against the computer)."},{"date":"2021-12-13T14:27:30.86524Z","msg":"Yeah, you could do something like this:\n\n`draw = function() {\n    background(255, 255, 255);\n    \n    fill(255, 0, 0);\n    rect(0,0,mouseX,mouseY);\n};\n`\n\nThis draws a rectangle that has a width of wherever your `mouseX` is and a height of wherever your `mouseY` is. Just make sure to always have a `draw = function() {}` when you make animations!"},{"date":"2021-12-12T20:22:14.769892Z","msg":"It's always good to use proper capitalization of keywords and things like that. And, I don't believe writing code with incorrect capitalization works in the PJS environment. So yeah, always use correct capitalization when writing code.\n\nOn another note, writingThingsLikeThis uses a capitalization standard called camel case, in which you keep the first word lowercase, but capitalize the first letter of all the other words. Programmers use this _a lot_ in things like naming variables, because it makes the words easier to see. (writing \"ballspeed\" vs. \"ballSpeed\"). Not particularly related to your question, but interesting nevertheless. \n\nGood luck as you continue with coding, and don't hesitate to reach out if you have further trouble :)"},{"date":"2021-12-03T21:46:49.420803Z","msg":"As someone who knows a bit of Java, I can say that many programming languages (such as Java or Python) share a lot of the same syntax. Learning processing.js won't really help you that much to learn languages like Java, but if you're looking for a place to go next I'd recommend JavaScript or HTML because it's a bit of a continuation of what you're learning here."},{"date":"2021-12-02T15:16:06.000978Z","msg":"Hi Optimus!\n\nI'm not much of a game developer, but I can tell you that arrays are incredibly useful in programming games and other applications. You probably haven't learned about objects in JS yet, but when you do you will begin to appreciate arrays more.\n\nIn the end, you just have to learn about arrays knowing that you'll use them later for bigger, more important things. Arrays are used in both game walkthroughs in the Advanced JS: Games and Visualizations course here on KA. In other words, they are incredibly fundamental pieces of programming that you'll _need_ to know.\n\nNow, it sounds to me like you're having trouble looping through arrays. Looping through arrays is another important part of programming, so we'll walk through that too.\n\nWe will be building a program that loops through an array and prints that data in it.\n\nStart by making an array: \n`var numbers = [1,2,3,4,5,6,7,8,9]`\n\nNext, we'll incorporate the  for loop:\n`for(var i = 0; i < numbers.length; i++) {}`\n\nHere's what we're saying: variable i = 0. Every time we loop through, check this condition (i < numbers.length). FYI, adding \".length\" on the end of the name of an array returns it's length, so for this array it would return 9. Then if the condition is _false_ (variable i is not greater than the length of the list), we increment (add one to) variable i. If the condition is _true_, then we break out of the loop and continue with the program.\n\nNow inside the brackets, we put this:\n`println(numbers[i])`\n\nThis prints the item of the array according to variable i. So if i = 4, it prints \"5\" (because arrays start at 0, not one.\n\nHere is all the code: https://www.khanacademy.org/computer-programming/new-program/6742288074063872\n\nOh, and a final note: you don't have to name the variable i. You can name it anything you want.\n\nGood luck as you continue with your coding journey, and don't hesitate to reach out if you're having trouble! :)"},{"date":"2021-10-27T14:26:10.236685Z","msg":"To select, you use the select command:\n`SELECT * FROM songs;`\n\nBut sometimes, we want to be more specific and only select a specified amount of data. To do this, we just extend the select.\n`SELECT * FROM songs *WHERE* artist = \"Queen\";`\n\nThe `WHERE` command specifies our search, so it only prints out songs that have the artist marked as \"Queen\".\n\nHope this helps!"},{"date":"2021-10-27T12:59:24.549434Z","msg":"Complete the \"Intro to JS\" course if you haven't already (https://www.khanacademy.org/computing/computer-programming/programming), then complete the \"Advanced JS: Games and Visualizations\" (https://www.khanacademy.org/computing/computer-programming/programming-games-visualizations). This should give you the skills you need to make a simple game."},{"date":"2021-10-27T00:27:07.254453Z","msg":"Pretty sure this is what you were looking for. *Always make sure to check your brackets*, that's where most of the trouble was.\n\n`var TitleScreen = function() {\n/* Title Screen */\n};\ndraw = function() {\n    \n \nbackground(0, 0, 0);\n\n//Box in the middle of (Title Screen)\nstrokeWeight(3);\nstroke(mouseY, mouseX, mouseY);\nnoFill();\nrect(100, 100, 400, 400, 1);\n\n     /* Start */\n// Box around \"START\" \nstroke(mouseX, mouseY, mouseX);\nstrokeWeight(3);\nfill(0, 0, 0);\nrect(0.4, 525.4, 598.5, 74, 1.5);\n\n//Line under \"START\"\nstroke(mouseY, mouseY, mouseX);\nstrokeWeight(2.5);\nline(0.4, 580, 598.5, 580);\n\n//Text- \"START\"\nfill(255, 0, 0);\ntextSize(50);\ntext(\"START\", 220, 540, 300, 300);\n //light'n up if mouse hovers over start\n if(mouseY > 540) {\n    stroke(255, 255, 255);\n    strokeWeight(3);\n    noFill();\n     rect(1, 526, 598, 73);\n strokeWeight(2);\n     }\n \n \n//if click on start... \n\n\n /* Controls */\n noFill();\n //box around controls\nstroke(mouseX, mouseY, 50);\nrect(99, 450, 401, 48, 0);\n//\"Controls\" (control title text)\nfill(255, 0, 0);\ntext(\"Controls\", 210,459,162,50);\n\n //if mouse over controls than...\n  \n  if(mouseX >= 99 && mouseY >= 450 && mouseY <= 498 && mouseX <= 500) {\nnoFill();\nstrokeWeight(4);\n  rect(99, 450, 401, 48, 0);\n}\n\n//if mouse click controls box than...\n\n//draw function for Controls\n \n draw = function() {\n     \n\n  if(mouseIsPressed && mouseX >= 99 && mouseY >= 450 && mouseY <= 498 && mouseX <= 500) {\nbackground(255, 255, 255);\n//box around -controls text-\n\nstrokeWeight(1.5);\nstroke(43, 41, 41);\nfill(217, 216, 210);\nrect(130,100,340,425,1);\n\n//text inside box in contro ls page\n  fill(mouseY, 255, mouseX);\n  textSize(20);\n  text(\"Move left (A)                           Move right (D)                           Move up (W)                               Move down (S)                                                                                Dash attack (F)                       Shoot (R)\", 145, 113, 300, 300); }\n  \n  \n };\n  \n  \n  \n  \n  \n  /* how to get back to main page */\n \n  //Rect around (BACK, text)\n  fill(0, 17, 255);\n     rect( 1, 1, 135, 45, 0);\n  \n  //line under (BACK, text)\n  \n line(4, 40, 135, 40);\n  \n  //text in box (\"back\")\n  textSize(38);\n  fill(0, 0, 0);\n  text(\"Back\", 3, 9, 135, 45);\n\n    \n    //if click back then... main pg.\n  if(mouseX >= 1 && mouseX <= 136 && mouseY >= 1 && mouseY <= 46) {\n TitleScreen = true;\n}\n\n};`"},{"date":"2021-10-27T00:15:49.57991Z","msg":"Under the program, there are some tabs. Scroll down to where the comments are, you should see one marked \"About\". Right next to it is a tab marked \"Documentation\", and it has all the documentation (docs) listed under it."},{"date":"2021-10-26T15:18:21.956329Z","msg":"Tesla. I believe you earn it by *getting 10M energy points* (because literally every person who has it has more than 10M). Inductive reasoning, but it might be true."},{"date":"2021-10-26T15:14:15.496681Z","msg":"I press the *UP, LEFT, DOWN, and RIGHT* arrow keys in that order. It's random, but most of the time I get a reasonably high score."},{"date":"2021-10-26T14:58:47.008243Z","msg":"Ellipses and arcs make good mouths. Why not look them up in the documentation? I'll list them for you here though:\n*arc*: https://www.khanacademy.org/computer-programming/arcx-y-w-h-start-stop/1903619297\n*ellipse*: https://www.khanacademy.org/computer-programming/ellipsex-y-w-h/839435680\nGood luck!"},{"date":"2021-10-26T14:45:47.280341Z","msg":"Makes a numbered (or lettered) list. This type of list is *ordered*, different from the *unordered* lists which are just bullet points or something of the like.\n\n*ORDERED LIST*\n1. Item 1\n2. Item 2\n3. Item 3\n_or_\na) Item 1\nb) Item 2\nc) Item 3\n_etc._\n\nIt uses the <ol></ol> tags."},{"date":"2021-10-26T14:42:17.344363Z","msg":"This is an official KA project, so there is no vote button (so that this project cannot be on the hotlist like other projects)."},{"date":"2021-10-26T12:20:21.059744Z","msg":"I suggest you should be more respectful of what you put in the questions tab. Not only are you wasting my time, you are wasting others' and being rude. *Please be more considerate of what you comment*."},{"date":"2021-10-25T20:10:19.491807Z","msg":"The `rotate()` function. https://www.khanacademy.org/computer-programming/rotateangle/6386091934351360"},{"date":"2021-10-25T19:50:31.235837Z","msg":"Start with the \"Intro to JS\" Khan Academy course: https://www.khanacademy.org/computing/computer-programming/programming or learn HTML, the coding language used to build webpages: https://www.khanacademy.org/computing/computer-programming/html-css Either are good picks, but I'd start with the JS."},{"date":"2021-10-25T19:44:49.871869Z","msg":"It's different for everyone (I was able to learn the basics in about a month). Just take it a little at a time. With enough practice you can be good at anything!"},{"date":"2021-10-25T16:39:34.923281Z","msg":"I believe it's just AI."},{"date":"2021-10-22T18:59:19.73439Z","msg":"I basically just curved all the rectangles you had and it gave it a smoother look. This was accomplished by means of the 5th input in the `rect()` command block, \"radius\". The higher the radius, the more curved the rectangle (I used 6 as the input).\n\nAlso, I changed where they come onto the stage. Now they are draw outside of the stage, and drive into the screen instead of starting on it, which makes for a smoother look.\n\nHappy coding!\n\n`noStroke();\nvar car1_x = -200;\nvar car2_x = 700;\ndraw = function() {\n     background(20, 112, 10);\n    \n    // road\n    fill(0, 0, 0);\n    rect(0, 363, 601, 88);\n    fill(250, 250, 250);\n    rect(13, 395, 75, 18,6);\n    rect(116, 395, 75, 18,6);\n    rect(216, 395, 75, 18,6);\n    rect(316, 395, 75, 18,6);\n    rect(416, 395, 75, 18,6);\n    rect(514, 395, 75, 18,6);\n    // second road\n    fill(0, 0, 0);\n    rect(0, 488, 601, 88);\n    fill(255, 255, 255);\n    rect(13, 520, 75, 18,6);\n    rect(113, 520, 75, 18,6);\n    rect(213, 520, 75, 18,6);\n    rect(313, 520, 75, 18,6);\n    rect(413, 520, 75, 18,6);\n    rect(513, 520, 75, 18,6);\n    \n    //Trees\n    fill(71, 35, 8);\n    rect(89, 303, 37, 56,6);\n    fill(17, 51, 2);\n    triangle(108, 217, 67, 247, 151 ,246);\n    triangle(44, 276, 173, 273, 107, 237);\n    triangle(197, 306, 106, 264, 28, 306);\n    \n    \n     // car body1\n    fill(35, 41, 163);\n    rect(car1_x + 17, 480, 82, 33,6);\n    rect(car1_x, 510, 116, 30,6);\n    \n    //wheels1\n    fill(61, 52, 61);\n    ellipse(car1_x + 27, 549, 30, 30);\n    ellipse(car1_x + 86, 549, 30, 30);\n    \n    // car body2\n    fill(255, 38, 0);\n    rect(car2_x + 17, 358, 82, 33,6);\n    rect(car2_x, 385, 116, 30,6);\n    \n    //wheels2\n    fill(61, 52, 61);\n    ellipse(car2_x+ 27, 425, 30, 30);\n    ellipse(car2_x + 86, 425, 30, 30);\n    //sky\n    fill(24, 194, 194);\n    rect(0, 0, 629, 194);\n    fill(255, 196, 0);\n    ellipse(10, 18, 148, 140);\n    \n     car1_x = car1_x + 5;\n    car2_x = car2_x + -5;\n};`"},{"date":"2021-10-22T15:30:29.184975Z","msg":"Create a spin-off of your project and then we can see what's going wrong in the code. Thanks!"},{"date":"2021-10-22T15:24:15.787536Z","msg":"`createFont(font)` creates a new font.\nExample: `createFont(\"Trebuchet MS Bold\");`\n\nYou can incorporate this in two ways.\n\n`var t = createFont(\"Monospace\");\ntextFont(t,20); // the 20 is the size of the text`\n\n_OR_\n\n`textFont(createFont(\"Monospace\"),20);`\n\nAlthough it is cleaner to use the variable, the second option works just fine as well.\n\nAs a final note, here are some fonts that I have found to work in the KA environment:\n\n`\"Monospace\"\n\"Trebuchet MS\"\n\"Trebuchet MS Bold\"\n\"Comic Sans MS\"\n\"Courier New\"\n\"Garamond\"\n\"Georgia\"\n\"Trebuchet MS Italic\"\n\"Times New Roman\"\n\"Verdana\"`\n\nMake sure to always keep them as a string (\"Monospace\") and not as a variable (Monospace).\n\nHappy coding!\n\nEDIT: I don't know if this was what you were looking for, just ignore it if it's not."},{"date":"2021-10-20T11:48:46.865442Z","msg":"Line 17, change it to `cursor = none;`"},{"date":"2021-10-18T17:58:53.402833Z","msg":"You can, and you will have to eventually when programming outside of the KA environment. But in KA's ProcessingJS editor, things like the number scrubber and color picker just show up automatically."},{"date":"2021-10-16T14:03:28.28632Z","msg":"Replace the previous check for stick grab function with this one - I changed the values that are in bold: make them less for a smaller collision, or more for a larger collision.\n\n`Beaver.prototype.checkForStickGrab = function(stick) {\n    if ((stick.x >= this.x && stick.x <= (this.x + *60*)) &&\n        (stick.y >= this.y && stick.y <= (this.y + *60*))) {\n        stick.y = -400;\n        this.sticks++;\n    }\n};`"},{"date":"2021-10-15T14:13:04.759364Z","msg":"There is a way. In the `<p></p>` you want to have the description for when you hold the mouse over it, try using this instead:\n`<p title = \"Your description here!\"></p>`\nI believe it also works with other selection tags, just try it out and see what works!\n\n*EDIT*: Just tried it with `<span></span>` tags, it works."},{"date":"2021-10-15T13:59:14.046638Z","msg":"As far as I know, it's the other way around. You _can_ use HTML without CSS."},{"date":"2021-10-15T13:56:32.071713Z","msg":"Try this: https://www.khanacademy.org/computer-programming/tiles-for-neovision/6579313067474944\nPlease feel free to talk with me more on the subject if you don't understand, I tried to strip the sensing down to the bare bones in this project."},{"date":"2021-10-15T13:42:35.662767Z","msg":"No, you can't. The reason is because when you initialize the variable `myName`, its value will be set to the variable `Chantal`. If you had a variable named `Chantal` earlier in the program and had set it to 1, then `myName` would also be set to 1."},{"date":"2021-10-15T13:39:58.320639Z","msg":"Press the 'request help' button. If your account is restricted or you are under 13, you are not able to post help requests."},{"date":"2021-10-15T13:38:00.60234Z","msg":"Complete the 'Intro to JS' course, and maybe the 'Advanced JS: Games and Visualizations' as well. Check out the Hotlist: (https://www.khanacademy.org/computing/computer-programming/browse)\nLook at some projects and try to figure out how they work. Ask the creator about things you don't understand. Be active in the question forums, such as this one. Some people on this website are here for the sole purpose of answering _your_ questions. Take advantage of that. Overall, keep learning and growing and someday you'll be an awesome coder! :D"},{"date":"2021-10-15T12:51:29.014519Z","msg":"Look at the highest voted question at this link: https://www.khanacademy.org/computing/computer-programming/programming/arrays/pt/intro-to-arrays\nArrays are fun, they are just a little hard to work with at first. Keep working at it - you'll get it eventually! :)"},{"date":"2021-10-14T19:53:43.300609Z","msg":"You can draw another shape, but `line(100,100,100,100)` won't do anything. It just goes from point 100,100 to point 100,100; making a dot. Try this code: \n\n`ellipse(100,100,40,40);`\n\nIt draws another shape. Just be careful about what coordinates you are plugging in to the inputs :D\n\n- `jD2R`"},{"date":"2021-10-14T19:49:33.522933Z","msg":"360 and 180 are not valid inputs for the start and stop values (in that order, that is.) I don't know what type of arc you were trying to make, but chances are that how to make it is in this KA demo: https://www.khanacademy.org/computer-programming/arcs-1/1168008663 Hope this helps!\n\n- `jD2R`"},{"date":"2021-10-14T19:42:08.221847Z","msg":"The problem with your code is that everything is drawn within a `draw = function()`, which means that when the mouse is clicked an ellipse will be drawn, but it will immediately be erased because it is not in the draw function. Sorry if that doesn't make any sense, just take a look at my altered code listed below.\n\n*The solution*: We want to have the new rocks be shown, so we will have to find some way to draw them  _inside_ the loop. This will be accomplished by having arrays that holds the values of the rock coordinates, and then we just constantly loop through those arrays to draw the new rocks!\n\n`var rock_X = [];\nvar rock_Y = [];\n`\nPut this next code _inside_  the `draw = function()`.\n\n`for (var i = 0; i < rock_X.length; i++) {\n   fill(110,79,6);\n   stroke(13,13,13);\n   ellipse(rock_X[i],rock_Y[i],20,20);\n}`\n\nLastly, we need to update your `mouseClicked` function. Put the following code outside of the draw function (where your `mouseClicked` function is now).\n\n`mouseClicked = function() {\n   rock_X.push(mouseX);\n   rock_Y.push(mouseY);\n}`\n\nAnd that should work. If it doesn't, or if you have any more questions, please comment. Hope this helps!\n\n- `jD2R`\n\n*Note*: there are several more ways to accomplish this, but the way I showed is the simplest. If you want another way, just comment and I'll show you."},{"date":"2021-10-14T12:40:52.281126Z","msg":"I would, yeah. If you make changes, just say it's \"inspired by Liam K's platformer tutorial\" and then give the link or something."},{"date":"2021-10-12T16:51:06.979589Z","msg":"The `switch/case/break` commands are like putting multiple `if` loops together. Here's what I mean:\n\n`if (costume === 1) {\n   fill(0, 0, 0);\n}\nif (costume === 2) {\n   fill(255, 0, 0);\n}\nif (costume === 3) {\n   fill(0, 255, 0);\n}\nrect(200,200,40,40);`\n\nThe above script will switch the fill color of the rectangle based on the variable `costume`. A `switch` statement accomplishes basically the same thing.\n\n`switch (costume) {\n   case 1:\n      fill(0, 0, 0);\n      break;\n   case 2:\n      fill(255, 0, 0);\n      break;\n   case 3:\n      fill(0, 255, 0);\n}`\n\nWhen using the `switch` conditional, just remember to always use a break command, because otherwise it would just run that conditional forever and never break out of it! Hope this helps.\n\n- `jD2R`"},{"date":"2021-10-11T21:09:14.282894Z","msg":"up arrow = `UP`\ndown arrow = `DOWN`\nleft arrow = `LEFT`\nright arrow = `RIGHT`\n\nSo keypress detection is as simple as the following:\n\n`var keys = {};\n\nkeyPressed = function() {\n   keys[keyCode] = true;\n}\n\nkeyReleased = function() {\n   keys[keyCode] = false;\n}`\n\nThen the following is the check to see if the key is pressed:\n\n`if (keys[LEFT]) {\n   // if left arrow pressed then do this code\n}`"},{"date":"2021-10-11T20:38:38.682074Z","msg":"Using the `text()` function.\n\n`text(\"Hello!\",200,200);`\nThe above script will print \"Hello!\" at coordinates 200,200 on the canvas.\n\nTo change colors, use the `fill()` function.\n\n`fill(0, 0, 0); // black`\n\nHope this helps!\n\n- `jD2R`"},{"date":"2021-10-11T20:32:52.843481Z","msg":"A half ellipse is accomplished by means of the `arc()` function.\n\n`arc(x,y,width,height,start,stop);`\n\nIt takes six parameters (shown below).\n*x*: the x position of the arc\n*y*: the y position of the arc\n*width*: the width of the arc\n*height*: the height of the arc\n*start*: the angle at which the arc starts\n*stop*: the angle at which the arc stops\n\nThis can be a bit confusing, so let's look at an example.\n\n`arc(200,200,40,40,0,180);`\n\nTry inputting the above code into a program. It draws a semicircle. You can change how it looks by altering the start and stop values. From there, to make a semicircle is simple.\n\n`// new and improved semicircle\narc(200,200,40,40,0,180);\nline(180,200,220,200);`\n\nYou could make all kind of functions to draw semicircles without manual work, and I might edit this post with one later. But these are the basics. Hope this helps!\n\nAlso, please check out the documentation on the `arc()` function, found at https://www.khanacademy.org/computer-programming/arcx-y-w-h-start-stop/1903619297\n\n`- jD2R`"},{"date":"2021-10-07T18:09:56.164193Z","msg":"The original game is found here: https://www.khanacademy.org/computer-programming/the-current/6413308542713856"},{"date":"2021-10-01T18:48:23.187782Z","msg":"Yes, you can.\n<p>Khan Academy is a platform for<strong>learning!</strong></p>"},{"date":"2021-10-01T18:46:12.576125Z","msg":"Press space to go up, release space to go down. Try to collect all the sticks by touching them."},{"date":"2021-09-30T14:05:38.269029Z","msg":"A series of shapes drawn with ProcessingJS such as ellipses, rectangles, and lines."},{"date":"2021-09-30T14:04:40.840271Z","msg":"You can also press space to see your duck move his head back and forth."},{"date":"2021-09-30T14:04:14.647801Z","msg":"I'm pretty sure you also have to upgrade your energy to win races. Even if you are ahead in distance run, if your energy runs out then you lose."},{"date":"2021-09-30T14:03:50.278612Z","msg":"I'm pretty sure you also have to upgrade your energy to win races. Even if you are ahead in distance run, if your energy runs out then you lose."},{"date":"2021-09-30T14:02:08.336291Z","msg":"You can type your name, you just have to click on the place where it says to type and hit backspace, which will erase the text that says \"type name here\". Then you can type your name."},{"date":"2021-09-28T23:24:38.333067Z","msg":"The way you would get that effect would be to use the sin() function on a gradually increasing number. For example:\n\n`var i = 0;\ndraw = function() {\n    background(250, 250, 250);\n    fill(0, 0, 0);\n    rect(width/2,height/2,30,sin(i*30)*20);\n    i += 0.1;\n};`\n\nI know that doesn't necessarily cover many details, so for additional information visit: https://www.khanacademy.org/computer-programming/sindeg/948255306"},{"date":"2021-09-28T17:54:37.066369Z","msg":"Highest score of a team (aka the score of all four players combined)."},{"date":"2021-09-20T14:27:22.490307Z","msg":"You could make another line of text that is slightly larger and position it right behind the text you want to be outlined. It's doesn't always work, but it kind of gives you that effect."},{"date":"2021-03-09T00:37:51.399715Z","msg":"Think of it as combining two different CSS scripts. We can say this:\n\np {\n background-color: yellow;\n  }\n\nwhich means that the background color of all content listed under a paragraph tag will have a background color of yellow. However, say we make a id and call it #idcontent, then we say that all content under this id will have a red underline. If we then write this code:\n\n<p id=\"idcontent\">This is a line of code</p>\n\nthe text will show up underlined with red and with a background color of yellow. Therefore, we combine two classes without having to make a completely different class, which saves time."}]}