{"REPLY":[{"date":"2023-02-15T01:15:37.428389Z","msg":"@21262:\nDon't sweat it. :)"},{"date":"2023-02-14T11:45:33.962005Z","msg":"I would like to continue as well. \n\nActivity wasn't what hurt the collaboration between the 21262 and me, it was time zones."},{"date":"2023-02-13T15:22:11.389922Z","msg":"Currently the only thing you can help wiht is adding a couple more scenrios. . . better a late entry than no entry ig."},{"date":"2023-02-11T13:39:35.746585Z","msg":"Currently, I should be able to output a version of it by Monday if nothing goes seriously wrong. It is not by any means visually appealing right now (I hope to change that), but the back end is mostly done and if I can add enough events, choices, and random events it should be a fun game."},{"date":"2023-02-09T11:24:46.472589Z","msg":"So, I imported ski.js to make it easier to work with for the game, but whenever I type something in it always reverts back to the menu scene and I cant figure out how to stop it. Do you know how?"},{"date":"2023-02-08T11:34:42.640939Z","msg":"Each player turn goes something like this:\nYou are faced with an event. (e.g. you have a choice to cross a river)\nYou decide what to do about the event (you press 1 to cross or 2 to not cross [number keys])\nThe game responds to your actions (you made it across, or perhaps you died)\n(This one isn't in the game, but I think would make it more fun) A random event occurs (thieves steal your luggage, or you come across some random bullets)"},{"date":"2023-02-07T21:43:48.442329Z","msg":"I am working on the backbone of the game (other than the HTML side), and I should have it done by the end of Wednesday. We don't have the time to do a complex game, so we'll have to make a simple but clean output."},{"date":"2023-02-07T02:15:11.789451Z","msg":"I made a basic layout uptop for the game (just for me to visualize what it _might_ look like). :)"},{"date":"2023-02-07T00:57:26.062246Z","msg":"Great! I need to go (its about 8 pm my time), but I should be back on in about an hour. :)"},{"date":"2023-02-07T00:24:50.771704Z","msg":"@OregonTrail:\nIts a game where people pretend the are on an adventure going West during the 1800s int eh United States (look up Oregon Trail game for more)\n\nIf it that doesn't work, you should just get started on a webpage of your choosing and i'll see how I can get involved with it.\n\nsorry, I've had a busy past week/weekend and haven't hade time to start working. I should be able to work more this week."},{"date":"2023-02-06T00:57:00.752944Z","msg":"Maybe, we should do the Oregon Trail? The basics shouldn't be hard, and has a large potential."},{"date":"2023-02-03T11:49:30.098019Z","msg":"Could you create a website advertising the WNET? I'll get to work on some of the games, stores, and other stuff hopefully today."},{"date":"2023-02-02T15:20:15.353391Z","msg":"But what?"},{"date":"2023-02-02T11:27:34.530222Z","msg":"You should be able to kill a couple weak monsters by sword (clicking), and then to kill the other monsters, you will want to visit the shop (shift) to get upgrades."},{"date":"2023-02-02T11:24:44.884834Z","msg":"Not  really. This is actually an old idea I adopted to our situation."},{"date":"2023-02-02T00:37:02.417052Z","msg":"Its basically a mini-recreation of the internet (7-8 Websites), but everywhere you go something strange happens e.g. a website where you play a dodge game will randomly send a nuke at you that kills you."},{"date":"2023-02-01T15:23:54.490269Z","msg":"So you'll create a website endorsing a new internet, and i'll create the 'new' internet in PJS. If you have any other ideas, please suggest them, because this is a pretty weak one."},{"date":"2023-02-01T15:22:30.155259Z","msg":"The only problem I have with that is how to integrate the PJS with the HTML."},{"date":"2023-02-01T02:19:41.414436Z","msg":"Let's just stick with what Mojo1000 suggested then.\n\n@21262:\nI have an idea we could get to work on. :P\n\nkhanacademy.org/computer-programming/the-wnet/4947736999018496"},{"date":"2023-02-01T00:47:35.744728Z","msg":"@Groups:\nI don't care who I work with, practically (save me) everyone on this team is good. :P"},{"date":"2023-02-01T00:24:20.451091Z","msg":"Thank you!"},{"date":"2023-02-01T00:23:01.317076Z","msg":"Ah, thank you for the input. Are you suggesting that I make some levels more maze focused?"},{"date":"2023-01-31T21:39:52.079256Z","msg":"lol, i guess i should have reworded that, when I was flexin' on you, I was more sayin' that I had got more done than you. :P"},{"date":"2023-01-31T19:55:05.971844Z","msg":"thanks!\n\n(this is so ironic after you dissed on it a couple of days ago :P)"},{"date":"2023-01-31T19:54:21.506663Z","msg":"CL:\nall cap."},{"date":"2023-01-31T19:54:08.754499Z","msg":"Yeah, I had to rush the rest of it because irl struck."},{"date":"2023-01-31T19:53:49.057579Z","msg":"@IIFE:\nJust wondering, but when do I need to use IIFEs? I know how to create an IIFE, but not when to use them.\n\n@Indentation:\nYeah, I had to rush the parts of the entry I planned on fixing because yesterday irl struck.\n\n@NotHighestScore\nI hope that Henry still thinks his 1st round draft pick deserved it. :P"},{"date":"2023-01-31T02:26:47.10623Z","msg":"{\n    names:\"Fer Fer\",\n    captain:\"Henry\",\n    link:\"https://www.khanacademy.org/computer-programming/labyrinth-fer-fers-comeback/6712474053427200\"\n},"},{"date":"2023-01-31T01:01:09.941567Z","msg":"there is a new legend in the house. :P jk jk\nbut ski better watch it before his team goes down to the number 2 overall draft pick. lol"},{"date":"2023-01-30T02:13:51.227881Z","msg":"Yes it is, >:P\n\nWell that would help ig. lol"},{"date":"2023-01-30T02:12:38.536644Z","msg":"I think, I was trying to save the text image, so I could reuse it later . . . not entirely sure since this was 8 months ago. lol"},{"date":"2023-01-29T20:19:54.600956Z","msg":"The exam actually went well . . . save the essay. I hate timed writing. We'll see if my problem-solving skills, recommendations, and grades are enough to get me through on March 10th.  . . . the days go by too slow."},{"date":"2023-01-29T12:41:45.905346Z","msg":"Labyrinth is complete logic and graphic-wise, so the only thing is levels . . . I have 2 right now. I probably need 3-8 more."},{"date":"2023-01-29T00:12:06.371675Z","msg":"'Rebellion to the King O' Stalkers Squashed and Humiliated\n- *Future New York Times Headline*\n\nSame difference. :P\n\n>:) Goin' big first round."},{"date":"2023-01-28T14:41:01.659023Z","msg":"Thanks! :) Its at 1:00 . . . just watching the time go by makes me anxious."},{"date":"2023-01-28T13:50:23.359369Z","msg":"When, the Kind O' Stalkers gets stalked. O.o\n\nSame difference.\n\nYup!This is my entry, only need levels now >:)"},{"date":"2023-01-28T13:49:18.572819Z","msg":"@Songbird:\nDefinitely Australia.\n\n@CardStock:\nYup, given to me by Her Majesty.\n\n*goes through your recents list*"},{"date":"2023-01-28T00:26:36.163925Z","msg":"Thanks! Couple things needed to be patched and then I am done. :D"},{"date":"2023-01-28T00:19:38.84821Z","msg":"When does that happen?"},{"date":"2023-01-27T11:34:56.468077Z","msg":"Game coders know a thing or two about that too. lol\n\nWell . . . its supposed to be one of the top schools in America (sometimes ranked number 1, a couple years ago number 4, back up, now its at number 8), so I *hope* that none of the half-witted students make it in. I mean when you get 15 million dollars in scholarship and have a 1401 average SAT, half-witted students don't really fit in."},{"date":"2023-01-27T11:20:24.633293Z","msg":"It depends on what you are making, the way this background is made it usually puts out a good background entirely random. The reason for this is that I take a 50*50 square and then rotate it by different angles across the screen. If you hit the restart button a few times you might be able to see what look like 'arrows' pointing to the top-right corner. As for random seed vs. set background. I would go with set background because you cannot undo a random seed. This is hurtful when deciding chances e.g. (critical attack or which arm of a monster should attack) that should not be controlled by a random seed. On the other hand if you are doing a still graphic, randomseed may be easier than doing an entirely set graphic."},{"date":"2023-01-27T02:33:42.940239Z","msg":"so am I. lol I have that feeling a game coder gets when they look at the game they created, and think it is utter garbage.\n\nI have an 'evaluation' for a magnet school (if I said which it would give away my location) in 2 days. I absolutely hate irl school. Its a dumb waste of time, I get so bored all throughout class, but I still have straight 100+s . . . i hate school lol."},{"date":"2023-01-27T02:24:38.173Z","msg":"Emojis are usually frowned upon in the coding community because they look different on different computers, and the general lack of effort in the graphics. For example, my guess is you have a WindowsOS (not sure) where the emojis look okay. However, on my school Chromebook, they actually look quite horrid.\n\nJust some tips. :)"},{"date":"2023-01-27T02:10:34.828866Z","msg":"Just love how IA entirely ignores the second question. XD"},{"date":"2023-01-26T22:39:14.46651Z","msg":"what the flippin' heck."},{"date":"2023-01-26T22:18:42.600175Z","msg":"How has it been going? Have you made anything recently? I've joined a coding competition I am making a game for.\n\nhttps://www.khanacademy.org/computer-programming/labyrinth/6295355260190720"},{"date":"2023-01-26T13:08:42.731212Z","msg":"I got lazy, and just copy-and-pasted. lol, I guess I could have put them in by `for` or `while` loop.\n\nThe game this was made for is here, could you tell me what you think of it so far?\n\nhttps://www.khanacademy.org/computer-programming/labyrinth/6295355260190720"},{"date":"2023-01-25T21:51:34.466585Z","msg":"I vote for \"Aquila chrysaetos\"."},{"date":"2023-01-25T15:45:39.698085Z","msg":"As always S. M. V. with her nicknames . . .\n\nlol, yes. Ace Rogers askes if I wanted to join."},{"date":"2023-01-25T11:33:36.48912Z","msg":"RedSus\nTellus\n4.5\n\nHBThePencil\nCaela\n5.5\n\neryn\nUmbrus\n6\n\nally\nTellus\n2\n\nAa kk\nPruina\n5.7\n\nsugar\nPruina\n6.1\n\nTimothy\nHydrus\n5.5\n\nTitus Payton\nIgnes\n4\n\nice to meet you\nUmbra\n5\n\nDominic R.\nIgnes\n5\n\nDarthenshmirthz\nUmbra\n5.3\n\nHorizon\nIgnes\n5.6\n\nMJW55\nTellus\n4.7\n\nColdCutz\nTellus\n4.8\n\nsgh07\nHydrus\n4.2\n\nIZH1\nHydrus\n5.6\n\nTDJ\nHydrus\n3\n\nReflex\nHydrus\n5.4\n\nCaptain Pockets!\nUmbra\n3.1\n\nPhase9\nHydrus\n2\n\nSakura\nUmbra\n5"},{"date":"2023-01-25T11:03:11.738143Z","msg":"Droppin' in. :D"},{"date":"2023-01-25T02:01:10.917179Z","msg":"Sure! Is there anywhere I need to report to?"},{"date":"2023-01-23T19:04:55.733599Z","msg":"a.) How is everybody coming along on their project? The due date is in a week.\n\nb.) Its funny watching FSoM and Henry discuss names for our team."},{"date":"2023-01-20T13:28:28.431513Z","msg":"#JustFinishedMeleeAttack\n#ButYouCannotSeeHealthBar"},{"date":"2023-01-20T11:14:01.284449Z","msg":"#ThatMightBeBecauseTheMonsterIsTheHardestAndIHaveNotYetImplementedDamageForTheMonstersYet"},{"date":"2023-01-20T01:28:21.454752Z","msg":"Doing okay, got picked in COC, and making my best game yet.\n\nSure! Once you add graphics to it, this game would be decent. :)"},{"date":"2023-01-20T00:29:48.567178Z","msg":"Realizing 4 months later that I down voted your sub thread comment. O.o"},{"date":"2023-01-20T00:06:03.826032Z","msg":"#ActuallyYeahAndMoreThanUsual\n#SecondOverallDraftPickInClashOfCode!\n#NewGameComing\nhttps://www.khanacademy.org/computer-programming/labyrinth/6295355260190720"},{"date":"2023-01-19T21:32:03.219077Z","msg":"Sure! lol that is what I thought this was originally until I saw the code.\n\nI don't think Team Henry(?) is going to have an intro, but I did make a special intro for my own game. :)"},{"date":"2023-01-19T10:55:35.10566Z","msg":"My pleasure. :)\n\nHow is your COC entry coming? Mine is taking a little longer than I thought, but is coming along really well."},{"date":"2023-01-17T00:47:31.096152Z","msg":"@21262:\nditto\n\n@Team Henry:\nI made some headway in my submission today, however if you look at the top bar I don't like how the way the numbers look with the symbols. Do you have an idea that would connect the symbols to the corresponding numbers in a graphically appealing way?"},{"date":"2023-01-15T00:53:31.955119Z","msg":"*stalking instincts aroused*\n\nTeam Henry FTW!"},{"date":"2023-01-15T00:33:08.378103Z","msg":"Liam K. started the Individual Challenge 2 days early, so you can start work on that if you want."},{"date":"2023-01-15T00:31:23.817709Z","msg":"*realizes hasn't saved yet*\n\nwhoops.\n\nThat should be better. :D"},{"date":"2023-01-14T23:48:42.48719Z","msg":"HSstudent16 big brains my brother lol."},{"date":"2023-01-14T20:19:00.375317Z","msg":"@All:\nMy WIP for the individual challenge.\n\nhttps://www.khanacademy.org/computer-programming/new-program/6295355260190720\n\n@Henry:\nYou may want to appoint a Captain pro tempore (probably Fifth) for when you are unavailable."},{"date":"2023-01-13T21:34:26.286942Z","msg":"of course, being ready to win is not what you should be doing, instead you should be ready to watch Team Henry decimate you."},{"date":"2023-01-13T02:15:43.354018Z","msg":"Maybe, I should have phrased that better . . .\n\nI really want to work with you ! (You would have been my top pick if I had to choose) But I was just double checking that ski was not pulling my leg, since I expected to be picked by ski in the fourth or fifth round out of pity lol. (not sure if you remember that ski is my brother)\n\nb.) What should I be doing until the First round begins?"},{"date":"2023-01-13T00:14:44.44351Z","msg":"Apparently I was picked according to ski . . ."},{"date":"2023-01-12T02:10:36.315572Z","msg":":( And the King O' Stalkers is Stalked. lol PLanning on making a larger game, which will include, as you can tell, hexagons."},{"date":"2023-01-10T00:49:51.403997Z","msg":"Yes, Donuts! Such a yummy Dutch treat cannot be ignored by the coding community, no that would be sheer ignorance on our part thus I must commend you for such favorable contribution to the KACP."},{"date":"2023-01-10T00:26:22.698944Z","msg":"Not so good once Christmas passed lol, luckily none of the graphics have been made yet, so its probably becoming a _____ (adventure  maybe?) platformer."},{"date":"2023-01-09T23:22:38.677556Z","msg":"*sad noises*\n\nBut I liked the ellipses and their nice 255 fill and strokeWeight 1 stroke."},{"date":"2023-01-09T21:16:20.68236Z","msg":"1. https://www.khanacademy.org/computer-programming/space-escape/6314914268889088\n2. https://www.khanacademy.org/computer-programming/new-program/6330606446755840\n\n3. Most likely after 4:00 I will have 1-1.5 hours of time, depending on school work.\n\nPlease note the second of my two showcase projects is unfinished and needs graphics and more levels, however it is probably still my best work so far."},{"date":"2023-01-05T13:06:31.498607Z","msg":"honestly i dont know what blimey means lol \n\nCurrently beginning work on a game with Astro, ski, Dominic R., and SMV.\n\nEDIT:\n\nI don't suppose you are British?"},{"date":"2023-01-05T00:46:17.489825Z","msg":"Thanks.\n\nWassup?"},{"date":"2023-01-05T00:45:52.71261Z","msg":"Since when did the oldies come back to stalk me lol. First Captain Argon and now you."},{"date":"2023-01-05T00:40:08.815721Z","msg":"I'm tempted to get back on KA to revive this old joke back up again. :P"},{"date":"2023-01-05T00:37:04.103126Z","msg":"what the heck . . . lol"},{"date":"2022-12-28T14:47:10.389486Z","msg":"who would stalk a ferret that has only barely been on this platform in over a week?\n\n*checks your account*\n\n. . . now i am really confused lol."},{"date":"2022-12-19T12:14:55.480926Z","msg":"@sakura:\n\nthere is an answer right above this that is quite interesting is it not?\n\nlol I am rotfl"},{"date":"2022-12-13T21:04:39.339412Z","msg":"I here by threaten anyone who continues this thread with all of my ferrets who will take over the world in a few days. Yes, this ban applies to everyone including myself, who post another comment in this thread."},{"date":"2022-12-07T01:01:24.290731Z","msg":"@DR:\n recently got back on. working on christmas platformer . . . need ideas . . . need graphics . . . need motivation.\n\n@ski:\n'excited for the future but miss the good ol' days, :).'\n\n- sums up human life without depression"},{"date":"2022-12-07T00:58:06.660671Z","msg":"ski becomes a dev and one arms the guy who created jQuery."},{"date":"2022-12-06T23:53:47.84585Z","msg":"ski did better on math, i don't even know his scores but that is how it always is. :D"},{"date":"2022-12-06T00:52:55.647232Z","msg":"lol, I just joined the flash you have with ski and gang.\n\nwent inactive for school and such, but i recently have been making a comeback. :D\n\nCurrently, I am working on mashing together a couple projects for a Christmas platformer. lol the main thing i have to code is graphics, and you know how much i suck at that.\n\nWhat would be funny is if we both join COC and we both get on the same team, and do the same thing we did last year.\n\nThe sad part is three months ago I asked who was left of my subbers and no one responded lol.\n\nWhat are you up to?"},{"date":"2022-12-04T23:28:33.845637Z","msg":"some letter before a.) Your method for separating different parts of a comment is new.\n\na.) the dying goats part came from another user who said \"NF sounded like a dying goat.\" ski then turned the tables and pointed out that they called NF the GOAT (Greatest Of All Time)\n\nb.) maybe . . . i used to be known as the 'King O' Stalkers'\n\nc.) heck ya, trash talks are the best!"},{"date":"2022-11-30T22:21:01.76025Z","msg":"#YouAreNext"},{"date":"2022-11-14T13:47:42.226644Z","msg":"i agrea"},{"date":"2022-11-08T00:36:07.043273Z","msg":"Congradulations! Ewe hav fownd a speling mihstaik inn mie bie-o!\n\nI can be so mean. >:D\n\nlol, fixed!"},{"date":"2022-11-03T23:47:28.708647Z","msg":"now just wait for a month or two . . . lol\n\nyou have always been changing your name, i don't think i could get used to your name being the same every month. XD"},{"date":"2022-10-31T10:19:54.159564Z","msg":"*insert scribble*\n\nI subscribbled!"},{"date":"2022-10-24T13:50:37.714719Z","msg":"*ferrets surround*"},{"date":"2022-10-23T10:54:34.486175Z","msg":". . . my comments sound like they were written by an idiot. (quietly deletes)\n\n\"*you are under custody for breaking the subpage law number 2*. *Please keep your hands up until back up arrives*\""},{"date":"2022-10-16T12:54:50.475925Z","msg":"It still isn't that, take a careful look at all the cards and write them down. Then just click to the end of the game. How many of the starting cards are in the final deck?"},{"date":"2022-10-13T10:47:41.975777Z","msg":"I'll take that as a resounding yes. *scampers off to find something to protect my nose with*"},{"date":"2022-10-13T01:12:46.123368Z","msg":"i mean _technically_ if you had the right parts you could make the wrench. and even then why not go to the nearest Home Depot?\n\ncan I be comic relief?"},{"date":"2022-10-12T14:05:02.238798Z","msg":"i only sorta forgot, CL was doing most of the work, and my schedule doesn't work so at least we have a WIP to submit, unlike someone i've been stalking >:)"},{"date":"2022-10-11T22:18:17.358679Z","msg":"sorry for all the spam I was just testing some ideas out. this is very weird, I think things that are collected by their spam filters are counted as 'DELETED'"},{"date":"2022-10-11T22:16:59.149239Z","msg":"Huh that is weird."},{"date":"2022-10-10T19:56:20.146049Z","msg":"I must say, _classy_ background ski. :D"},{"date":"2022-10-10T19:50:42.693825Z","msg":"This is the  guardians' off shift."},{"date":"2022-10-10T14:17:54.055269Z","msg":"Here."},{"date":"2022-10-10T14:15:48.898586Z","msg":"actually no. They merely are better at games and graphics, than ski has shown. However 'operation flash' among other program shows that ski's claim to fame was never games or graphics. Its building PJS almost from scratch in HTML, making thumbnails crazy easy and reliable in HTML, allowing near instant communication among other things. See my point? ski never said he was the best game or graphic dev on KA. And if I may that was a very immature insult. We weren't even talking about ski, and then again you rekindle old flames."},{"date":"2022-10-10T10:34:12.522456Z","msg":"I may or may not have subbed to your thread with ski. *acts very nonchalant*"},{"date":"2022-10-09T22:29:11.809752Z","msg":"i am very confused. o.o"},{"date":"2022-10-09T10:27:02.759462Z","msg":"i think its pretty good.\n*stalky noises come back*"},{"date":"2022-10-09T10:08:45.598708Z","msg":"2. There is a couple things ski never does. I am his brother, so I would know. One of them is rekindling old fights unprovoked. Why jump in on the thread trying to rekindle old fights, when ski had turned the conversation to the scum on the top of the hot list right now, and then you turn it back to the original topic, all while ski 'disrespectful and hypocritical'? I refuse to let my brother just be attacked in such a way.\n\n3. Did I mention there are a few things ski never does? One of them is he never apologizes if he doesn't want too. Trust me, I have tried to wrench an apology from him on multiple occasions and he refused. The bottom line is that ski most likely will refuse to apologize, in that microscopic chance that he does lose."},{"date":"2022-10-08T23:20:18.663126Z","msg":"I highly doubt it, plus he is not new, look at Virtuosa's post, he called Virtuosa by her nickname 'V'. Thus he must be old, but not that old."},{"date":"2022-10-08T00:16:11.207959Z","msg":"a.) the program intentionally or unintentionally was very much of a gimmick to get votes, it wasn't well made, didn't actually honor anybody imo, and got a crazy number of votes.\n\nb.) the second program was labeled 'too controversial' after people from the first program ranted on a quite neutral and actually supportive post from ski."},{"date":"2022-10-07T18:47:22.835093Z","msg":"@lazerbrain:\na.)\nI'm sure ski would be glad to fix the bug.\n\nb.)\nyou start a fight because you are attacking ski for starting fights? the best thing you can do is to delete that post before anybody else sees this."},{"date":"2022-10-07T17:30:38.693144Z","msg":"uhh . . . I guess people went overboard when they saw this. I was being sarcastic . . . lol\n\n@lazerbeam:\nas mentioned above, I meant it _sarcastically_, ski is not a hypocrite.\n\n@BravoBravo:\njust to point something out, (for the restart button) after you stop scrolling the bug goes away however, in the program it doesn't."},{"date":"2022-10-05T13:12:27.631068Z","msg":"but i just got here, and i was having so much fun. :)"},{"date":"2022-10-04T10:58:08.605259Z","msg":"ahah! he even admits it!\n\nI have a couple clues:\n\na.) great graphics dev, but not so good at games based off the way you write your code\n\nb.) not new\n\nc.) TDJ noted your style is similar to that of LtCD's which could mean that you are LtCD whom deleed his account and thus explains this new account and the ridiculous graphic. However, I have my doubts that you are LtCD because the apple program is too simplistic/realistic to be LtCD."},{"date":"2022-10-03T14:14:27.17035Z","msg":"your ambiguity has justified my suspicions."},{"date":"2022-10-01T23:57:57.640363Z","msg":"https://www.khanacademy.org/computer-programming/new-program/4520437419130880\n\nmy attempt at the lava monsters, please tell me if i need to make changes. :D\n\na couple of notes on the menu screen, try to change the background faded ellipses to have an alpha value of 1. :D"},{"date":"2022-09-30T14:12:50.169553Z","msg":"a.) OK, ill work on it when I get back from school (study hall time currently)\n\nb.) Your choice, but they may add complexity to the game\n\nc.) Sounds like a good idea if you think you can do it. :D\n\nd.) so sorry, for being inactive when we should be working school caught up to me, after this round I will resign from the Khancorrenza, but I should be active enough to work on this project. again sorry."},{"date":"2022-09-28T12:28:14.697878Z","msg":"watching my brother go at it with IA is fun."},{"date":"2022-09-27T14:17:11.972318Z","msg":"have fun, I have to be Bronte and TDJ. Granted I have Captain Longtreader. But I still feel this is unfair. lol"},{"date":"2022-09-27T14:14:30.775862Z","msg":"b.) https://www.khanacademy.org/computer-programming/spin-off-of-all-flowers-in-time-turn-toward-the-sun/5227320341741568\n\nthen you just start coding like you normally would, except you can (if you want to) use new syntax and code without semicolons.\n\nd.) what is the theme? and do we have a storyplot or is it just going to be fighting monsters?"},{"date":"2022-09-27T14:04:24.406733Z","msg":"a.) how long do we have to work on the project?\n\nb.) do you mind using ski.js for cookie points? (practically PJS but more efficient, however we would need to use a webpage to run it)\n\nc.) who do you want to do the graphics? neither of us is that good at graphics.\n\nd.) what if we did 'waves' of monsters, and you had to defend a central base?"},{"date":"2022-09-26T14:09:59.602325Z","msg":"ah, thank you for that!"},{"date":"2022-09-26T13:58:52.531779Z","msg":"the collisions are off after I took the cam.x type things away from the program . . . this is what it looks like now.\n\nhttps://www.khanacademy.org/computer-programming/spin-off-of-all-flowers-in-time-turn-toward-the-sun/5750777644105728"},{"date":"2022-09-24T16:57:23.476402Z","msg":"Oh, sorry for not fully explaining the problem, the problem is I can't detect bullet-block collisions. \n\nb.) I tried that, and found it failed miserably."},{"date":"2022-09-23T15:34:50.206404Z","msg":"a.) it somewhat does . . . WebGl + ski.js\n\nb.) idk why I put FPS, I actually am making a 2D third-person shooter lol.\n\nhttps://www.khanacademy.org/computer-programming/spin-off-of-all-flowers-in-time-turn-toward-the-sun/5750777644105728"},{"date":"2022-09-23T13:58:01.553713Z","msg":"An FPS and a dodge game. I found that I need help with the former because I can't figure out the collisions with a camera in play."},{"date":"2022-09-23T10:24:23.939869Z","msg":"ik, but it wasn't to this extent, i mean 50 votes is one thing, but any program that gets 100 votes has reached the top 1% of all projects on KA . . . and there were so many comments I couldn't find my other thread, so I just made a new T&T lol. Luckily the number of T&T's proves these aren't bot votes."},{"date":"2022-09-23T10:19:24.872015Z","msg":"sort of, but you have to log it to the console, clear all the usual errors in the console, and then you can start seeing what it prints, `println` is much faster and easier."},{"date":"2022-09-22T19:52:30.051259Z","msg":"Lately, i have been working on making use of ski.js, I quickly have found that without `println`, bug-catching is a lot harder."},{"date":"2022-09-21T12:15:10.518711Z","msg":"Orange Leaf ftw."},{"date":"2022-09-20T17:51:12.974992Z","msg":"FF > JS without orange leaf. =]"},{"date":"2022-09-19T20:24:09.943067Z","msg":"no kid though, ski's comment had 4 votes and you only had one O.o"},{"date":"2022-09-19T14:11:52.177703Z","msg":"when you start downvoting ski's comment so bronte's subpage can see he light of day. smh"},{"date":"2022-09-19T14:00:42.802653Z","msg":"change it back or . . . ]=<"},{"date":"2022-09-17T13:34:01.903399Z","msg":"yeah I think my subbers are dead. lol"},{"date":"2022-09-17T11:29:13.52668Z","msg":"1. Fer Fer\n2. https://www.khanacademy.org/computer-programming/space-escape/6314914268889088\n3. (Latin) Ati\n4. Confidential information. Even my own brain doesn't have access to it.\n5. Most likely.\n6. ' . . . yeah . . .' - NF <- This is fun."},{"date":"2022-09-16T23:44:19.559275Z","msg":"this is hilarious. :D"},{"date":"2022-09-16T13:54:16.491569Z","msg":"lol, how do you expect me to know?\n\nI think the comments are there for the program to tell where the message and username are and differentiate them."},{"date":"2022-09-12T14:13:37.806883Z","msg":"(see ski's comment) (not to be offensive to YIVauEivoj YIVauEivoj)\n\nActually, ski topped YIVauEivoj YIVauEivoj and then HS16 topped them both, lol."},{"date":"2022-09-10T10:51:43.718115Z","msg":"@Apex:\n```_\nHide my plaques inside the closet, I just can't explain it\nMy wife, she tells me that she's proud and thinks that I should hang 'em\nBut I just leave 'em on the ground right next to my self-hatred_\n```\n- _*Leave Me Alone By NF*_"},{"date":"2022-09-07T14:01:06.573178Z","msg":"Oh, the MIT license says that the creators have 'own' the code they create, thus they are protected from plagiarism, technically on a legal level, but nobody would make such a big fuss about it to make a lawsuit of as said before an obscure program on a learning website.\n\nHere is what they say, (you can find this by scrolling to the bottom of the page right above the dark blue footer)\n\n'All code is owned by its respective author and made available under the following license: MIT license\nAll non-code (such as writing, drawings, images, etc.) are also owned by their respective author and made available under the following license: Creative Commons Attribution License\nFor more information please see: Terms of Service'"},{"date":"2022-09-06T14:16:01.305764Z","msg":"Just having a _little_ fun. :P"},{"date":"2022-09-06T14:13:48.312065Z","msg":"To put things in perspective, the people who own the copyright do not care about an obscure programs on a learning website by which the owner does not get any profit, and by which only increased attention to their movie can come from."},{"date":"2022-09-06T14:11:41.276902Z","msg":"But by the laws of the PB&J you are _not_ Rur. :D"},{"date":"2022-08-27T09:43:45.520192Z","msg":"The King O' Stalkers could not help himself. :)"},{"date":"2022-08-23T11:40:52.86817Z","msg":"i didnt even know that was a phase. O.o"},{"date":"2022-08-22T23:15:17.578308Z","msg":"Totally didn't do the same thing to you. XD"},{"date":"2022-08-18T16:43:15.912539Z","msg":"hit the escape key. and imagine the possibilities. XD"},{"date":"2022-08-18T14:32:07.653677Z","msg":"wrong Ky. Ky !== ski. ski_alt_named_ky === ski. though that would be a plot twist. O.o"},{"date":"2022-08-18T14:30:42.462767Z","msg":"a.) make a new webpage\nb.) try to set height to 600\nc.) save and reload\nd.) marvel at it still being a 400 height\ne.) come back here and read the webpage\nf.) thank ski for all he has done. :D"},{"date":"2022-08-18T14:09:32.082512Z","msg":"lol ski is nice . . . just strong-willed."},{"date":"2022-08-18T14:00:48.393911Z","msg":"nah, i actually don't. i merely here ski rant all day and night, about how easy it is to fix all these bugs, and what they are . . . and if he isn't talking about those bugs, that means he has a bug in one of his programs and wants my help as if I know more than he does. XD"},{"date":"2022-08-18T13:51:30.05167Z","msg":"not sure about this _specific_ bug being one line, (extremly simple though), but many bugs like the bug where PJS programs don't load properly (where the project loads in a 100 x 100 canvas), and the one where all HTML programs, even if they don't need it, have scroll bars, are both one-liners that the KA devs themselves made, the KACP has pointed out, and have not been fixed yet. This happens so frequently, as alluded to above, that the KACP has a running joke about the 'monthly KA bug'. Usually the KACP finds a way to fix it, and uses that until the bugs are fixed, if ever.\na list of bugs not fixed with their solutions:\n```\nthe current settings bug -> utiliza the console using a method, created by my brother ski just today. if you want I can provide a link\n```\n```\n100 x 100 PJS canvas bug -> createGraphics([desired width], [desired height], P2D)\n```\n```\nimpeccable scroll bar in HTML -> again ski found a way to fix it. i will send you the link if you request it. (too long to be put here)\n```\n```\nimpeccable scroll bar in PJS -> none known fix currently\n```\nAlso to prove they are one-liners the following is the replacement code for the scrollbar bug.\n```\noverflow-y: auto\n```"},{"date":"2022-08-18T10:57:15.864072Z","msg":"yeah it is wretched."},{"date":"2022-08-18T10:56:21.640065Z","msg":"transliteration: ski only leaves negative comments, not because he _is_ negative, but because he only commments when there is something negative to say. Leave other people to be positive , ski will show people what they don't want to see. Afterwards a whole bunch of people (usually noobs) then rant about how he is never leaves positive comments (even though he does like programs) and says he stirs up arguments, and then in effect stir up an argument, and continue arguing even when he tries to stop . . . happened more than once."},{"date":"2022-08-18T10:48:14.803418Z","msg":"He totally fooled me. XD"},{"date":"2022-08-17T23:48:26.459343Z","msg":"plot twist:\nNoah H. figured out ski's code has a bug, so ski is 'borrowing' HS16's code. Busted bro. B)"},{"date":"2022-08-17T23:45:51.730232Z","msg":"Depends on what school you go to :P :\n\n'Explain.'\na.) wrong\nb.) wrong\nc.) wrong\nd.) also wrong\n\nBut yeah, you put a little work into it A's are easy pickins."},{"date":"2022-08-16T23:27:04.988792Z","msg":"Why did two of the best 3D coders pop out of some random abyss to correct me? I am not sure if I should be ashamed or honored. O.o"},{"date":"2022-08-16T23:10:13.773541Z","msg":"*EDIT:*\n\napparently, all my previous assumptions about WebGL were wrong. just read Willard's and Henry's comments to get an idea."},{"date":"2022-08-15T22:43:42.895386Z","msg":"When Dominic is so good that he makes CBF second guess whether or not he taught Sal. O.o"},{"date":"2022-08-15T17:28:35.796582Z","msg":"Look at that ego go. lol jk jk"},{"date":"2022-08-15T17:11:07.749651Z","msg":"Huh, didn't realize you were going soft. :P"},{"date":"2022-08-15T17:01:36.250061Z","msg":"Congratulations! He probably didn't realize that your subpage says 'DESPISES: 75% of people'. lol"},{"date":"2022-08-15T16:59:32.055825Z","msg":"Sure! :)"},{"date":"2022-08-15T16:46:17.737367Z","msg":"i have been to an online school before, it was an interesting experience. Just wondering, but do you know why you got picked?"},{"date":"2022-08-15T16:41:03.939299Z","msg":"that is interesting . . . what is the pilot program for?"},{"date":"2022-08-15T13:23:11.017606Z","msg":"One week in the grand scheme of things isn't that much right?"},{"date":"2022-08-15T10:30:39.267389Z","msg":"The text looks nice, (maybe it was because my brother always bugs me about my backgrounds), but it still needs a little something in the back. Maybe like this?\n\n`noStroke();\nfor(var i = 0; i < 10; i++){\n    for(var j = 0; j < 10; j++){\n        fill((i + j) % 2 ? color(0, 10) : color(255, 10));\n        rect(i * 40, j * 40, 40, 40);\n    }\n}\n`"},{"date":"2022-08-12T23:18:39.317293Z","msg":"I wouldn't suggest deletin' your account as a lot of people would like to see your projects, and they would disappear if you deleted your account.\n\nAlso, might want to talk to ski about errors in the console if that doesn't work, he knows more about this sort of thing than I do. :D"},{"date":"2022-08-12T11:11:28.406851Z","msg":"Lol, oh also to correctly answer your question about maksing to ski, (on this program) you _can_ use masking outside of the static enviornment like this. (You have to do this because of a KA bug.)\n`````\nif(img){\nimg.mask(image);\n}\n`````\nHowever, _getting_ an image inside the draw function is extremly laggy, thus my answer, and ski's."},{"date":"2022-08-12T11:07:29.155698Z","msg":"(sorry for the long response time)\n\nah, okay.\n\nsure! (i might be less actibe once school starts though.)\n\nSome other things to note:\na.) emoji's though helpful in some circumstances, are actually a bad practice because of the way they show up on different computers, some computers will show the emoji's up fine, some will show the emoji's but squished, and some older computers will have no idea what an emoji is and go bonkers. However, emojis have been used for graphical purposes by well-known graphics creators. Just a thought to keep in mind. :)\n\nb.)\nI would highly recommend that you use proper grammar (in your projects), as it looks more prefessional, and a portion of people do not know 'text slang', while others just find it anoying. However to some extent they are okay, because my brother, ski, has cosistently refused to uppercase his letters in his projects, and use apostrophes consistently where they are unneccesary."},{"date":"2022-08-12T10:56:35.925528Z","msg":"I looked through his projects and he poats something similar on every single one of his programs though most of the time, he will say something to the sort of 'I hope you have a wonderful day.' Each time he makes alterations to the message, but most of the time (one exception) the general idea stays the same."},{"date":"2022-08-11T23:27:49.695231Z","msg":"honestly with a touchpad, it is quite easy for me. Plus you don't have to do it all the time, just when you get low, and need a little extra mula in order to refill your tank. :P"},{"date":"2022-08-11T23:26:33.340513Z","msg":"I am guessing you still want to finish that game where you have exactly one more story plot to go, and then you are finished. :P\n\nWhat happened? I stalked your discussion and you haven't posted in a month, and then I somehow picked the right day to catch you on KA? lol"},{"date":"2022-08-11T17:43:44.389832Z","msg":"Which part?"},{"date":"2022-08-11T16:43:03.057647Z","msg":"ah, okay."},{"date":"2022-08-11T13:19:08.756461Z","msg":"To clear it up, if >50% of the program is not created by you, you must spin-off. Also, the words 'no credit needed' are ruled useless by the guidelines which say that credit _must_ be given no matter how small. Thus this program is plaigarism and should be flagged for gaurdians to view. :)"},{"date":"2022-08-11T13:15:28.590804Z","msg":"I'm going to flag for plaigarism, but cet2009, it is also against the guidelines to 'repeatedly making the same post'. If you could remove all but one of your comments that say 'Don't plaigarise!' that would be nice . :) Also it is spelled plagarize."},{"date":"2022-08-11T11:09:23.940937Z","msg":"uh, may i ask what aime, alcumus, AMC 10 & 12, and AoPS are?"},{"date":"2022-08-10T23:53:15.089651Z","msg":"@Rager:\nWassup?\n\n@Multiverse:\na ferret. :D"},{"date":"2022-08-10T19:03:43.761939Z","msg":"actually in some cases it beats yours. huh."},{"date":"2022-08-10T19:01:55.715243Z","msg":"true, it might be not as clunky if I didn't have to have all the exceptions for horizontal and veritcal lines."},{"date":"2022-08-10T17:50:36.813126Z","msg":"oh sorry, for not responding to this. yes, i do know of the ways to get around the problem, one has been supplied to you. =)"},{"date":"2022-08-10T17:38:40.727565Z","msg":"looks nice, i would suggest a background, and maybe some more detail on the pan, but besides that i think it looks nice. :)"},{"date":"2022-08-10T14:06:54.365612Z","msg":"i made it anyways. lol, no credit is needed as i gave myself a sort of credit inside the code.\n\nhttps://www.khanacademy.org/computer-programming/new-program/6541218895413248"},{"date":"2022-08-10T11:52:31.961573Z","msg":"it isn't longer than the other, merely the other are covered up by the following brick, because the following brick is drawn over them. thus the last brick doesn't have anything else to be drawn over it and the full length of the brick is shown. ;)"},{"date":"2022-08-10T10:30:25.646521Z","msg":"this post now has more votes than NL's subpage, i guess a lot of people agree. lol"},{"date":"2022-08-09T19:56:40.114156Z","msg":"facebook invaded KA. O.o"},{"date":"2022-08-09T15:59:04.797807Z","msg":"it doesn't lag, it is merely showing different still scenes at different times. :)"},{"date":"2022-08-09T14:22:04.714966Z","msg":"Nikola Tesla once said that Edison wasn't as bright as some claimed he was. To illustrate he said that instead of taking a magnet to find a needle in a haystack, Edison would individually go through each piece of hay until he found the needle. Why is this important to this discussion?\nBecause both ways would work, and Edison would be able to brag about how long he spent searching for the needle, though most of it was unneccessary. Thus >1000 lines of code should mean squat to everybody.\n\nNote, I am not trying to downplay your achievemnets, or belitlle your goals, merely pointing out an observation, and a conclusion based off of it. :D"},{"date":"2022-08-09T13:50:54.128195Z","msg":"darn shift key."},{"date":"2022-08-09T13:49:36.466358Z","msg":"That is how they stream all of their videos. And for some odd reason they got rid of the ability to make Python programs, (third-hand, so don't quote me on this) and with it the Python course material. Thus their youtube channel has the course material, but the website does not. :)"},{"date":"2022-08-09T12:08:59.758653Z","msg":"sorry i cannot cut up the keyword `break`. much less let you off the hook. ;)"},{"date":"2022-08-09T11:49:52.551832Z","msg":"note that ski _DID_ make a silly syntax error."},{"date":"2022-08-09T11:44:37.793733Z","msg":"lol, i just created >1000 lines of code in graphics, and that took me 2 hours. I hate graphics."},{"date":"2022-08-09T10:19:52.848962Z","msg":"i coulda sworn . . ."},{"date":"2022-08-09T10:15:29.119322Z","msg":"the problem with your pointInAABB function is that it will glitch if inbetween two frames the mouse went through a box and then back outside of e.g. at a corner. Thus since it doesn't check for the points on the line the program would claim it wasn't colliding."},{"date":"2022-08-08T22:58:47.37478Z","msg":"2. Or KA really needs that ES6 syntax. XD"},{"date":"2022-08-08T22:54:45.878227Z","msg":"silverleaf12, I believe is a *she*"},{"date":"2022-08-08T22:51:51.43226Z","msg":"works on my device. :)\n\n(this is just bragging to my older brother I have the better comp. :P)"},{"date":"2022-08-08T22:46:44.072556Z","msg":"lol, the way this is going, it will be on the hotlist soon. XD"},{"date":"2022-08-08T22:46:07.925727Z","msg":"ah, thank you! =)"},{"date":"2022-08-08T22:45:56.267599Z","msg":"_shhh_\ni am making a collaboration with the user Bawooga, that has similarities to the Time Warriors if you know what that is. :)"},{"date":"2022-08-08T19:04:49.893672Z","msg":"a.)\ni have a random person(s) who votes up all my WIPs no matter how insignificant leaving most of my projects in my recents with two votes. lol, so only one person voted. XD"},{"date":"2022-08-08T19:03:56.806706Z","msg":"that took me a long time, hopefully they work. XD\n\nthanks!"},{"date":"2022-08-08T19:03:12.628524Z","msg":"look up 'line collisions in java script' and it should get you some results that work. Then you simply make it into a function that returns true if colliding and false otherwise, and then if the function is true for the line you stated plus a line that acts as the border of the wall, then 'end = true'"},{"date":"2022-08-08T16:42:40.39705Z","msg":"DO NOT VOTE\n\nThis is for my sanity more than anything else.\nDo the ears look right, on the side view?\n\nhttps://www.khanacademy.org/computer-programming/p/4788626863472640"},{"date":"2022-08-08T16:34:01.939163Z","msg":"Well, when you live in the Ferferian universe you can't exactly make the bajillions of miles to the nearest church on Earth every Sunday. ;)\n\nEDIT:\n@Virtuosa\nfrankly, i still do wear masks, and a couple of weeks ago I got COVID. lol"},{"date":"2022-08-08T14:28:31.769265Z","msg":"i dont think i have watched youtube in over two months lol. besides online church, if you count that."},{"date":"2022-08-08T14:27:52.399251Z","msg":"something amazing."},{"date":"2022-08-08T12:51:49.201831Z","msg":"ah. I can already hear your doctor fainting when you tell him you watched 15 hours of youtube in one day. XD"},{"date":"2022-08-08T12:30:52.154139Z","msg":"lol, my previous statement was too ambiguous.\nI was referring to the fact that you released two projects recently, after a span of time when you hadn't been making much. :)"},{"date":"2022-08-08T11:14:53.154808Z","msg":"Ah, if you can I would suggest a quick internet search for line-line collisions. Once you have those, you should be able to fix the problem rather easily. :)"},{"date":"2022-08-08T11:13:05.175395Z","msg":"That has to do with the thumbnail scripts for HTML. Khan Academy currently had a very glitchy thumbnail script, thus your image not showing up, however there are users who claim to have come up with ways to solve this problem. :)"},{"date":"2022-08-08T10:44:19.74453Z","msg":"ski is actually trying to one-line it right now. XD"},{"date":"2022-08-07T23:56:22.482702Z","msg":"Tom better give me a cookie first. XD"},{"date":"2022-08-07T23:49:59.525428Z","msg":"Khanalytics is Aliquis's project. :)"},{"date":"2022-08-07T10:25:17.196038Z","msg":"Ferrets, weasels, and our mustellid allies eat mice (look it up).\nFerrets > Mice. Fer Fer > Tom."},{"date":"2022-08-06T20:20:53.764538Z","msg":"where are the threads for submitting?"},{"date":"2022-08-06T11:53:50.132498Z","msg":"this is the (alleged) brother's profile, scroll a little bit down and click on his comments on the SpiritWolf homepage, and that will bring you to the claim that started this whole thing.\n\nhttps://www.khanacademy.org/profile/kaid_8802603275603228593142717/discussion/replies"},{"date":"2022-08-06T11:05:54.979774Z","msg":"he is an ugly grumpy mouse in costume. :/"},{"date":"2022-08-06T10:53:57.735345Z","msg":"lol, move to ski.js! the library that combines ski's need for efficiency, the best with the graphical powers of PJS, and since it run in HTML, all the API and localStoarage one would ever need! \nPlus ski, recently (yesterday) got it up and running on a CDN so it doesn't take up unneccessary lines of code! Not to mention the fact that you can use ski.js alongside ES6+ syntax that makes everything faster, more efficient, and altogether shorter. \n\nCall for your free quota!"},{"date":"2022-08-06T00:05:16.025409Z","msg":"lol, I forgot to add something. XD\nthis works.\n\nthrow {\n    message: 'Please add ?height=700 to the end of the URL'\n};\n\nwelcome!"},{"date":"2022-08-05T22:05:59.672231Z","msg":"been doing fine. (and we found a home. :D)\n\nlol, i was wonderin' why your activity levels dropped recently. :)"},{"date":"2022-08-05T15:00:49.271274Z","msg":"#WhatIsLuau?NeverHeardOfIt\n#AhIsRobloxStudioSimilarToKhanAcademy"},{"date":"2022-08-05T14:14:57.393864Z","msg":"#WhereAndWhatLangauge?"},{"date":"2022-08-05T14:14:10.278826Z","msg":"No, cet2009 what you need is not ski to stay off the HL, it is for him to stop listening to NF. :)"},{"date":"2022-08-04T23:19:52.328148Z","msg":"Sorry, I haven't been on much today, hopefully I'll get started on selectables tomorrow. :D"},{"date":"2022-08-04T14:12:03.32813Z","msg":"Agreed, the technical wording of 'personal' does not fit the program, but then what is the point? KA wants their platform to be a place to learn, not to become a social media platform. Heck, they would get a lot more money, but that isn't the purpose.\n\nI do not mean to be disrepectful to Apex, but I would have to say it wasn't meant for KA (unless it follows second sentence after this). Again, KA is a place to learn, not a social media platform. Also I am not sure if this would fit Apex's program, but making a program _because_ someone died, is very different than making a program _about_ someone dying. This program's sole purpose is to be _about_ the issue. I do not know Apex's program, but it could be he made the program, and made it _because_ his grandmother passed away, and left comments in the code about it, etc, but it had a purpose other than to just let people know somebody died. Like this program.\n\nAgain, I do not know the program so I cannot say. (also, I ain't the end all be all, and I can be totally wrong, this is just my perspective)"},{"date":"2022-08-04T13:55:54.852987Z","msg":"@FSoM:\nNot to be rude, but how would you define it? Though the technical definition of 'personal' issue, does not fit this program, the general idea of the fact they do not want people posting what is going on in their life instead of learning, fits this catergory. :)"},{"date":"2022-08-04T13:21:32.499835Z","msg":"Hit the flag button on the program, and look at the button off-topic's description. The last thing it says is 'personal issues', and this program is very much about personal issues. from there you can read ski's comment that Qwerty understands this and defies the guidelines, and thus as a KA user under the Guidelines I must flag."},{"date":"2022-08-04T10:57:43.861777Z","msg":"A more beginner programmer, the few times I had heard about them, came from them arguing with ski, lol. \n\nOn a side note, I have no clue how they figured out she died."},{"date":"2022-08-04T10:56:34.93034Z","msg":"yeah, there is no way to verify anything.\n\nlol, look at ski's comment."},{"date":"2022-08-04T10:52:00.672882Z","msg":"Flipping the coordinates around explains many of the problems I had with the function.\n\nAh, I haven't taken Trigonemtry yet, what is a subtrahend?"},{"date":"2022-08-04T00:11:19.125571Z","msg":"how you doin'?"},{"date":"2022-08-03T23:02:08.96264Z","msg":"My entry to a contest I joined, the theme is 'Creatures Of The Deep', so this is the bare bones for a game where you harpoon fish. Hit space to let a harpoon rip. :D"},{"date":"2022-08-03T15:06:12.961486Z","msg":"*ah, but I can*\n*you shan't win*\n*The Universes are kinda heavy. you can not move*\n_>:D_"},{"date":"2022-08-03T14:56:44.049673Z","msg":"Check Line 16 in the code. :)"},{"date":"2022-08-03T12:51:57.312841Z","msg":"lol, I have too much on my plate anyways.\n\ndo you have enough time to test something for me?"},{"date":"2022-08-03T12:42:59.062246Z","msg":"ah, yes of course grass.\n\nif you were more active I would suggest a collaboration, lol."},{"date":"2022-08-03T10:27:56.933558Z","msg":"#LolIWasWonderingIfYouWouldSeeThis"},{"date":"2022-08-03T10:27:30.429649Z","msg":"#StillBreathingToo\n#AreYouCoding?"},{"date":"2022-08-02T23:47:22.916153Z","msg":"*digests your chewing my swallowing your eating my eating your eating my eating your eating my eating of your comment eating my comment eating your program*\n\nI'm bad with this kind of thing. Tell them not to die, and not to become a Radiant Weasel, the Ferrets will always be stronger."},{"date":"2022-08-02T23:39:32.747622Z","msg":"*swallows your eating my eating your eating my eating your eating my eating of your comment eating my comment eating your program*\n>:D\n\nHow is Radiant Ferret?"},{"date":"2022-08-02T23:08:44.396863Z","msg":"You may find YokieBob's program helpful. :D"},{"date":"2022-08-02T23:01:45.279599Z","msg":"*eats your eating my eating of your comment eating my comment eating your program*\n(this reminds me of a thread where CORRUPT and I went back and forth with hastags, lol)\n\nhe really doesn't have a reason too, just post something to engage him, don't expect a response soon, and eventually he will show up. :D"},{"date":"2022-08-02T19:07:41.971704Z","msg":"i see, quite interesting."},{"date":"2022-08-02T19:05:41.402461Z","msg":"*eats your eating my eating of your comment eating my comment eating your program*\nhe comes back every now and then tho"},{"date":"2022-08-02T19:04:51.223462Z","msg":"ah, good point. Just a though, if you want peak activity you should do it in early fall, the time you chose specifically coincided with the end of Winter Break, when people have time. Thus participators would join, but then not be able to fulfill their duties as school came back into their lives. :D"},{"date":"2022-08-02T17:25:42.372915Z","msg":"lol, he has a style similar to the one used here, I think he has a graphic, almost exaclty like this one, if I remember correctly.\n\nHe also loves to put '*eats the* . . . ' e.g.\n*eats your eating my comment*"},{"date":"2022-08-02T17:15:56.683073Z","msg":"Just wondering, but will you host COC next year?"},{"date":"2022-08-02T12:21:54.994418Z","msg":"Huh, it sound intriguing, but how does the second step work? The first step sounds easy, but the second step I have no clue how to do, not to mention the third step."},{"date":"2022-08-01T22:17:11.828623Z","msg":"ah, i have heard about it before. I am not sure if that is what I was talking about, I was more looking for rotated rect to rotated rect collisions, where it doesn't merely just detect if it is colliding, but pushes the rects so that they stay apart, if that makes any sense. It appears that your verlet intergration only detects collisons between borders and the figures. :D (ski yells at me when I call it collisons)"},{"date":"2022-08-01T18:37:58.306735Z","msg":"ah, that is what I do too, but for certain things where you need coordinates, for example a game where you swing back and forth, you can't simply 'rotate' the player to get coordinates, thus the function. I am currently building an animation rig where the character's hands swing back and forth, thus the program."},{"date":"2022-08-01T17:53:57.486794Z","msg":"answer for me and polar:\n\nour computers run reverse iteration slower some of the time and it will say '.forEach is 0.8 times faster', when it lost to reverse iteration. :D"},{"date":"2022-08-01T16:36:57.597107Z","msg":"huh, that is quite intriguing."},{"date":"2022-08-01T13:57:43.100552Z","msg":"ah, yes breathing is very good . . . most of the time, as long as you aren't breathing COVID.\n\nhave you ever worked with animation rigs? i find them quite tiresome."},{"date":"2022-07-31T23:53:48.844799Z","msg":"Re. Re. b1)\nInteresting, I am currently taking a course on binary, but have yet to learn about decimals and negative numbers. Are all decimals infinitely long? If not, why are some not inifinite binary numbers?\n\n\nRe. Re. c1)\nThat is more of my parent's choice as I am homeschooled, and they have already given me access to other sites to learn on. e.g. Mozilla Developers Network.\n\nRe. Re. c2)\nAh, thank you for explaining."},{"date":"2022-07-30T22:29:46.452882Z","msg":"he has the same exact collisions lol.\n\nhe made his own circ-circ collisons from scratch with help from the Non-Pirate, when he had trouble with circ-rect collisons he asked Levi F. who gave ski his collisions lol."},{"date":"2022-07-29T15:45:15.032591Z","msg":"you didn't take ski's collisons? he came up with both circ-rect and circ-circ collisions by himself."},{"date":"2022-07-28T16:46:08.188022Z","msg":"Sure, ig. lol, I haven't been in a team in a while."},{"date":"2022-07-28T16:41:19.340376Z","msg":"yeah, I know he is still around, its just that he is a legend now, and I am looking back at a time when he wasn't as known as he is now."},{"date":"2022-07-28T16:40:04.934458Z","msg":"hah, he can join. I beat him in a competition that he and I are a part of, he is decent for graphics."},{"date":"2022-07-28T16:38:46.675081Z","msg":"lol, im hilarious."},{"date":"2022-07-28T15:28:43.829001Z","msg":"sorry, i don't know who you are referring to. if you are referring to Youself Elkhoy, the last time he commented was 3 years ago, so I wouldn't count on him being on."},{"date":"2022-07-28T15:27:34.673917Z","msg":"a.) no worries!\n\nb.) you don't? the possbilities are endless, by the way what Gray Wolf does is benign, KA has that out there for people to use, what Gray Wolf can't get to is more private information, like changing a username or finding your password. :D"},{"date":"2022-07-28T15:24:07.364979Z","msg":"https://www.khanacademy.org/computer-programming/mask-tutorial/6244323458056192\n\nCaptain Argon has a wonderful tutorial on how to use `mask`. :D"},{"date":"2022-07-28T15:22:19.247027Z","msg":"wow, red arrow the legend, 3 years back. xD"},{"date":"2022-07-28T14:22:28.002147Z","msg":"are you asking how to mask?"},{"date":"2022-07-28T13:57:57.171378Z","msg":"a.) Gray Wolf is a he. :P\n\nb.) lol, ski can crash a browser (which he has threatened to do on multiple occasions), create a nearly infinite stream of spin-offs, can quickly collect a lot of data from KA using their API (what Gray Wolf does), and more. But ski isn't the most knowledgable in all realms either, when it comes to coding knowledge, Aliquis, Bob Lyon, and Henry also know a lot. Also, Vexcess, who used to be on KA, knows a lot more than ski. I forgot whom, but somebody on KA was able to tell you which browser you were on, your battery level, and a bunch of other freaky stuff.\n\nski used to have websites that rivalled (and according to him beat) Gray Wolf's but he was banned for a time, so you can no longer see them, he also has a ton more games than you currently cannot see, cus he was banned. Also, honestly, sometimes Gray Wolf's projects feel redundant, for a time he almost constantly produced mobile games, that even i could do, just with better graphics. Could be me being jealous of his fan base, but honestly that is just how i feel.\n\nIf you like Gray Wolf's API stuff you may want to look at Khanalytics. Aliquis can probably help you better than I can, if you are asking about API, etc.\nhttps://www.khanacademy.org/computer-programming/khanalytics-demo/6240578367963136\n\nEdit:\nlol, i forgot ski made 'operation flash' that allowed instant messaging between KA users possible, and allowed some KA users who could not comment becuase of technical reasons to still be able to interact with the community."},{"date":"2022-07-27T23:47:44.214896Z","msg":"yeah, its kinda hidden.\n\nyup! music to my ears after i heard the cacophony of the two words 'unicorn' and 'sprinkles' as the theme.\n\ni won! ski dropped out, 'cuz we didn't really have time to work on it this week. :)"},{"date":"2022-07-27T23:27:17.305147Z","msg":"1) https://www.khanacademy.org/computer-programming/operation-fire-boy/5496857793445888\n2) Fer Fer\n3) Gold, and for a reason. :P"},{"date":"2022-07-27T16:54:55.578266Z","msg":"lol, he can find ways to do things, that though are benign, the KA Developers did not intend for you to do. :)"},{"date":"2022-07-27T00:07:21.721834Z","msg":"yes, it was a very sad day. But I know to use the `shift` key now. :D"},{"date":"2022-07-27T00:04:10.475004Z","msg":"@Bob Lyon:\n\na.) Ah, ski, my brother, gave me a similar explanation though not so in depth.\n\nb.)\n'So, you might surmise that ? cannot be accurately encoded, but it might surprise you that ? suffers the same fate.'\nI am at a loss on how you got to the numbers, can you explain?\n\nc.)\nSorry, I currently cannot go to `Wikipedia`.\n\nd.)\nI should have realized that you did something to that sort.\n\ne.) Thank you for your time and the explanation!\n\n@Bobert:\n\na.) Ah, ski, my brother, mentioned BigInt, but he talked about having to use it in the HTML enviornment or having to use a workaround to use it in PJS.\n\nb.) You made all my code into a couple lines, I should have known there was an easier way.\n\nc.) If I may, what exactly does (see below) do exactly? I know as much as the `sq.` and no further.\n`sq.constructor(\"return BigInt\")();`\n\nc.) Thank you for your time and the explanation/code!"},{"date":"2022-07-26T16:10:58.243513Z","msg":"lol, there is a funny story about me and the shift key:\nwhen i first started typing on a computer i thought that you had to hit the `caps lock` key in order to get capital letters, three months later i found out about the shift key, you can imagine how i felt. >:("},{"date":"2022-07-26T14:21:09.772953Z","msg":"nope, and even if i did, i am kinda stubborn, ski can testify. XD"},{"date":"2022-07-26T14:04:40.212707Z","msg":"better watch it, i was about to post a full length fake article with the title\n\"_*FF vs. SKI UPSET! SKI LOSES BIG TIME*_!\"\n\n=P"},{"date":"2022-07-26T13:39:24.276112Z","msg":"@ski:\nanimation? Time Warriors! and I could hop along for the ride. :P\n\n@marci:\n:P ferrets have taken lessons in weaseltry."},{"date":"2022-07-26T13:17:29.058731Z","msg":"the no longer self-proclaimed King O' Stalking cannot help himself. :D"},{"date":"2022-07-26T13:12:50.953257Z","msg":"finishing your rts\nfinishing operation war\nfinishing operation pilot\nfinishing any of your WIPs\nmaking that PJS workaround tutorial you told me about\n\ndare i go on?"},{"date":"2022-07-26T13:00:27.22395Z","msg":"yup . . . at least somebody who can write i hope can read. :P"},{"date":"2022-07-26T11:04:53.983341Z","msg":"lol, but people also know crazy good graphics when they see them. :D"},{"date":"2022-07-25T23:56:36.047807Z","msg":"is that sarcasm?"},{"date":"2022-07-25T23:55:16.654512Z","msg":"i think i smell sibling rivalry. lol"},{"date":"2022-07-25T23:50:02.122496Z","msg":"nice to see you around! :D\n\nYoshihaven is your younger sibling? huh. i would not haave guessed. your styles are very different. XD"},{"date":"2022-07-25T22:36:31.519814Z","msg":"your welcome! :D"},{"date":"2022-07-25T12:26:47.486387Z","msg":"yes, line 244. :)"},{"date":"2022-07-23T22:28:30.555441Z","msg":"lol, i can see that, if you do just take a look at the code and you should find a way out. :D"},{"date":"2022-07-23T22:27:43.896822Z","msg":"'let's be blunt your graphics were horrible. you didn't even take the two seconds to give the guy a smiley face. come on.'\n- ski\n\n'I'll be polite and call it simplistic. :D'\n- IA\n\nlol, big difference. XD"},{"date":"2022-07-23T17:11:22.42656Z","msg":"a.)\n// jshint esnext: true\nlet games_scarier_than_men = true;\nlet IA = (games_scarier_than_men ? 'right' : false);\n:P\n\nb.)\nthank you!\n\nc.)\n'simplistic graphics'\nyou are hilarious, my graphics are just `rect`s or `ellipses` with `fill` and `noStroke`"},{"date":"2022-07-23T16:57:19.51458Z","msg":"I have a feeling you are right. :D"},{"date":"2022-07-23T16:55:42.28486Z","msg":"lol, thank you!"},{"date":"2022-07-22T23:05:56.674408Z","msg":"lol, easy for you to say."},{"date":"2022-07-22T23:03:16.580725Z","msg":"oof . . . maybe i should've lightened up a bit. nah."},{"date":"2022-07-22T23:01:09.04693Z","msg":"thanks!\n\nwow . . . even i haven't done that. lol"},{"date":"2022-07-22T22:54:58.4013Z","msg":"no, it was not hard enough. :)"},{"date":"2022-07-22T22:51:22.626826Z","msg":"level 9? the last level? the one where you act normally and you get to the end?"},{"date":"2022-07-22T22:50:42.560107Z","msg":"thakn you! :D"},{"date":"2022-07-22T22:50:35.189303Z","msg":"smh - shaking my head\n\n:D yup!"},{"date":"2022-07-22T22:50:17.170198Z","msg":"it is either you are good at rage puzzles or you are good at withstanding torture. You are an interesting specimen, i need to study you. O.o\n\nthank you!"},{"date":"2022-07-22T22:49:25.775692Z","msg":"yup that is there on purpose. :D"},{"date":"2022-07-22T22:48:51.726613Z","msg":"thanks!\n\nyeah, not many people seem to like this, because it induces rage. lol, this was fun to make though. :D\n\n@redFlower13:\nthanks! (cheater . . . XD)"},{"date":"2022-07-22T19:07:40.189197Z","msg":"rage amusement, same difference. :D"},{"date":"2022-07-22T19:07:21.016363Z","msg":"thanks! and . . .  that is way too ironic 'cuz everybody else got mad. :D"},{"date":"2022-07-22T19:06:47.123532Z","msg":"thank you!\n\nthank you! :D"},{"date":"2022-07-22T19:06:22.361223Z","msg":"lol, some of these come from conversations, and that one is very prevalent. :D"},{"date":"2022-07-22T17:03:45.530351Z","msg":"Big oof you haven't even gotten to level 8 yet smh."},{"date":"2022-07-22T17:03:23.065082Z","msg":"The actual answer is yes, try looking at the levels array starting at line 244 if you need help. you can ask for hints if you want. :D"},{"date":"2022-07-22T14:58:36.49863Z","msg":"thanks! >:)"},{"date":"2022-07-22T14:58:26.075539Z","msg":"thank you! :D"},{"date":"2022-07-22T14:58:14.499808Z","msg":"@NP:\nTorture device? Let us not be melodramatic here. I simply made a rage-inducing game that is hard because of the way it was created. :D\n\n@cet2009 My Dear Sir:\n>:D"},{"date":"2022-07-22T13:43:19.682942Z","msg":"big oof this _was_ a torture device"},{"date":"2022-07-22T13:40:20.515179Z","msg":"it would be a torture device if i forced you to put ?editor=no at the end of the url. >:D"},{"date":"2022-07-22T13:37:23.953158Z","msg":"Are you sure? I think it is a game, it was at least fun making it . . . and thinking of the rage it would cause those who do not look at the level map array. :D"},{"date":"2022-07-22T13:31:19.72562Z","msg":"you ruined mine. :D"},{"date":"2022-07-22T13:24:06.236865Z","msg":"I added a variable for number of lives. :D"},{"date":"2022-07-22T13:13:53.622685Z","msg":"a.) space to shoot (if you didn't alreayd know that)\n\nb.) stay behind the corner of blocks so that the enemies shots hit the block and your shots hit the enemy\n\nc.) all levels have been beaten, level four is rage inducing.\n\nd.) i am releasing a much much harder game today. >:D"},{"date":"2022-07-22T11:39:59.615864Z","msg":"https://www.khanacademy.org/computer-programming/spin-off-of-space-escape-with-better-speed/5283476094369792\n\nsomebody made a spin-off that made it a lot easier to beat, if you want to see it. :D"},{"date":"2022-07-22T11:39:07.572742Z","msg":"Mwahahahaha . . . :D"},{"date":"2022-07-22T11:38:21.491375Z","msg":"thank you!\nlol, speeeed go brr."},{"date":"2022-07-22T11:36:05.528533Z","msg":"huh. thank you for the explanation!"},{"date":"2022-07-21T23:45:35.160525Z","msg":"thank you!"},{"date":"2022-07-21T23:45:25.016974Z","msg":"I think i understand most of what you are saying, (I do not entirely understand what a vector is as I have not gotten to that in math yet) but does `normalize` work in PJS?"},{"date":"2022-07-21T22:56:01.085352Z","msg":"thank you!"},{"date":"2022-07-21T22:53:58.271073Z","msg":"not today, maybe tomorrow though. lol"},{"date":"2022-07-21T22:53:45.047713Z","msg":"thanks! :)"},{"date":"2022-07-21T22:53:33.919922Z","msg":"it won't, but the delag variable also works. Basically your computer can't run 20 some thousand circles all at one time. :P"},{"date":"2022-07-21T22:52:23.37039Z","msg":"lol, yup! :D"},{"date":"2022-07-20T18:52:04.916251Z","msg":"huh, Liam K. acted as if it was a WIP. lol"},{"date":"2022-07-20T18:33:47.970005Z","msg":"We will never know."},{"date":"2022-07-20T17:40:53.948404Z","msg":"a.)\ni'll have to update it after judging is finished, but i'll be sure to add it, thanks!\n\nb.)\nThanks!"},{"date":"2022-07-20T16:53:16.82959Z","msg":"oof you are going to need to submit."},{"date":"2022-07-20T16:33:04.380622Z","msg":"just wondering did you try the delag variable? it should help some."},{"date":"2022-07-20T16:32:23.160332Z","msg":"a.) Thanks! and what is servoCount?\n\nb.) Thanks! and close. It is for the Summer Standoffs by AquaGirl272. Too many competitions these days. lol"},{"date":"2022-07-20T16:29:12.816573Z","msg":"to sub to which one?"},{"date":"2022-07-20T14:44:15.616213Z","msg":"lol, that might hurt your computer's preformance for running 20,000 circles. XD"},{"date":"2022-07-20T14:41:04.272323Z","msg":"change i <= 10000 to i <= 2500 and fill(255, 8) to fill(255, 32)\n\nit should work better since I think currently i am laggin your computer out, working on a delag function. :D"},{"date":"2022-07-20T14:31:56.521849Z","msg":"huh, maybe reload the page? i dunno."},{"date":"2022-07-20T14:25:40.23013Z","msg":"oh, yah, Ferret ships can shoot too. :D"},{"date":"2022-07-20T14:19:03.719026Z","msg":"Agreed, Ferret enemies aren't usually easy.\n\nlol stay back and shoot the rocket and then use the corner of a block to beat it, also you have 5 lives so you can just boss your way through the first level. :)"},{"date":"2022-07-20T14:08:02.550142Z","msg":"oh that is why i can't go down.\nhmm . . . you must be left-handed of smth to figure that out."},{"date":"2022-07-20T14:04:16.999397Z","msg":"1) https://www.khanacademy.org/computer-programming/space-escape/6314914268889088\n2) Fer Fer\n3) Advanced"},{"date":"2022-07-20T14:00:44.987339Z","msg":"which one?"},{"date":"2022-07-20T14:00:29.909868Z","msg":"it has to do with the lerping of the rotation to the atan2 for the enemies. if the enemy is to th eleft of you there is a chance he will turn around start wiggling and infinitely go off to the left. do not know why this happens.\n\nyay you down voted! :)"},{"date":"2022-07-20T13:55:02.71016Z","msg":"hmm . . . NP stalks CA who talks to FF . . . too many two-letter acronyms. :("},{"date":"2022-07-19T22:55:49.177499Z","msg":"Ferrets aren't scary . . . unless you anger them. Thus the power of the ferret!\n\n#FerretsForever"},{"date":"2022-07-19T19:28:39.261894Z","msg":"uhh . . . you tell me, i wasn't here for this, lol."},{"date":"2022-07-19T18:39:28.692779Z","msg":"a.)\nIf this has the best wost-possible situation, does it have a decent best-possible situation?\n\nb.)\nIs it efficient when implemented into PJS? \n\nc.)\nThank you for the explanation! :D"},{"date":"2022-07-19T16:55:59.477561Z","msg":"lol, i was just going back through my top voted projects and noted that this project had more votes than i thought it did . . . I only remember responding to one person, and when there are votes there are comments, thus my discovery of this comment and the late reply. XD\n\nit isn't you should have seen how long it took the Non-Pirate to get back to ski and I after he was bannaned. :)"},{"date":"2022-07-19T12:55:42.891666Z","msg":"big oof that he couldn't get one with a pedometer. XD"},{"date":"2022-07-19T12:37:49.305923Z","msg":"yes how scandalous."},{"date":"2022-07-19T11:45:40.490542Z","msg":"you should read more American classics. lol"},{"date":"2022-07-19T00:07:42.135013Z","msg":"lol, its up to the judges, and i have to rush mine, big oof on my graphics game. XD"},{"date":"2022-07-19T00:04:09.40952Z","msg":"maybe Uncle Tom's Cabin?"},{"date":"2022-07-18T23:58:32.266403Z","msg":"lol are (see below) any better?\n`arc(x, y, w, h, 0, 360);`"},{"date":"2022-07-18T23:52:40.727448Z","msg":"uhh . . . wrong book ig? he eventually lives to see his freedom and starts to try to buy his family back out of slavery."},{"date":"2022-07-18T17:40:06.432084Z","msg":"subbed. :)"},{"date":"2022-07-18T12:11:24.085112Z","msg":"depending on what you want to do. On weekends, every vote counts more towards boosting your project up the hot list, since nobody is on. On Mon. and Tues. you are more likely to get more votes but less likely to get higher up on the HL.\n:)"},{"date":"2022-07-18T12:05:14.988297Z","msg":"not exactly, Jim is a slave so having never learned to read or write, so Mark Twains pens his word based off of sound not off of actual spelling e.g. (dem for them, purty for pretty, etc.)."},{"date":"2022-07-17T23:43:45.210407Z","msg":"nope it was for loops."},{"date":"2022-07-17T19:39:27.00832Z","msg":"Rest In Politics.\n\nmaybe not ig then."},{"date":"2022-07-16T23:20:43.601935Z","msg":"ouchie, sorry to dash your hopes.\n\nhuh, ski and i were looking into Blender for animations. maybe one day silverleaf12 will be making the next blockbusters."},{"date":"2022-07-16T23:19:18.5474Z","msg":"i mean after 2 years would think that someone would have commented. XD"},{"date":"2022-07-16T13:44:40.51159Z","msg":"how dare you think that the 'King Of The Stalkers' would not find this masterpeice before it had its publication date?\n\nyeah . . . maybe you could become a graphics designer for a large game?"},{"date":"2022-07-15T20:19:31.212828Z","msg":"yus, i have to create a project related to the universe by next Wednesday. :)"},{"date":"2022-07-15T16:55:34.108388Z","msg":"mtoivation for all! let's hope its enough for someone to finish this game. :D"},{"date":"2022-07-15T13:23:11.505817Z","msg":"ski said the exact same thing about the movie! XD\n\nhaha, you read _The Chronicles of Narnia_ too much, ig. I also like the _Screwtape Letters_ and have read one of three _Space Trilogy_ books.\n\nHuh, i did not know about the Inklings. I have an inkling that you are right. :P"},{"date":"2022-07-15T12:17:50.357098Z","msg":"Yes! I have a couple standardized tests, (thus me joining for week two), but if I am competing against a beginner I think that I can submit for week one. :)"},{"date":"2022-07-15T12:13:20.947624Z","msg":":( aw man, i no longer can stalk you i . . . f you don't do any work on WIPs.\n\n#QuotesFromTheAnonymousOrUnkownOrigins"},{"date":"2022-07-15T12:10:31.893178Z","msg":"they are trying to pose as Liam K. lol.\n\nkhanacademy.org/profile/kaid_69572033134146329094296"},{"date":"2022-07-14T22:56:59.13363Z","msg":"4 months later and work has yet to be done, perhaps the workers needed a lunch break . . . do you know what happened to them?"},{"date":"2022-07-14T22:48:47.893461Z","msg":"Maybe contacts will help? i dunno.\n\ntoo many acronyms, lol. i thought it had somethings to do with an atlas."},{"date":"2022-07-14T22:46:34.57154Z","msg":"Huh, my brother read the Inheritance Cycle, I started to too, but I got bored a third of the way through the first book. lol\n\nI would have to say that my favorite author C. S. Lewis, he had an amazing intellict and put forth ideas thay really make you think."},{"date":"2022-07-14T22:44:09.046381Z","msg":"yeah i did that for a reason."},{"date":"2022-07-14T16:52:29.569531Z","msg":"name: Fer Fer\nlangauges: PJS, and PJS in HTML\nspecialties: animations, logic, games, not graphics"},{"date":"2022-07-14T16:50:27.420882Z","msg":"huh, something tells me that LASIK wont get the job done . . .\n\n(by the way i do not know Toph nor ATLA, guessin' ATLA is a video game, am i right?)"},{"date":"2022-07-14T16:47:30.095116Z","msg":"yeah, but math has a nature to it that if you understand, you dont even really need the rules.\n\nI like reading too, just not reading comprehension. Always different ways to understand a text.\n\nlol, yes i hate Shakespeare too."},{"date":"2022-07-14T13:16:56.150008Z","msg":"lol, a lot of people say that, but math is set rules though. English is much harder imo."},{"date":"2022-07-13T20:44:11.947952Z","msg":"lol, i still hate French with all of its conjugations, and weird rules.\nAu revoir, mon ami!\n\nsorry for the late response, I was taking some tests."},{"date":"2022-07-13T14:43:37.198549Z","msg":"lol, i will. /)\n\nHonestly, German sounds a lot better than French or Spanish, but i don't know if my school allows me to take German this coming year . . .\n\nvotes on KA are weird, often a WIP or a trailer will get more votes than the finished project, or like you saw Season two getting more votes than Season one. O.o"},{"date":"2022-07-13T13:08:25.517718Z","msg":"color is deadly."},{"date":"2022-07-13T13:06:29.802867Z","msg":"a.)\ni condensed the code, so now it only takes up 10 lines. :)\n2.)\nwhat part do you not understand? i'd be happy to explain!"},{"date":"2022-07-13T00:03:20.190691Z","msg":"https://www.khanacademy.org/computer-programming/spin-off-of-clickers/4709790987632640\n\nlike this?"},{"date":"2022-07-12T23:58:50.883293Z","msg":"yeah, he is an impasta. >:( i dont like people trying to outsmart the great Numberian masterminds."},{"date":"2022-07-12T00:01:15.914679Z","msg":"yeah, and he did it again to 21262's after changing his projects, plaigarizin' 21262's and pretending he is 21262.\nD:<\n\ni want to rage."},{"date":"2022-07-11T14:50:57.048827Z","msg":"that is because of 'crappy PJS' (quote ski) that lags out whenever you use mask inside a draw loop. :)"},{"date":"2022-07-11T13:20:07.518288Z","msg":"that is simple, the light going over the flask simply is the same color as the background with an alpha value. thus its simply an optical illusion of color."},{"date":"2022-07-11T13:01:37.108277Z","msg":"a) there is, i'm just that lazy. plus i didnt use a for loop for the trees, i manually typed each one out just to be stubborn.\nf.) lol, i hate using get. don't ask."},{"date":"2022-07-11T12:59:35.538724Z","msg":"sure, i'd love to see the program! :)"},{"date":"2022-07-11T12:56:57.858997Z","msg":"thanks! x2"},{"date":"2022-07-11T12:56:50.731075Z","msg":"thanks! :)"},{"date":"2022-07-11T12:56:31.998985Z","msg":"pinapulz forever! :)"},{"date":"2022-07-11T12:56:18.727342Z","msg":"huh, maybe you should let them know that you already know all of statistics and probablity if you sing the little song:\n\n'Mode, mode, mode's the most, average is the mean! Median, median, median, median, always in between.'\n(to the tune of Row, Row, Row, Your Boat)"},{"date":"2022-07-09T14:11:34.068945Z","msg":"you didnt put it in the questions, reload the page and check the T&T. Its the new KA bug where if you click on a notification it pretends the comment was in the Questions tab.\n\n'There are no features, only bugs.'\n- IA"},{"date":"2022-07-09T14:04:24.523643Z","msg":"b.) aww man. almost, i almost had you! >:("},{"date":"2022-07-09T11:02:40.509109Z","msg":"lol, math isn't that hard, especially when you can program. :)\n\nSC? huh, i used to live in SC . . . the one thing that i will tell you is that if you came from a place with four seasons, there are only two in SC: hot and hottest."},{"date":"2022-07-09T10:58:48.613028Z","msg":"a.) yes, at least for now. :)\n\nb.) ouch, i should have come back sooner.\n\nc.) yes!\n\nd.) great! ski has this thing for coming in second to last place."},{"date":"2022-07-09T10:57:16.597545Z","msg":"b.) you should get the book sometime, you can buy it online at nile [dot] ff. If you do, dont worry if you rcomputer runs slowly for the next couple of days though . . . or if all your personal information seems to have been stolen. ;)\n\nc.)\nyou're just being humble, the graphic looks amazing without the BLUR."},{"date":"2022-07-09T10:53:02.717492Z","msg":"thanks! :)"},{"date":"2022-07-09T10:51:41.182166Z","msg":"lol, i think so . . . but they do have a tendency to be weasely . . .\n\nthanks, :)! x2"},{"date":"2022-07-09T00:06:31.102382Z","msg":"*poke, poke*\npray tell me good fake ski. where did you put the real ski? ski doesnt give compliments especially not to Fer Fer. It is blasphemous to even think up such a scheme in his mind. Try better next time, oh false one."},{"date":"2022-07-09T00:02:52.393203Z","msg":"like this one lol."},{"date":"2022-07-08T23:56:20.762342Z","msg":"you know what else is deadly? faces, man. people these days go around wearing masks to cover up their face. dont give the guy a face, dude."},{"date":"2022-07-08T20:29:34.447306Z","msg":"a.) D:<\n\nb.) smh those hippos are up to no good\n\nc.) actually it was pretty bad.\n\n\nSoon enough and KA will be down on their knees beggin for ski to make the coding courses."},{"date":"2022-07-08T20:20:15.101306Z","msg":"a.) D:\n\nb.)\nhmm, never mind wasn't the weasels, i misinterepted their message. it was the hippos. _shrug_\n\nc.)\ni was making a pun off of credit, as in credit card. the more credit you use the more you have to pay back later when you get your credit card bill.\n\n. . . ski needs to stop being a genius."},{"date":"2022-07-08T19:23:49.75867Z","msg":"a.) :(\n\nb.)\nsmh they did\n\nc.)\nI need to preview my comments before I input them. I edited it so it makes logical sense to some extent. If you still dont get it, never mind.\n\n'Humor is like code, if you have to explain it, it's bad.'\n- ski"},{"date":"2022-07-08T19:20:16.755288Z","msg":"a.)\nnice work!\n\nb.)\ni guessed as much afterwards lol. nobody will care anymore, since that happened who knows how many years ago. :)\n\nb.) lol I guessed as much afterwards when ski gave me his reasoning.\n\nAu revoir!\n\n(Are you learning a language? I am learning French currently . . . not my favorite)"},{"date":"2022-07-08T19:06:58.070144Z","msg":"a.) you edited that afterwards didnt't you?\n\nb.)\ni gotta go check on dem weasels.\n\nhuh, you must be broke. i hear that the more credit you use, the more you have to pay to the banks when you get the credit card bill. Thus I have as few people help me as possible.\n\n(not true, and that was a horrible joke)"},{"date":"2022-07-08T19:04:12.258591Z","msg":"ouch. no wonder the captain was paranoid about mutinies.\n\nnice! as stated above i dont have patience enough to write even three page, so writing eighty pages must take a lot of effort!"},{"date":"2022-07-08T18:55:12.497212Z","msg":"i can imagine the ending being where the young man finally makes his get away while the creqmates are recovering from a bunch of well-placed banana peels. XD"},{"date":"2022-07-08T18:52:49.0419Z","msg":"a.)\nlol, i gotta use that one on him\n\nb.)\nit was truly tragic . . . but now other people cant comment i have nothing to do with it . . . wonder if a weasel is messing with them lol.\n\nno credit needed, all i did was add a bunch of + signs and a couple of chars."},{"date":"2022-07-08T18:38:55.972294Z","msg":"yes, but not exactly fancy text, they mainly kept it at Calibri or something similar, and added special CSS features for example parralaxes, special buttons, etc."},{"date":"2022-07-08T18:28:55.03721Z","msg":"sure!\nlol, html is nice, if you do, i'd suggest doing something like Reader Writer Penguin did . . . cant seem to find their profile, but they had a neat way of using CSS to make their stories look professional. :)"},{"date":"2022-07-08T18:21:07.411351Z","msg":"a.)\nno, rocket fist is permenantly inactive, M. Murray  only pops in from time to time, and the rest are inactive, save me and ski.\n\nb.)\nnot much, mainly coding and school. an author is an interesting job, i just never have the patience to write more than a page and a half per chapter lol.\n\nc.)\nthanks!"},{"date":"2022-07-08T17:50:25.243428Z","msg":"well the next Da Vinci will be talented in all kinds of laziness, from just procrastinating to excuse making!"},{"date":"2022-07-08T17:43:20.146543Z","msg":"a.) lol, the answer to your second question is i wanted to know who looked through my code, if anybody."},{"date":"2022-07-08T17:38:34.844028Z","msg":"thanks!\n\na.) why are you going through my messy code?\n\nb.) the real question is why not?"},{"date":"2022-07-08T17:36:37.146805Z","msg":"#Yeh\n\n*mind\n\nlol, i dont have patience. i am lazy. thus my poor drawing skills . . . and my consistence in getting a decent start to a game and finishing terribly."},{"date":"2022-07-08T17:34:31.018264Z","msg":"thanks! x2"},{"date":"2022-07-08T17:33:52.203328Z","msg":"lol, both of us have improved a lot, i mainly have improved in making animations and games, while he has become a legend at all three languages that KA offers, and is currently learning Python and C++. today he goes by the name of ski.\n\nteams actually lost traction a little after you left, currently the rage is contests, e.g. Clash of Code that ended in May, Primavera that ended a couple weeks ago, The Coding Olympics and The Coder's Cup that are currently going on. Those are the bigger of the contests going on, there are also many logo and smaller contests that take place. Teams have been replaced by a temporary team that try to win competitions, thus the disappearence of them. Also, the surviving teams break apart easily because of in-fighting or inactivity. The latter of which has recently been affecting the contests."},{"date":"2022-07-08T17:18:48.432154Z","msg":"#YayForFinland\n\nwhen they do ming lending them to me? right now the best thing i can draw is a stick man. :("},{"date":"2022-07-08T16:56:43.822752Z","msg":"yep, created most of it today. lesson learned graphics currently are not my forte."},{"date":"2022-07-08T16:53:18.29981Z","msg":"#FinlandMemesForTheWin!\nXD\n\nyup, i mean that 'lonely soul' you created crushes this any day."},{"date":"2022-07-08T16:09:38.692313Z","msg":"thanks!\n\nwhat the flippin' heck, when did you come back? the last time you were on was years ago. lol"},{"date":"2022-07-08T15:18:08.11238Z","msg":"a.) agreed, but i gave up\nb.) workin' on that\nc.) no animation for me remember?\nd.) to some extent there is\ne.) see c.)\nf.) if you think i can do that then you are agreeing that 3 duck kings rule over lollipop land."},{"date":"2022-07-08T13:49:26.786678Z","msg":"I am not the contest creator, but I think that you can. The reason being is that any entry to the contest does not _need_ to fit the theme, thus I do not think the contest creators will throw a fit over you making a simulation/interactive program that might not fit most defenitions of the theme."},{"date":"2022-07-08T13:43:53.246685Z","msg":"ill try not to, but the monster of inactivity is bretty big and scary . . ."},{"date":"2022-07-08T00:04:43.413918Z","msg":"ah, well then your miindset can be wrong.\n\ntotal arrogance go brrrrrrr"},{"date":"2022-07-08T00:00:58.249151Z","msg":"father's day has already come and gone. >:("},{"date":"2022-07-07T17:54:46.689396Z","msg":":(\n\nhow 'bout a bungee jumping game? where the higher you sling yourself on the way back up the more coins you earn for power-ups and customizable suits."},{"date":"2022-07-07T17:52:53.493698Z","msg":"a.)\nas ski would say \n'you can be wrong.' \n- ski every single day of my life\n\nb.)\nDrained is much worse imo. no bias was present in that statement.\n\nouch and if i could have undone the damage i might have. \n\none lined it. :)\nrect(40 + noStroke + fill(89, 161, 84) + rect(40, 110, 100, 200), 200, fill(255, 0, 0) + rect(240, 110, 100, 200), fill(255, 255, 255) + rect(140, 110, 100, 200));"},{"date":"2022-07-07T17:46:34.770402Z","msg":"ouch, worse than that ski got the same bug but he found a fix that works for him and guess what. `requestAnimationFrame()` is the problem. bigger ouchie. working on a graphic since i cant work on a game.\n\nouch. looks like KA needs a doctor. or more realistically a DR. puns go brr."},{"date":"2022-07-07T17:37:29.510997Z","msg":"i dared because it is true. is it not? or is because you got lazy? if it is the latter i will redact everything i said, for laziness is a glorious cause.\n\nif i did partake in any such activity i was unaware.*\n\n* - unaware as in unaware of limiting your commenting abilities for such a short amount of time."},{"date":"2022-07-07T17:33:26.726221Z","msg":"lol, nvm you didnt get it i was referring to a strange bug with my computer that i forgot you didnt know about. (basically it makes impossible to use the draw function)\n\nig . . . but it should do something productive."},{"date":"2022-07-07T16:44:25.295419Z","msg":"xD feels like a typo where your finger hit the shift button too late.\n\n\n\n*secretly cackles and considers pressing the button randomly day forcing you to comment only at times when i allow you to thus forcing upon you the annoyance of it happening again*\n\n. . . i did not partake in any activities that may have caused you to lose your commenting abilities so dont blame it on me.\n\n_note the key word is may have caused this does not include any activities that *did* cause you to lose your commenting abilities_"},{"date":"2022-07-07T16:02:48.437859Z","msg":"O.o (which way is better? o.O or O.o)\n\n*secretly has a button that allow you to comment*\noh uh yeah, that is good."},{"date":"2022-07-07T14:58:32.261178Z","msg":". . . i actually kinda think it would be both hilarious and ironic to see that one in there, plus i already positioned it so it needs no adjusting. XD\n\nwelcome!"},{"date":"2022-07-07T13:32:20.172602Z","msg":"ig its a lot shorter than fer fer though smh."},{"date":"2022-07-07T13:25:12.187568Z","msg":"doing fine, its sad when you cant animate anything on KA . . . and when the projects of a guy 22 days dead get two votes out of thin air.\n\nthanks!"},{"date":"2022-07-07T12:46:39.575314Z","msg":"as always."},{"date":"2022-07-07T12:46:16.365335Z","msg":"my name has changed to bruh ig."},{"date":"2022-07-06T16:55:10.024936Z","msg":"plants are eaten by animals. polar bears are animals. polar bears live in cold areas. mountain tops are cold. ski resorts are on mountains. skis are in ski resorts (duh). ski made this."},{"date":"2022-07-06T16:44:52.718016Z","msg":"welcome! . . . and sorry for the late response."},{"date":"2022-07-06T16:44:27.108287Z","msg":"wha? its quite simple, you utilize the text command to run the specified code and the move the text off screen so nobody had to see all the 'undefined's. quite simple. :)"},{"date":"2022-07-06T16:43:18.035005Z","msg":"huh, ski had trouble with that a while ago, NP had some solutions, i forgot what they were though . .  ."},{"date":"2022-07-06T14:49:47.75179Z","msg":"wah? just wonderin'"},{"date":"2022-07-06T13:16:29.069033Z","msg":"basically every time you restart the program x is increased by 1.\n\nto the computer it says, if x is a variable add 1 to whatever it was before, else set it to 0 cuz this is the first time running the program."},{"date":"2022-07-06T13:15:31.816852Z","msg":"and he replies 22 days late cuz inactivity is gettin the best of him. :("},{"date":"2022-06-14T20:39:10.222674Z","msg":". . . we shall see."},{"date":"2022-06-14T16:36:52.731178Z","msg":"lol yep. :)"},{"date":"2022-06-14T16:36:44.338181Z","msg":"that is why we trust the ferret and call it quits."},{"date":"2022-06-09T14:41:17.873198Z","msg":"lol, timothy asks if he should release something, but i went inactive so i couldnt respond. release anytime you like, ill be sure to check it out. :)"},{"date":"2022-06-02T12:35:40.533205Z","msg":"huh, good idea! ill be working on a forest for the background. :)"},{"date":"2022-06-01T17:25:54.653431Z","msg":"please. i came to try to stop people from getting bananned for absolutely no reason, save a misunderstanding. if you may beans i would suggest not trying to provoke anybody with all caps, not trying to (even though it may have been unintended) insult people, and not making comments about the topic, posts are solely to be made about coding. i would suggest that you delete your posts, along with everybody else in this thread, KA has few enough users as it is, i dont see a point in people getting bananned because of a misunderstanding.. :)"},{"date":"2022-06-01T17:19:28.382851Z","msg":"i am not saying that i agree, i am merely saying those are the rules, and you might want to delete you comments to keep from getting bananned. :)"},{"date":"2022-06-01T15:32:29.071271Z","msg":"lol, i forgot i was part of that . . . i would be glad to help, but i have this one small problem. i can't code any PJS or HTML project that has animation. it is some weird bug that popped up 2 days ago. :("},{"date":"2022-06-01T15:21:08.513137Z","msg":"the technical issues started yesterday, so i couldnt even start. :("},{"date":"2022-06-01T15:07:38.69076Z","msg":"huh, will have to stalk that. :)"},{"date":"2022-06-01T15:03:36.632986Z","msg":"my computer has come down with a strange ailment where it cant run any program with animation except for a couple exceptions, so i can no longer code, except for graphics . . . :("},{"date":"2022-06-01T10:17:01.768819Z","msg":"tellin' me. xD\n\nwhat is this for?"},{"date":"2022-05-31T18:31:19.444514Z","msg":"lol electric dolphin's 'platformer thingy' doesn't have the best collisions, plus why use a template when i can make my own?\n\nwhy do i have a feeling you are going through my projects lol? :)"},{"date":"2022-05-31T18:21:39.448319Z","msg":"thanks! :)\na.) lol, jmtyk ftw!\nb.) yup."},{"date":"2022-05-31T18:20:39.513819Z","msg":"ik where, you just got to pay up. $500 min."},{"date":"2022-05-31T13:35:28.781847Z","msg":"lol, working while i am gone go brr.\n\na.) we need a new thread\nb.) where am i needed?"},{"date":"2022-05-31T12:24:02.249042Z","msg":"lol, the term stalker on KA usually refers to somebody who tries to find the WIPs and unfinished projects of others. unlike the actual term stalkers, i dont follow them around, i merely post my thoughts on a project, that isnt complete yet. :)"},{"date":"2022-05-31T12:21:38.0677Z","msg":"huh, the insults are interesting"},{"date":"2022-05-31T12:21:09.685968Z","msg":"how do you misspell misspelling so badly, o.o."},{"date":"2022-05-30T10:38:20.658806Z","msg":"ah, made one. :)"},{"date":"2022-05-30T10:26:17.324309Z","msg":"a.) could you make the zombie be facing the same way his body is? :)\nb.)  no, more like a gun graphic. ;)"},{"date":"2022-05-29T11:02:36.056612Z","msg":"idc at all."},{"date":"2022-05-29T10:59:47.017927Z","msg":"yay! we need you on mountaintop, btw ski is back, :D!"},{"date":"2022-05-28T11:06:32.650265Z","msg":"huh. sure!\nski challenged me to make a newspaper (he will be making one too) as a sort of contest.\nwill it be in HTML or PJS? i can make a decent newpaper in PJS, but have very limited experience with HTML."},{"date":"2022-05-27T20:09:31.409419Z","msg":"b.)\nski just sent me a message contradicting what he said before. he cant get his facts straight. smh."},{"date":"2022-05-27T20:01:24.01041Z","msg":"a.) yah, comments were never my forte. \n\nb.)\nski said that isnt how PJS runs, so when he gets back might want to ask him about that, ill implement it anyways though. :)"},{"date":"2022-05-27T19:52:36.254173Z","msg":"i find my ways . . . i definitely wont be as active, i might even go inactive, but ill try. =)"},{"date":"2022-05-27T19:42:22.622118Z","msg":"sad that ski might go inactive before next fall . . ."},{"date":"2022-05-27T19:33:28.035976Z","msg":"for(var months_for_DR_to_be_on = time_on.length - 1; months_for_DR_to_be_on >= 0; months_for_DR_to_be_on --){\nif(months_for_DR_to_be_on < 2){\nmonths_for_DR_to_be_on = 1000000;\n}\n}"},{"date":"2022-05-27T19:28:16.426041Z","msg":"well i am a ferret, and a stalker i mean how much sneaky could you get?"},{"date":"2022-05-27T19:24:33.935731Z","msg":"tellin' me. more than once i have logged into his account in order to get a little bit of his knowledge. lol"},{"date":"2022-05-27T19:14:49.489444Z","msg":"ingenious, but imo ski has better images."},{"date":"2022-05-27T19:00:33.811976Z","msg":"yeah, i just figured that out lol am using the html picker to get some images. :P"},{"date":"2022-05-27T17:51:15.121803Z","msg":"added!\nbtw next time you should probably put this in the T&T. ;)"},{"date":"2022-05-27T17:12:20.280682Z","msg":"nice to see you!\ni see CA already responded. XD"},{"date":"2022-05-27T17:07:39.312167Z","msg":"long story short i finally got part d's code to work, it had to do with something else i changed while working on it. lol\n\nhttps://www.khanacademy.org/computer-programming/spin-off-of-zombies/5793668804427776"},{"date":"2022-05-27T16:53:15.931288Z","msg":"the enemies. here is what i copied and pasted from a post i sent to jake k. before i realized i had already told him about it.\n\nb.) this is the current missile collisions\nnot all enemies are the same size so the `<50` doesn't work\n\ndist(enemies[i].x, enemies[i].y, this.x, this.y) < 50 && this.type === 'missile'\n\nc.) we need to add size attributes to every object for the projectiles in the projectiles stats.\n\nd.) when i add that i get this piece of code that breaks the game\n\ndist(enemies[i].x, enemies[i].y, this.x, this.y) < (this.size / 2) + (enemies[i].size / 2) && this.type === 'missile'"},{"date":"2022-05-27T13:03:39.240055Z","msg":"a.) we need to work on collisions for the missiles. i tried to make better collisions but they didn't work out. :("},{"date":"2022-05-27T12:19:32.617218Z","msg":"good point, thanks! :)"},{"date":"2022-05-27T11:24:00.503115Z","msg":". . . we all have different ways of thinking ig.\n\nhe is probably going to get unb@nn3d over the weekend if we are lucky. he has already submitted the form, so it is up to the Gaurdians to decide when he gets free."},{"date":"2022-05-26T20:03:09.485593Z","msg":"well . . . do you refer to your brain as a she? i refer to my body parts as its because they are all very expendable. it reminds them to stay in order in case they try to rebel.\n\nouch. ski getting roasted while he is gone."},{"date":"2022-05-26T19:56:53.482344Z","msg":"you think i am bad? honestly i dont care that much, ill notice it but i wont care. imma just trying to save you from ski when he gets back. ski  has this thing for perfection . . .\n\nmy brain thought it was trying to type horrible and then mix in horrified? idk.\n\nThe crickets themselves shout their praises for your comical skills. \n*Badabing*..._joke intended_\n(come on, you can do better than that)"},{"date":"2022-05-26T19:52:23.015622Z","msg":"your boredom -> lack of content for stalkers -> my boredom -> divine intervention -> me actually working on a project"},{"date":"2022-05-26T19:49:02.931819Z","msg":"ik, i was working on a fix when i gave up and just made the balls spawn at a rate 5x faster than before."},{"date":"2022-05-26T19:47:17.149909Z","msg":"but-bu-b \n*sigh* \n>=( apocalypse here we come."},{"date":"2022-05-26T19:46:01.479013Z","msg":">:( that is bugging me.\n\nfun fact:\nthe person that created that is not only ski's mentor, but is horried at graphics, if you look in the code the creator never did anything complex when it comes to graphics. he made it using math. good ol' NP"},{"date":"2022-05-26T19:40:52.763924Z","msg":"Revelation kind of apocalypse. the kind with all the weird beasts, numbers, dreams, and . . . you get the point"},{"date":"2022-05-26T19:36:41.634294Z","msg":"your boredom -> lack of content for stalkers -> my boredom -> me going inactive -> apocalypse\n\nyou dont want the apocalypse now do you?"},{"date":"2022-05-26T19:34:08.314243Z","msg":"you misspelled it. its should be asoutriv instead of asourtirv. :)\nhow about something like this?\nhttps://www.khanacademy.org/computer-programming/forest-background/6422450097143808"},{"date":"2022-05-26T19:30:17.250562Z","msg":"you have a way to make me laugh uncontrollably. congratulations gifted one.\n\nthanks!"}],"QUESTION":[{"date":"2022-09-15T13:53:01.177454Z","msg":"I only see 1 message, can you get multiple threads to show?\n\nAnd also, it would be nice to see my own text up on the screen. :D"},{"date":"2022-07-26T16:12:49.597552Z","msg":"Not related to this program, but I have a question.\n\nI have a method that converts integer strings to binary and binary strings to integer. It works for smaller numbers, 1, 7, 100, 1000, etc. However I need the convertors to work for larger numbers (see the second number in the println), and it does not work for numbers beyond a certain point, because part of the number is lost in one or both of the convertors (note the end of the first and third numbers in the println). Can you explain what is going on, and if you know a way to fix the problem?\n\nhttps://www.khanacademy.org/computer-programming/bin-int-int-bin/6186012072525824"},{"date":"2022-07-20T20:30:58.061068Z","msg":"'The main concept that makes this work is that you have several sticks that connect points. Sticks have a length, and if the points that it connects are too far apart, bring them closer. If they are too close, push them further way from each other.'\n\nsomething like this?\n\nhttps://www.khanacademy.org/computer-programming/new-program/5798951157022720"},{"date":"2022-07-19T12:28:59.702218Z","msg":"so what exactly does it do?"},{"date":"2022-05-23T19:11:35.607295Z","msg":"is my wheel supposed to pop off?"},{"date":"2022-04-04T14:09:06.039397Z","msg":"you said you wanted me to help you with something? =D"},{"date":"2022-04-02T10:11:08.407218Z","msg":"What happened to the 'Programming Is Magical' project?"},{"date":"2022-03-02T17:56:33.894855Z","msg":"Why is it that Google Fonts are not allowed in PJS, but are in HTML?"},{"date":"2022-02-17T20:14:24.444757Z","msg":"`\n<script>\n    (function (){\n        //ES6+ script here\n    })()\n    //or (i'll explain this later in lesson 4)\n    (() => {\n        //ES6+ script here\n    })()\n</script>`\n\nThis is how a friend of mine does it, what is the difference?\n\n(just gonna pretend like nothin happened)"},{"date":"2021-11-22T18:32:47.997993Z","msg":"Neat hyperlinks! I like the colors you put into it, very appealing. I liked the veteran's day one, but couldn't comment. By the way, I was just talking to someone else on this, emojis and text images are usually seen as low quality as they are simply getting a picture from a store of characters. They are also not compatible across different computers, so say somebody looking at with a Chromebook would see it differently than somebody with a Macbook. ;)"},{"date":"2021-11-08T11:06:59.223646Z","msg":"Two bugs/issues:\n1: The tracks when the cube goes forward are the same as going backward.\n2: The map does something weird when you get reset. If you don't know how to fix it easily then you could make another screen go over it. (The screen thing might be on purpose).\n\nOverall great project! I will wait patiently for the final product. :)"},{"date":"2019-03-25T14:02:18.564213Z","msg":"Canyon make a glass version of this?"},{"date":"2019-01-28T16:11:58.512168Z","msg":"I have a problem o cannot figure out how to make collisions happen in this program could somebody make a spin-off and then put a comment saying new code type the code that makes the collisions happen.\n\n\nhttps://www.khanacademy.org/computer-programming/keys/4754311254278144"}],"COMMENT":[{"date":"2023-02-10T11:47:55.612835Z","msg":"I adjusted the key interactions in a spin-off that way you can move to the left or right underwater without being forced to go back up."},{"date":"2023-02-07T00:45:28.93444Z","msg":"Is this where you will be working?\n\na.) is there a way to get what a user enters into a text box?\n\nb.) should we making this game relying on outside PJS-like libraries or just in JS?\n\nc.) how do you get scripts to work with the HTML? e.g. getting a variable to show up on the screen as part of a header or paragraph text.\n\nIf we can get these 3 things figured out we should be good for all the basics."},{"date":"2023-01-31T00:55:31.448335Z","msg":"Good news to all the programmers on Khan Academy,\n\nI honestly do not care the past two weeks of work I put in are being shamed. The Hot List is back.\n\nLet's gooooooooo!"},{"date":"2023-01-31T00:52:29.542471Z","msg":"As always another stellar graphic . . . but maybe not as good as SMV's. jk jk :P"},{"date":"2023-01-30T02:16:01.968885Z","msg":"Fun fact:\n\nski would not be @thelegendski if it wasn't for the Non-Pirate.\n\n#NPForTheWin"},{"date":"2023-01-27T02:15:35.146876Z","msg":"@bioQueenOfNicknames:\n\nlol I used to be King O' Stalkers. still somewhat am, old habits die hard."},{"date":"2023-01-20T00:31:37.719753Z","msg":"*still stalking*"},{"date":"2023-01-19T21:29:23.736464Z","msg":"There appears to be a bug on the Rank page . . . Team Ninja instead of Team Henry is first. :P\n\nNeat webpage! Did you come up with the typing title idea or did ski give you the idea? (just wondering since ski did the typing title in Primavera)"},{"date":"2023-01-19T00:47:15.542422Z","msg":"Make that 4. :P"},{"date":"2023-01-14T23:32:30.922736Z","msg":"Whenever you're available if you could make your way to the Team Henry chat thread on the COC home page that would be great!"},{"date":"2023-01-12T11:50:09.293021Z","msg":"Neat! By the way you don't have to keep making seperate variables if you use objects e.g.\n``````````\n    var candleX1 = 244;\n    var candleY1 = 142;\n    var candleX2 = 272;\n    var candleY2 = 162;\n    var candleX3 = 300;\n    var candleY3 = 142;\n\n`````````\nbecomes\n`````````\nvar candle = {\n    left: {\n      x: 244,\n      y: 244,\n    },\n    middle: {\n    x: 272,\n    y: 162\n    },\n    right:{\n    x: 300,\n    y: 142\n    },\n};\n\nthen you can call the variables like this.\n\ncandles.left.x\n`````````\n\nHope this helps you! :D"},{"date":"2023-01-09T23:25:57.815952Z","msg":"this made my day. thank you SMV. XD XD XD XD"},{"date":"2023-01-09T21:13:17.28394Z","msg":"Encore!"},{"date":"2023-01-04T12:02:59.568541Z","msg":"@15:\n\nNice! >:)\n\nthumbnail.js is everywhere now, what if ski put a little hacky code and could control every project with thumbnail.js? you never know."},{"date":"2022-12-28T14:50:59.506793Z","msg":"???!"},{"date":"2022-12-15T00:39:37.980615Z","msg":"No, that was not an empty threat, I merely had to refuse the urge to response because if I did I would, at a minimum, be publicly humiliated in front of all Ferrets. Do not worry, within a fortnight you will find yourself in a rather . . . _sticky_ situation."},{"date":"2022-12-13T02:14:05.705719Z","msg":"imho whoever has Astro will win."},{"date":"2022-12-13T02:12:02.768718Z","msg":"@hehehe:\nActually decent, Africa is going to be overthrown in a couple of days, Europe is going to be taken over starting with Britain a couple hours after that, and then Russia will be taken. In America (on December 21), ferrets will slimply claim discrimination, call a new election, elect me president, and then do away with the Constitution by force. :D My Plan will be finished off with the taking of Tuvalu at 23:15 on December 23. Then Ferrets get off Christmas Eve and Day while Weasels and Beavers will protect us from any attacks akin to that of George Washington's crossing of the Delaware River on Christmas Day. :D"},{"date":"2022-12-10T17:39:30.444627Z","msg":"you can bug it out if in an open space you go backwards long enough. lol"},{"date":"2022-12-05T14:50:41.845222Z","msg":"*makes smores*\n\nsorry bro."},{"date":"2022-11-30T00:15:10.919095Z","msg":"5309291531124736 :d"},{"date":"2022-11-29T14:58:24.995527Z","msg":"\"another one down, mwahahhaha\"\n\n- Ferret planning on taking over the world who is definitely not me"},{"date":"2022-11-18T13:09:12.550617Z","msg":"still here! somewhat . . ."},{"date":"2022-11-14T13:51:51.44823Z","msg":"i have been trying to make noise for a year now, and somehow i doubt you took a year on this program . . . *beginning to question life*"},{"date":"2022-11-10T15:08:29.605151Z","msg":"https://www.khanacademy.org/computer-programming/75-things-you-dont-need-to-know/4860059000766464\n\nCavan P. one-upped you."},{"date":"2022-11-03T12:07:14.03677Z","msg":"\"will be my name forever on Khan\"\n\n- Cooke's\n\n#BestLieOf2022"},{"date":"2022-11-01T20:27:47.842155Z","msg":"Wish i could have helped more on this.\n\nin that case i wish i was also more active on KA"},{"date":"2022-10-18T20:39:01.206855Z","msg":"my comp just gives me an error . . . huh"},{"date":"2022-10-17T01:19:16.682985Z","msg":". . . and i wish i could say that after all your other graphics i am not surprised . . .\n\nunique style + efficiency + unlimited graphics capability = S. M. V."},{"date":"2022-10-14T22:58:01.560695Z","msg":"please effectively and immediately delete this program, to comply with the guidelines, or at least comply with the creator's, Dominic R., standards."},{"date":"2022-10-13T15:05:53.905489Z","msg":"click bait lol, I can make _any_ game one line of code."},{"date":"2022-10-12T23:23:56.013577Z","msg":"and what do members get in return for doing this?"},{"date":"2022-10-11T21:02:14.153115Z","msg":"It appears it only happens for the user e.g. I can still see your comments as if they are normal, but it says 'DELETED' to you. O.o"},{"date":"2022-10-10T10:36:32.874534Z","msg":"*gasp*\nyou used `this.externals.context` . . . how dare you! FIEND!"},{"date":"2022-10-08T00:20:36.770048Z","msg":"a.) why are you so active all of the sudden?\n\nb.) you haven't made any projects. ;-;\n\nc.) lol, you got caught up in one of the unknown programmer vs. ski arguments."},{"date":"2022-10-06T20:28:38.537645Z","msg":"Haha, you almost had me."},{"date":"2022-10-05T13:18:10.787164Z","msg":"I got 41x faster. O.o"},{"date":"2022-10-05T12:49:44.742892Z","msg":"ahhhh, it is so relaxing to get the Lord O' Stalkers part of me back out."},{"date":"2022-09-28T14:10:20.347883Z","msg":"I'll take Tuesday. :)"},{"date":"2022-09-28T14:09:32.960345Z","msg":"have fun!"},{"date":"2022-09-27T13:51:07.941895Z","msg":"lol, I was just about to post on one of your programs. What do you want to do?"},{"date":"2022-09-22T14:20:41.372279Z","msg":"You still around?"},{"date":"2022-09-22T13:58:30.34007Z","msg":"5734303415189504\n\nlemon's ready."},{"date":"2022-09-22T13:54:17.258194Z","msg":"I know you."},{"date":"2022-09-21T12:18:32.23888Z","msg":"We also have a big issue with people making programs like this that collect votes because of content not because they can code. Please put effort into this program, it has a good message, but it is so dead simple, I dare say it does not deserve the amount of votes it has."},{"date":"2022-09-19T14:15:59.636624Z","msg":"this is funny, completed flashy mission."},{"date":"2022-09-13T14:04:26.850494Z","msg":"as always done! XD"},{"date":"2022-09-08T21:14:14.833541Z","msg":"a.) '. . . and the winner for Most And Best High Quality Graphics Of The Year Award goes to S. M. V.'\n\nb.) how on Earth did you get the comment problem fixed. O.o"},{"date":"2022-09-05T11:06:24.747691Z","msg":"I think so . . ."},{"date":"2022-09-05T11:03:29.038282Z","msg":"That _is_ a shooting star."},{"date":"2022-08-30T21:33:11.597387Z","msg":"yay I won!\n\nHope you have a bright future ahead of you with your talents and skills."},{"date":"2022-08-24T20:03:42.927825Z","msg":"this is ski, :p."},{"date":"2022-08-23T11:39:35.646212Z","msg":"imma guessing that you aren't making any programs while CoraL is gone."},{"date":"2022-08-19T10:18:25.933047Z","msg":"Ouch the new KA bug will really hurt you. You may have to make a thread where all participants post thier entries for one major reason:\n\nA(nother) new KA bug has been experienced where all spin-offs of webpages become pjs projects in the KA API meaning that it is no longer a webpage and now a program. However you _can_ create a new webpage and then copy/paste the code there, _but_ it is no longer a spin-off of the original project. You will not be able to win. Yokie Bob has a support ticket in the help center, so hopefully some dev can get to work on it. :("},{"date":"2022-08-18T16:42:29.487946Z","msg":"you spell the word grey like a Brit. XD\n\nthe detail you put into this is amazing. :)"},{"date":"2022-08-18T11:57:57.579013Z","msg":"I'll still be here when you come back. lol\n\nFerrets never die."},{"date":"2022-08-17T23:43:59.661089Z","msg":"the dancing bacon i must say is my favorite part, but man that background just hits the spot. XD"},{"date":"2022-08-16T13:36:51.19604Z","msg":"a.) posted here to avoid spamming Multiverse\n\nb.) I am having trouble with my notifs not showing up for some reason. So it might take me a while ot respond.\n\nc.) I have been doing some coding, mainly making a shooter game in HTML, ski made `ski.js` which makes it easy for someone who know PJS to code a game in HTML.\n\nd.) I've been doing fine, though the school year starts for me soon, so my activity will be reduced once it starts. :)\n\ne.) Have you made headway on that book you were writing?"},{"date":"2022-08-15T16:35:22.406123Z","msg":"Cowboys fan actually posted something. lol\n\n. . . seems vaguely . . . familiar."},{"date":"2022-08-12T23:06:58.394036Z","msg":"'(my best game yet!)'\n\nAgreed. ;)"},{"date":"2022-08-11T18:46:49.883736Z","msg":"*sigh*\nand someone goes inactive for a month. smh\n\n(lowercasing the first letter in your name is so fun)"},{"date":"2022-08-11T18:28:19.951163Z","msg":"Huh, interesting."},{"date":"2022-08-11T17:18:42.427435Z","msg":"so that is what this became. :D"},{"date":"2022-08-11T13:28:45.005894Z","msg":"I just realized that you can cheat by contantly going in reverse, thus using absolutely no fuel. XD"},{"date":"2022-08-11T10:56:57.38722Z","msg":"Huh, after I played for a while I started spawing outside the perimeter wall."},{"date":"2022-08-10T18:57:26.625379Z","msg":"https://www.khanacademy.org/computer-programming/new-program/5381831329890304\n\ndone after a couple hours. A program that uses slope, *NOT* trig, to find if two lines are colliding and where they are. :)"},{"date":"2022-08-10T17:33:03.901162Z","msg":">100 lines of variables. lol"},{"date":"2022-08-10T17:04:09.09521Z","msg":"(posted here to not spam SupeNova)\n\nlol, i am sorry if you think the way i conducted myself is rude. I was just bored, since the project I am currently working does not hold my interest, so I went ahead and made the buttons."},{"date":"2022-08-10T16:53:06.388174Z","msg":"and the King of Stalkers returns! :)"},{"date":"2022-08-10T11:07:42.519556Z","msg":"huh, this is interesting."},{"date":"2022-08-10T10:29:49.788021Z","msg":"unanimated buttons that don't go anywhere annoy me. do you want me to make you some?"},{"date":"2022-08-10T10:27:01.40405Z","msg":"imma guessing you made this a while ago on a child account and you are re-releasing it. the dates on the log give it away. ;)"},{"date":"2022-08-08T22:50:23.895057Z","msg":"amazing!"},{"date":"2022-08-08T22:49:14.980126Z","msg":"dat Tom, better watch himself. i have poison testers for a reason. XD\n\nGood thing the Weasels came too, and the Beavers. :D\n\n#FerretsAlwaysPrevail"},{"date":"2022-08-08T13:12:54.409707Z","msg":"lol, the shop lies. you always have 0 clicks and 1 click per second."},{"date":"2022-08-08T12:07:20.743128Z","msg":"what is up with the activity levels lately. O.o"},{"date":"2022-08-06T11:03:53.558256Z","msg":"Tom is quite the grumpy mouse."},{"date":"2022-08-05T23:24:22.163486Z","msg":"also, you can switch out your current:\n'throw ();'\nwith\n'throw: {};'\nin order to get rid of the '<span class = 'text'>' before and after the message! :D"},{"date":"2022-08-05T23:22:10.110955Z","msg":"https://www.khanacademy.org/computer-programming/spin-off-of-diagonal-gradient-function/5519320153636864\n\nI made it responsive to all square screens. :D"},{"date":"2022-08-05T23:16:45.028011Z","msg":"Neat! In my opinion the Projects page, could use a background/paralax. :)"},{"date":"2022-08-05T23:14:36.943115Z","msg":"a.) huh, another programmer, marci, had similar technical difficulties. in order to get around it they used a program made by ski (my brother), that allows KA users to chat without the need for posting. he deleted the program though, i'll ask him about it later. ;)\n\nb.)\nHave you learned Spanish? If so, does it have genders?"},{"date":"2022-08-05T23:10:31.085659Z","msg":"you are still on, somewhat? neat! =)"},{"date":"2022-08-05T10:16:59.961376Z","msg":"For some odd reason, I cannot load your comment on my other project, but I saw what it read. :)\n\nSomewhat, it needs touch up and graphics, but besides that it is done.\n\nHowever, I will may have to drop out of the compeition soon because of real life. :D"},{"date":"2022-08-04T23:06:54.460346Z","msg":"monstrosity agreed.\ni-i don't even know if i can vote this up.\ni-i can't do it."},{"date":"2022-08-03T14:55:30.650962Z","msg":"a.) just wondering but has anybody suggested that you register your email to fix your commenting problem?\n\nb.) No, I am not French. I hate speaking French because of conjugations. Also, they have a gender for every noun. English may not have gotten much right, but at least it enables the use of the word 'it' for non-living objects."},{"date":"2022-08-03T12:25:25.318689Z","msg":"D: you should be on more. lol"},{"date":"2022-08-02T23:01:06.912264Z","msg":"#HowAreYou?"},{"date":"2022-08-02T14:16:43.953026Z","msg":"*eats the graphic*\n\nyah, you should check out No Name."},{"date":"2022-07-31T10:43:43.947708Z","msg":"still alive and as resilient as ever. :)"},{"date":"2022-07-29T11:16:11.842139Z","msg":"Bonjour! Comment allez-vous? Je m'appelle S.M.V. Je ne parle fran?ais.\n\nbtw you forgot the 'pas'. It is 'Je ne parle pas francais.'\n\nEnglish Smooth Translation:\nHi! How are you doing (formal)? My name is S. M. V. I do not speak French.\n\nEnglish Literal Translation:\nGood day! How goes you? I call myself S. M. V. I do not speek French.\n\nNeat facts! I was going to guess you live in Canada, but you not speaking French that well throws that idea out the window.\n\n\nEDIT:\n\n@YourCommentThreadWithBirdwatcher14:\nDon't worry, at least yet. lol, you only get warnings when you start to spam and you reach 100 comments. I've been in one with 600-700 comments, so you have nothing to worry about . . . at least yet, lol. XD"},{"date":"2022-07-29T00:10:36.544338Z","msg":"dis IS a webpage"},{"date":"2022-07-27T23:48:15.297129Z","msg":"i thought the same thing! i wonder why?"},{"date":"2022-07-26T14:17:42.632279Z","msg":"collect on your money. :P"},{"date":"2022-07-25T23:56:00.070723Z","msg":"sad, that your program is on the hot list (not my fault)\n\nsmh"},{"date":"2022-07-25T16:44:45.8896Z","msg":"neat goat!\n\ntry having KA send you an e-mail, and once you check it you might be able to comment and vote etc. :D"},{"date":"2022-07-25T13:09:07.87647Z","msg":"very foggy."},{"date":"2022-07-24T14:51:11.670255Z","msg":"neat! :D\n\nlol, ski knows a lot . . . maybe a little too much. :D"},{"date":"2022-07-23T22:25:38.845783Z","msg":"still here. :D"},{"date":"2022-07-20T20:40:46.697434Z","msg":"*more stalky noises*"},{"date":"2022-07-20T14:09:57.152569Z","msg":"wow, nice 3D models of marine animals! :)\n\nonce i realized left shift to go down . . . lol\n\ncouldn't find any sharks, but there were a ton of dolphins. :)"},{"date":"2022-07-19T22:54:57.151427Z","msg":"It would mean a lot to me if you subbed :)\nhttps://www.khanacademy.org/computer-programming/subscribe/5329071780184064\n\nare you subbed to yourself? XD\n\ngreat project!"},{"date":"2022-07-19T18:41:26.121883Z","msg":"you may or may not have linked the WIP version of the project. lol"},{"date":"2022-07-19T16:47:36.230165Z","msg":"2 months and still no real work smh."},{"date":"2022-07-19T16:34:56.133188Z","msg":"amazing! :D"},{"date":"2022-07-18T13:17:56.564451Z","msg":"a.) what is the lion running on?\n\nb.) (more of a side nuissance) the lion shouldn't be running, since the way his legs move is unrealistic. the legs should pull into the body before moveing outward, currently it kinda looks like he is trying to jump spread eagle, but then speaks better of it. XD\n\nc.) nice 3D program! :)"},{"date":"2022-07-18T11:43:15.713071Z","msg":"your beach.\nmy lake.\n\ntime to pay rent. :P"},{"date":"2022-07-17T23:48:18.206123Z","msg":"do still know what it is?"},{"date":"2022-07-17T23:47:17.673917Z","msg":"oof bad star."},{"date":"2022-07-17T23:46:28.772373Z","msg":"you sound like Jim from Huckleberry Finn. lol"},{"date":"2022-07-17T23:43:03.839895Z","msg":"a subpage without a subthread . . . suits me. XD"},{"date":"2022-07-17T14:22:53.955565Z","msg":"nice! :D"},{"date":"2022-07-16T14:36:59.172164Z","msg":"first comment!\n\nlol this is so fun."},{"date":"2022-07-16T00:00:37.299921Z","msg":"interesting . . . looks like Virtuosa is taking lessons from greater stalkers. XD\n\nwha the flippin heck? the realism of this is astounding. soon cameras will be out of a job if you can continue this."},{"date":"2022-07-14T22:52:05.391188Z","msg":"Next time please change the spin-off from the original program, also you spun-off the wrong program so currently you are giving credit to the wrong guy. :) i would suggest adding a link to the other program in the comments.\n\nthanks,\nferret-boi"},{"date":"2022-07-14T13:20:06.600616Z","msg":"vampire TS?"},{"date":"2022-07-13T13:02:07.224248Z","msg":"the fake 21262 deletes his comments whenever somebody points him out. :/\n\nhe can be found at\n\nkhanacademy.org/profile/abhijitbiswas08/projects"},{"date":"2022-07-12T17:20:35.854959Z","msg":"might want to check this out, to see how you could make your code a little simpler. :)\n\nhttps://www.khanacademy.org/computer-programming/for-clickers/5079505132634112"},{"date":"2022-07-11T23:54:37.493729Z","msg":"ouchie, some person trying to promote LGBTQ rights decides to spam 21262's subpage."},{"date":"2022-07-11T23:05:15.435621Z","msg":"huh, a rather interesting idea, it would be quite intriguing to see this contest actually take place. :)"},{"date":"2022-07-11T23:03:52.678539Z","msg":"Thanks for the feedback! We'll get back to you as soon as possible.\n\nlol, vote++;"},{"date":"2022-07-09T00:01:05.514539Z","msg":"interesting, what is this?"},{"date":"2022-07-08T23:33:14.543211Z","msg":"a.) i would vote up, but then you might overtake me on the hot list, so i cant vote for you right now. jk jk i voted.\n\nb.)\n'\nrusty (adj.):\nrefers to the programming language Rust, and though its definition is sometimes disguised, it's denotation is jaw-drop amazing talent.\n'\n- Coder's Dictionary 2023 Version\n\nc.)\nimo looks better without the BLUR. :)"},{"date":"2022-07-08T17:38:59.120593Z","msg":"smh seriously surfing?"},{"date":"2022-07-08T16:12:21.851028Z","msg":"interesting . . . i deem this stalk-worthy!"},{"date":"2022-07-08T13:44:55.073988Z","msg":"are you finnish? or do you just like finland a lout, cuz you have 3 program for finland currently. :)"},{"date":"2022-07-08T00:03:18.20227Z","msg":"your graphic skills never cease to impress me.\n\ninteresting idea, :D."},{"date":"2022-07-07T23:54:28.982385Z","msg":"nice scroll bar."},{"date":"2022-07-07T17:17:06.587431Z","msg":"huh, messing around with the paramters can produce some rather interesting results."},{"date":"2022-07-07T16:49:09.975467Z","msg":"really neat! :)"},{"date":"2022-07-07T15:54:56.276772Z","msg":"Italie. The home of the Italians and more importantly the last cavalry charge that included saber and hand grenades where Italians took a far more advanced Russian artillery position near the end of WWII. truly remarkable.\n\nwait you can comment again? huh, that is good."},{"date":"2022-07-07T15:06:22.368064Z","msg":"now i know why there are products for color retention in hair. smh.\n\njk jk, neat graphic!"},{"date":"2022-07-07T14:35:45.113839Z","msg":"```\ntext('To kidnap all your dreams hold them hostage\\nand watch them screen', 10, 520);\n```\nso badly wanted to put this paraphrased NF quote in the wishes thread . . . but i aint evil.\n\nneat graphic, like the style. :)"},{"date":"2022-07-07T13:50:08.450636Z","msg":"*crosses the border into Canada to buy this*\n*comes back into the US*\n*wonders what this is supposed to do*\n*beats the heck out of it and calls it quits*"},{"date":"2022-07-06T18:05:45.231581Z","msg":"neat, stalking ftw."},{"date":"2022-07-06T14:47:44.026869Z","msg":"4th stage looks like a chicken. imo, i want to eat it. i wonder if it has good drumsticks. drumsticks would be nice. bojangles just got a new logo.\n\ni got a bit carried away didn't i? oh well. neat avatar, and go to bojangles sometime."},{"date":"2022-07-06T13:34:42.301035Z","msg":"nice program, originally i thought the 'Improving NPC Fighting Movements' was an objective inside the game for some knuckleheaded reason. lol interesting code.\n\nneat bio."},{"date":"2022-07-06T13:30:55.805166Z","msg":"Primavera all over again go brr.\n\nLiam K. now is more influential than the guardians, cuz he runs all the competitions."},{"date":"2022-07-06T13:23:57.386382Z","msg":"laggy but neat. :)"},{"date":"2022-07-06T13:13:26.869658Z","msg":"came back on for a sec. wassup?"},{"date":"2022-06-02T12:04:43.297619Z","msg":"stalkie stalkie . . . no new projects . . . *sigh* no stalkie"},{"date":"2022-05-31T18:51:05.672762Z","msg":"everybody yelling at Liam K. 'cuz they find bugs in his WIP. smh"},{"date":"2022-05-30T10:40:47.966996Z","msg":"so cute. :)"},{"date":"2022-05-30T10:37:50.135358Z","msg":"Chat Thread\n_Post at your own risk._\n*Closes when comments exceed that of five score*."},{"date":"2022-05-30T10:35:05.833825Z","msg":"noobs: let me make you be able to draw by deleting the background and just putting circles at your mouse\nxacer: i guess i just have to one-up everyone . . ."},{"date":"2022-05-30T10:28:18.093416Z","msg":"while you were gone i became the lord of stalking. :)\n\nstalkie stalkie!"},{"date":"2022-05-29T11:05:29.777619Z","msg":"incredibly realistic!\ni have two minor things. :)\na.) maybe make the head looking straight, 'cuz if the zombie is a shooter type you wont want him looking opposite of his target.\nb.) maybe add a Boolean parameter for a gun?"},{"date":"2022-05-29T11:01:43.620163Z","msg":"Join Thread\n_Post at your own risk. All terms and conditions may be changed at any time. By posting you agree to terms and conditions_.\na.) do not spam\nb.) do not post anything other than join comments\nc.) eat three waffles in your lifetime\nd.) take two showers before each meal"},{"date":"2022-05-29T10:55:59.931917Z","msg":"intereseting . . ."},{"date":"2022-05-28T11:11:18.358158Z","msg":"i want to judge team mountaintop!\nxD"},{"date":"2022-05-27T18:42:38.5256Z","msg":"where did you find that picture?"},{"date":"2022-05-27T18:16:00.388236Z","msg":"beaNs!"},{"date":"2022-05-27T16:35:35.454516Z","msg":"a.) there is a bug with missile collisions, i will be working on it, i worked on it all morning, but i am stumped, so will need you to help.\n\nb.) this is the current missile collisions\n`\ndist(enemies[i].x, enemies[i].y, this.x, this.y) < 50 && this.type === 'missile'\n`\nc.) we need to add size attributes to every object for the projectiles in the projectiles stats.\n\nd.) when i add that i get this piece of code that breaks the game\n`\ndist(enemies[i].x, enemies[i].y, this.x, this.y) < (this.size / 2) + (enemies[i].size / 2) && this.type === 'missile'\n`\n\ne.) the coin bug still isn't fixed for me. O.o"},{"date":"2022-05-27T11:28:28.366828Z","msg":"hey! i remember a while ago you told me 'I am a ghost.' you came back! nice to see you!\nski is very close to getting un__nned, the Non-Pirate and Captain Argon are both still on too. :)"},{"date":"2022-05-26T19:57:48.324483Z","msg":"what is this for? another off-ka project?"},{"date":"2022-05-26T19:13:19.72577Z","msg":"nice! you made it entirely out of boxes."},{"date":"2022-05-26T18:50:48.114973Z","msg":"reminds me of the new Edge logo."},{"date":"2022-05-26T18:50:29.123036Z","msg":"no . . . i have nothing to stalk. :("},{"date":"2022-05-26T18:48:50.292732Z","msg":"how have so few commented on the fact that you subpage is levi f.'s rickroll. smh."},{"date":"2022-05-26T18:33:30.461148Z","msg":"huh, interesting."},{"date":"2022-05-26T17:30:52.584717Z","msg":"hmm . . . the temptation to ask is too great . . . but Fer Fer is greater. lol\n\nhuh, interesting graphic."},{"date":"2022-05-26T17:28:39.976704Z","msg":"i have been stalking your terratrice threads for a while. let us see what the fruit of it shall be."},{"date":"2022-05-26T17:23:25.491752Z","msg":"interesting. :)"},{"date":"2022-05-26T17:22:52.613221Z","msg":"neat!"},{"date":"2022-05-26T17:21:48.57324Z","msg":"huh, interesting."},{"date":"2022-05-26T11:51:55.682927Z","msg":"i didnt even read the books i just spammed the third option and i got 8/20. so about 40% without reading the books. :)"},{"date":"2022-05-26T11:23:30.91136Z","msg":"interesting . . ."},{"date":"2022-05-25T19:09:44.211427Z","msg":"a boat can go against the stream, a missile can too."},{"date":"2022-05-25T15:53:12.742612Z","msg":"interesting day! when i went to public school that was the day that school ended. :)"},{"date":"2022-05-25T13:42:55.95706Z","msg":"https://www.khanacademy.org/computer-programming/spin-off-of-fantasy-prerelease-flashing-lights-warning-trying-to-fix/6264084316602368\n\nfixed it! :)"},{"date":"2022-05-25T13:36:59.345009Z","msg":"lol I found a bug in my code, and a way to fix it.\n\na.) the bug happens when you get to the end of the route with a splitter, so basically you need another boolean that way something like this (see if statement below) happens, and the `enemies[i].end` only comes true when the enemy is at the end of the track (line 360). this should fix it! :)\n\n(line 454)\nif((enemies[i].dead && enemies[i].type !== 'split') || enemies[i].end)"},{"date":"2022-05-25T11:46:30.865336Z","msg":"// jshint esnext: true\nbackground(216, 180, 164);\nnoStroke();\nlet k = 0;\nfor(var i = 0; i < 10; i++){\n    for(var j = 0; j < 10; j++){\n        if(k % 2 === 0){\n            fill(216, 180, 164);\n        }\n        else{\n            fill(226, 200, 184);\n        }\n        rect(i * 60, j * 60, 60, 60);\n        k++;\n    }\n    k++;\n}\ni thought that this might be a sufficient background for the project until you can finish it. :)"},{"date":"2022-05-24T11:27:21.43416Z","msg":"gli-li-itch-chy\n\nnice graphic, but very gli-itch-chy."},{"date":"2022-05-23T17:40:17.29488Z","msg":"yup."},{"date":"2022-05-23T17:15:05.684826Z","msg":"https://www.khanacademy.org/computer-programming/spin-off-of-mandelbrot-set-primavera/6071118088159232?width=600&editor=no\n\nmwahahah"},{"date":"2022-05-23T17:03:21.736722Z","msg":"that house either\na.) is a really tall one-story house or\nb.) has some ridiculously short ceilings or\nc.) has a ridiculously deep basement"},{"date":"2022-05-23T14:19:03.309803Z","msg":"someone i know : 'i hate carrots'\nme : 'i dont care i need you to eat them, they are good for you.'\n'Bunnies are sad.'\n'Umm . . . why?'\n''Cuz they eat lettuce and carrots.'\n'. . .'\n\nlol."},{"date":"2022-05-23T12:43:53.379971Z","msg":"nice\n\nlol, thanks! i'll be sure to use this and give credit in future projects!"},{"date":"2022-05-19T17:44:06.950169Z","msg":"neat."},{"date":"2022-05-19T17:04:36.73957Z","msg":"interesting."},{"date":"2022-05-19T12:09:12.243999Z","msg":"documentation, intresting, i'll be sure to check on this when you are more active.\n\nlifeguard, eh? i dont even know how to swim almost drowned once at a pool with no lifeguard, lol."},{"date":"2022-05-19T10:55:53.149027Z","msg":"run for your life, me boys. kirby is hungry.\n\nlol, neat graphic!"},{"date":"2022-05-19T10:52:43.899741Z","msg":"huh, interesting."},{"date":"2022-05-18T20:04:28.364553Z","msg":"hmmm, an interesting graphic reminds me of the Disney Castle."},{"date":"2022-05-18T18:44:10.464251Z","msg":"NN's alt go brr."},{"date":"2022-05-18T18:02:55.431949Z","msg":"collabs that are never finished go brr."},{"date":"2022-05-18T17:26:41.960352Z","msg":"huh."},{"date":"2022-05-18T17:06:32.710387Z","msg":"CBF be like:\ntake a chill pill bro.\n\nlol, it was fun seeing this get created. =)"},{"date":"2022-05-17T18:10:33.313369Z","msg":"for whenver you need me."},{"date":"2022-05-17T17:10:49.140623Z","msg":"ouch, you are right . . . i only saw this late 'cuz the week you posted this was my vacation."},{"date":"2022-05-17T11:16:35.706524Z","msg":"okay, remember that one time that I criticized your program? well here goes a, hopefully nicer, constructive criticism of your program.\n\na.) there is a bug when you hit the UP key and then press any other key, the top says scrunched, don't know why that happens\n\nb.) the draw function, imo, would be obsolete with the following line of code\n`\nvar thumb = thumb + 1 | 0;\n\n    image(thing, 0, 25);\n\n    if(thumb > 10){\n        var thumbnail = get();\n        background(0);\n        image(thumbnail, 50, -28, 300, 657);\n    }\n`\nwhich basically says that if you have restarted the program 10 or more times then show the thumbnail, else if there are any normal person, show the normal graphic, this also (should) fix the bug spoken of previously because you don't switch out the images thrice.\n\nc.)\nimo the little white dots everywhere would look better behind the leaves. they would look like stars and the graphic becomes cleaner, imo\n\n\nremember this is a great program! just that i thought there were a couple bugs or changes that could be made to make it look nicer. :)"},{"date":"2022-05-17T11:01:51.437106Z","msg":"what if that tree limb breaks . . ."},{"date":"2022-05-16T19:43:01.092763Z","msg":"nothing was ever posted here."},{"date":"2022-05-16T19:36:19.211846Z","msg":"interesting . . ."},{"date":"2022-05-16T19:35:19.21211Z","msg":"still stalking you, lol."},{"date":"2022-05-16T18:28:04.481546Z","msg":"second.\nski got first."},{"date":"2022-05-16T18:01:19.656988Z","msg":". . . comprehension levels are nill."},{"date":"2022-05-16T17:31:46.623667Z","msg":"an interesting thread you got going there."},{"date":"2022-05-16T17:17:30.013222Z","msg":"you can't post anymore lol . . . my day just keeps getting weirder."},{"date":"2022-05-16T14:06:50.949579Z","msg":"the guy is ruining his sweater smh."},{"date":"2022-05-16T14:05:43.195554Z","msg":"most interesting."},{"date":"2022-05-16T12:09:59.891829Z","msg":"wait a minute . . .\na = b\nb = c\na = c\n\nlittlewhinging = developer\ndeveloper = apex\nlittlewhinging = apex"},{"date":"2022-05-16T10:58:51.427035Z","msg":"aha!\nafter one week of inactivity i come back to stalk!"},{"date":"2022-05-16T10:54:24.941989Z","msg":"the story of my life:\n(a while ago)\nhate reading comprehension\n(recently)\ndoing okay with reading comprehension\n(just now)\nno longer can comprehend anything"},{"date":"2022-05-15T11:07:02.672487Z","msg":"interesting . . . \n#notBobOnThisProgram"},{"date":"2022-05-15T10:58:25.038906Z","msg":"looks blurry . . . must be because i don't have my contacts in lemme put them on. \noh nuts I already have them in . . .\n*looks at code*\noh wait that was on purpose\n*face palm*"},{"date":"2022-05-15T10:55:23.280988Z","msg":"nice! lol i am getting spammed after leaving for a week."},{"date":"2022-05-15T10:53:04.750766Z","msg":"'Thank Him that you exist, and then stop thinking about yourself, 'cuz if you think too long you become a philosopher, and I hate philosophy'\n- Fer Fer"},{"date":"2022-05-06T12:50:57.808542Z","msg":"bruh all\nkhanacademy.org/cs/-/......\nlinks are broken.\nKA Bugs go brr."},{"date":"2022-05-06T12:37:47.762637Z","msg":"this it?"},{"date":"2022-05-06T12:19:33.224902Z","msg":"interesting . . ."},{"date":"2022-05-06T10:11:09.14438Z","msg":"how about v than a then r then x then = then 0 then ;? It works perfectly, lol."},{"date":"2022-05-06T10:08:01.694881Z","msg":":D thanks, I'll be sure to use this!"},{"date":"2022-05-05T19:56:43.09141Z","msg":"neat story!"},{"date":"2022-05-05T19:55:41.78658Z","msg":". . . corner logo contests go brrr. I already made one for Bronte, let us see how yours comes out . . . probably as bad as my graphical abilities, lol. :)"},{"date":"2022-05-05T17:22:51.949063Z","msg":"stalkie"},{"date":"2022-05-05T17:15:11.802854Z","msg":"huh, there is a bug:\nif you go through 2 then 1 with your line both disappear, same with any other numbers like 2 and 1."},{"date":"2022-05-05T17:09:14.142882Z","msg":"like the warrior graphic!\n\nmaybe he'll be able to find me missing periods, smh, tell my if you find it . . ."},{"date":"2022-05-05T16:48:42.898295Z","msg":"intresting"},{"date":"2022-05-05T14:38:57.460346Z","msg":"do i have many things I need to be working on right now?\nyes.\nshould i be making a corner logo for Bronte, when I cant even be making corner logos for myself?\nno.\n\nwelp, here goes nothing.\n\n(no fonts? try Ferscript, a custom font I made myself, still needs numbers though . . . >:D)\nhttps://www.khanacademy.org/computer-programming/new-program/4806772851261440"},{"date":"2022-05-04T19:41:53.05257Z","msg":"First, ironically!\nthe ferrets stopped rioting strangely, and gave you a medal for first person to do a decent ferret graphic."},{"date":"2022-05-04T17:34:50.043058Z","msg":"*Warning*\nYou have exhibited behavior that has proven in the past to be controversial, riot invoking, and chaos causing. Please be careful in limiting the amount of these programs posted, before all *bleep* breaks loose again.\nThank you,\n_the supreme leader of the ferrets who has very little authority_\n\nlol, neat program, but I actually kinda like 1st place better than 4th."},{"date":"2022-05-04T16:46:52.770009Z","msg":"stalikie"},{"date":"2022-05-04T16:45:49.323212Z","msg":"stalkie"},{"date":"2022-05-04T16:45:04.276539Z","msg":"i deleted my commenmt.\njk jk."},{"date":"2022-05-04T16:40:53.035394Z","msg":"60 lines of code, nice."},{"date":"2022-05-04T11:25:22.624073Z","msg":"wat is the green thingie?"},{"date":"2022-05-04T11:21:55.141886Z","msg":"please no . . . why did you have to pick on my favorite animal of all things . . . for dem peeps who don't know orcas do NOT have gills."},{"date":"2022-05-03T16:47:56.879661Z","msg":"an interesting character . . . he looks mean."},{"date":"2022-05-03T13:24:16.221094Z","msg":"lost a period somehow last seen around your sub thread . . . third one in the past couple of weeks. if you find it please tell me. :("},{"date":"2022-05-03T13:22:04.649796Z","msg":"stalkie, stalkie!\n\nan interesting webpage . . . with an interesting last thing to the last thing."},{"date":"2022-05-03T12:58:46.149016Z","msg":"works on Edge.\n\namazing program!"},{"date":"2022-05-02T18:50:46.845517Z","msg":"neat!"},{"date":"2022-05-02T14:44:05.84468Z","msg":"lemme guess LC?"},{"date":"2022-05-02T14:11:07.661909Z","msg":"try making it so that the user clicks on this link, that way most of the white space doesn't show. ;)\n\nhttps://www.khanacademy.org/computer-programming/avatar-wars-fractals/6201982820859904?editor=no&width=400"},{"date":"2022-05-02T13:51:15.45991Z","msg":"lol, just double checkin' but you can't access your sub thread can you?"},{"date":"2022-05-02T10:14:36.813358Z","msg":"#DarkModeFTW"},{"date":"2022-05-02T10:08:25.343495Z","msg":"I know why the comments on your program won't load! ski was recently ch@t b@nn@ned, and it seems that anywhere that the Gaurdians hid where he posted won't load, e.g. Dominic R.'s subpage your subpage, practically all of my programs, all Mountaintop threads (since ski was captain), etc. Evan Lewis told me to file a support ticket, but honestly I don't think that the KA Developers will be able to fix this quickly . . ."},{"date":"2022-04-29T17:46:44.675203Z","msg":"the only thing that I see that could be improved, is that the footer gets in the way of the content. would highly suggest instead of having a 'permanent' footer, just place it at the bottom of each page. :)"},{"date":"2022-04-29T12:07:10.014545Z","msg":"I can't seem to load the Tips and Thanks for this project. :/"},{"date":"2022-04-29T10:35:38.096865Z","msg":"Hey NP,\njust to let you know ski has gotten b@nn3d, he will probably be able to come back sometime in June.\n:D"},{"date":"2022-04-28T17:23:47.310696Z","msg":"how is learning HTML coming? :D"},{"date":"2022-04-28T16:35:45.543164Z","msg":"sadly this only allows you to have one WIP and stops you from creating a new program until you save the old one. honestly the best way to make a program stalker proof is to utilize __ ___ _______ ____ ___ _______ ______ _ ___ __ _____ and then ____ _ _________ ____ with the ___. \n\n^ an actual way to stop stalkers (just made so that you can't see it). :D"},{"date":"2022-04-28T12:12:57.006598Z","msg":"Others: 'You can do anything!'\nFer Fer: 'No, I can't.'\nOthers: 'Yes, you can!'\nFer Fer: 'Okay, I am trying to grow wings and fly. *waits 5 minutes* See? I can't.'\nOthers: '*intense grumbling*'"},{"date":"2022-04-27T17:32:15.313881Z","msg":"i feel like i have seen this before . . . XD"},{"date":"2022-04-27T12:17:20.808984Z","msg":"reminds me of angel's art style. :)"},{"date":"2022-04-27T12:11:18.814152Z","msg":"lol, found this. :)"},{"date":"2022-04-26T18:16:14.057226Z","msg":"stalkie stalkie."},{"date":"2022-04-26T18:05:05.965684Z","msg":"neat!"},{"date":"2022-04-26T18:04:28.053234Z","msg":"neat!"},{"date":"2022-04-26T18:03:36.357959Z","msg":"nice!"},{"date":"2022-04-26T18:03:10.048616Z","msg":"neat!"},{"date":"2022-04-26T14:05:46.335923Z","msg":"votes = 2;\ndominic_r_message = 'bruh';\nstalker_fer_fer = 'annoying';\nvotes += 1;\nvotes = 3;\nstalker_fer_fer_alt = 'annoying'\n\nI wonder what happens next . . ."},{"date":"2022-04-26T13:58:49.76436Z","msg":"i've been going around stalking, when i came across the Golden Gamer thread, and noted that you were talking about trying to make less spam. A great way to do that is editing your comment. :)\n\nFirst, click 'More' right next to the flag button on your comment. \nClick 'Edit' out of the drop-down menu\nEdit your comment\nClick 'Save Changes' and you are done!"},{"date":"2022-04-25T20:03:31.648307Z","msg":". . . was it loss of motivation or procrastination that struck?"},{"date":"2022-04-22T11:56:32.98122Z","msg":"periods. that is the second period in a couple of weeks that went missing. smh, rascally little things."},{"date":"2022-04-19T16:51:42.515286Z","msg":"behold, graphics at their greatest."},{"date":"2022-04-16T10:24:20.900766Z","msg":"your getting me reminiscing about the days 4 years ago . . .\n\nlol, nice program!"},{"date":"2022-04-16T10:15:46.304136Z","msg":"https://www.khanacademy.org/computer-programming/spin-off-of-a/4646297003933696/latest.png\n\nis this supposed to happen?"},{"date":"2022-04-14T10:12:39.867153Z","msg":"lol, you were named after a vacuum cleaner . . . how thoughtful."},{"date":"2022-04-14T09:39:19.588368Z","msg":"I like to use `Consolas Bold`."},{"date":"2022-04-13T19:21:05.623263Z","msg":"I've been stalkin' the Primavera threads (since I have nothin' better to do), and I noticed your comment in the Cloudlark thread, and FYI according to ski the judges are permanent, so you guys will have Liftoff for the rest of primavera, if, of course, ski is right."},{"date":"2022-04-13T17:08:36.375735Z","msg":"lol the red line is still somewhat here."},{"date":"2022-04-12T19:23:12.888967Z","msg":"yay, I got first place!"},{"date":"2022-04-12T16:01:08.287666Z","msg":"I thought you were siblings with No Name . . ."},{"date":"2022-04-12T14:32:26.239029Z","msg":"Trend where people tell facts about themself using an inefficient clicker = my doom 'cuz I made an entire program 3+ months ago showing off a clicker in 11 lines so that they won't make inefficient clickers.\n\nhttps://www.khanacademy.org/computer-programming/annoyed-by-clickers/5079505132634112\n\nneat facts!"},{"date":"2022-04-12T14:25:34.524138Z","msg":"since no name hasn't done it yet.\n\n*eats the program*"},{"date":"2022-04-12T13:39:29.612285Z","msg":"So I have this slight problem . . . I can't animate it so I'll just try to make some extra graphics for it. \n\na.) I know this sounds like I am lazy, but I just don't have the time, motivation, etc. My activity levels are dropping off on Wednesday, and the amount of animating I would need to do to make it worth it would be impossible.\nb.) I began working on it, and then I realized I had no clue how on earth to do some of the things, e.g. make the bunnies hop,\nc.) my whole idea about the night/day thing is quite close to impossible . . . or at least for my patience and effort.\n\nNow it sounds like I am whiny. lol, anyways I started working on some graphics, and changed some coordinates etc. in my spin-off."},{"date":"2022-04-12T12:30:25.145748Z","msg":"a.) all projects are unhidden for you, and it takes 10 more votes for Classical TD to overtake Blue. lol\n\nb.) the program that you spun-off of is plagiarized, see Red Arrow's comment\n\nc.) stalkie stalkie!"},{"date":"2022-04-12T11:54:02.305569Z","msg":":D Stunning!\nI'll start working on animating it right away."},{"date":"2022-04-11T14:17:16.448007Z","msg":"this is intresting."},{"date":"2022-04-11T13:09:06.874729Z","msg":"a.) neato!\n\nb.) The judges judge (partially) off of cleanliness and your code is not exactly . . . well uh clean :/"},{"date":"2022-04-11T12:57:41.331872Z","msg":"What is this for?\n\n(Yay you joined mountaintop! [does that mean i have to stop impersonating you :/])"},{"date":"2022-04-11T10:23:19.458755Z","msg":":D nice to see you!"},{"date":"2022-04-11T10:20:14.041053Z","msg":"lol if you couldn't tell ski, Captain Argon, and Dominic R. pulled Neutrons together to not get last place.\n\nGlad to have you back, looking forward to having another person to stalk! >:D"},{"date":"2022-04-08T14:40:12.176519Z","msg":"I am missing a period, last reported to be somewhere around here . . . tell me if you find it please . . . I've been dropping periods everywhere lately smh ):"},{"date":"2022-04-07T18:45:15.249103Z","msg":"thanks!"},{"date":"2022-04-07T15:00:35.172365Z","msg":"lol, everybody is using operation flash."},{"date":"2022-04-07T10:30:45.93914Z","msg":"Yay! I ain't human, do you despise me too?"},{"date":"2022-04-07T10:29:44.140537Z","msg":"yay!"},{"date":"2022-04-06T11:52:58.920724Z","msg":"Neat!"},{"date":"2022-04-06T10:34:58.98645Z","msg":"I think something is wrong with your judgement program. Last time Flux didn't judge all the entries, now it is Liftoff. D:"},{"date":"2022-04-06T10:29:17.021356Z","msg":"Neat graphic!\nThe only thing that you could improve on is the reflection of the moon in the lake! :D"},{"date":"2022-04-05T22:44:10.559353Z","msg":":D Neat!\nI'll make a quick function that keep the stars in place instead of randomizing them."},{"date":"2022-04-05T19:10:39.426836Z","msg":"I thought you were judging mountaintop?"},{"date":"2022-04-05T16:59:53.519762Z","msg":"I don't think that you are allowed to submit twice."},{"date":"2022-04-05T14:52:13.177363Z","msg":"might want to give credit to ski. :D\n\nneat!"},{"date":"2022-04-05T11:24:28.327627Z","msg":"a.) Maybe put the particles behind the flower?\n\nb.) I was scared, no frightened, that you were going to post this for Primavera . . .\n\nc.) (if you had had more time) maybe change the background so it is a bit more detailed? or maybe this is just me being spoiled from all the sick backgrounds Ace Rogers gave me . . .\n\nd.) two things come to mind when I see this.\n1.) 'impending doom'\n2.) a quote from ski's newspaper 'Duck: \"Quack\"'\n\n3.) dont ask about D2, just dont.\n\nEdit:\n\nWhy did some of the Tips and Thanks stop showing up for a while?\nD: that was odd . ."},{"date":"2022-04-04T20:08:07.33055Z","msg":"Old McDonald had a farm \nE-I-E-I-O\nAnd on that farm he had a stalker\nE-I-E-I-O\nWith a stalkie stalk here and a stalkie stalk there\nHere a stalk, there a stalk, everywhere a stalkie stalk stalk!\nOld McDonald's private life was ruined\nE-I-E-I-O"},{"date":"2022-04-04T19:25:59.770854Z","msg":"I like to exercise my patience by reloading the page instead of being annoyed. It also exercises my laziness.\n\n:D"},{"date":"2022-04-04T18:22:22.331369Z","msg":"Neat graphic!"},{"date":"2022-04-04T17:11:19.215633Z","msg":"Neat! :D"},{"date":"2022-04-04T14:24:35.720589Z","msg":"Neat!\nMaybe a background, and better graphics?"},{"date":"2022-04-04T12:42:39.044034Z","msg":"Neat game!\nI keep teleporting through blocks though. :/"},{"date":"2022-04-02T10:21:49.574901Z","msg":"I remember the old Invasion 3 . . . so I didn't bother clicking lol"},{"date":"2022-04-02T10:19:23.022857Z","msg":"Neat! Nice to see you back around, person with so many alts I won't bother to name them. =]"},{"date":"2022-04-01T18:47:37.383865Z","msg":"khanacademy.org/profile/thelegendski/\n\nlol you're gonna have a fun time"},{"date":"2022-04-01T14:56:12.813275Z","msg":"I knew this was an April Fools, as soon as I saw the notif. :("},{"date":"2022-04-01T14:32:16.143495Z","msg":"you are correct I am."},{"date":"2022-04-01T13:15:07.832476Z","msg":"what do I get in return?"},{"date":"2022-04-01T13:11:34.513886Z","msg":"darn april fools. smh"},{"date":"2022-03-31T23:55:59.104365Z","msg":"neat!"},{"date":"2022-03-31T23:52:57.910798Z","msg":"vote+=1;\n\n'cuz of the top hat. uwu"},{"date":"2022-03-31T18:22:00.109459Z","msg":"*sees the sub thread comment*\n\nyup, that's the Guardian's alright."},{"date":"2022-03-30T19:57:27.512133Z","msg":"I half want to make you _want_ to comment . . . but that would be diabolical of me. lol\n\nneat graphic, I would suggest connecting the letters to make it more 3Dish. :D"},{"date":"2022-03-30T19:25:54.765733Z","msg":". . . *sigh* you never got around to what you were going to do.\n\nlol neat graphic."},{"date":"2022-03-30T14:24:50.407382Z","msg":"Coder: Nothing\nStalker: Definitely Something"},{"date":"2022-03-30T12:48:52.903968Z","msg":"Why did you use Hebrew letters right next to your links?\n\nSubbed!"},{"date":"2022-03-30T10:25:07.713425Z","msg":":D Neat!"},{"date":"2022-03-30T10:09:01.313493Z","msg":":D You strike home once again!\nlol, I like how you managed a 'Mountaintop for the win!' in there.\n\nEDIT:\n*looks at code*\ndrop dead. those details are _insane_.\n\nSecond Edit:\nI am working on two projects and only can submit one (both were supposed to be a collab with jmtyk who went inactive), would you like to submit one? You have done far more than your share of the work."},{"date":"2022-03-29T16:37:47.231507Z","msg":"now I want you to make me a corner logo. D:<\n\nlol, great work!"},{"date":"2022-03-29T14:54:16.81519Z","msg":"*when you realize that CoraL refused to use PJS for the graphics*\nsmh"},{"date":"2022-03-29T14:22:51.729905Z","msg":". . . is it just me or did procrastination strike?"},{"date":"2022-03-29T11:27:37.361087Z","msg":"Great game, really liked it! One minor tip though many of the old programmers, especially the Non-Pirate, hate fake loading screens since some loading screens are actually used to load graphics for complex games. A loading screen in their opinion pretends that your game needs to load graphics even though it doesn't. Just a tip, :D!"},{"date":"2022-03-29T11:20:03.6593Z","msg":"neat!"},{"date":"2022-03-28T19:00:17.914414Z","msg":"reminds me of grass"},{"date":"2022-03-28T14:55:06.584664Z","msg":"CoraL has her own color? Why isn't 21262 a color?"},{"date":"2022-03-28T14:44:29.349711Z","msg":"uhhh weird? and neat? and spooky? and scary? and a whole bunch of other things?"},{"date":"2022-03-27T09:45:31.141149Z","msg":"dang it."},{"date":"2022-03-25T20:08:14.609365Z","msg":"try this. :D\n//restart if you want a blank canvas \n background(0, 0, 0);\ndraw= function() {\n    fill(255, 255, 255);\n textSize(23);\ntext(\"move your cursor across the screen see what happens\",30,22,364,110);\nfill(0, 255, 166);//you can change this to change the color of circe there is \n\n};\nmouseMoved = function () {strokeWeight(10); stroke(0, 255, 166); line(mouseX,mouseY,pmouseX,pmouseY);};//change these numbers if you want a bigger size circle \n//drag if you want to start a new line of dots somewhere else on the canvas"},{"date":"2022-03-25T19:29:23.854682Z","msg":"neat!"},{"date":"2022-03-25T13:40:52.070744Z","msg":":D neato!"},{"date":"2022-03-25T11:08:37.724246Z","msg":"I thought Ramadan was in the fall?"},{"date":"2022-03-25T10:53:40.63645Z","msg":"I don't under value myself, I don't over value myself. I exist and nothing more."},{"date":"2022-03-24T10:06:40.284237Z","msg":"_conspiracy theory_\nlittlewhinging = developer"},{"date":"2022-03-23T23:47:50.388201Z","msg":"Neat!"},{"date":"2022-03-23T10:49:05.28089Z","msg":"reminds me of Red Arrow's iron man."},{"date":"2022-03-23T10:47:04.603349Z","msg":"stalkie, stalkie!"},{"date":"2022-03-22T23:01:04.310163Z","msg":"neato!"},{"date":"2022-03-22T18:42:06.81182Z","msg":"Thank heavens you gave Mr. JSprograms the credit he deserves. somebody plagiarized this program in the past. :/"},{"date":"2022-03-22T17:51:16.496493Z","msg":"neat!\n\nhelpful tip:\nUse an array to hold the buttons, it helps to stop making a variable for each and every single button. :D"},{"date":"2022-03-22T17:19:13.934512Z","msg":"Proof that people are prejudiced against SQL scripts. This is your least voted project lol."},{"date":"2022-03-22T16:39:36.109031Z","msg":"Wanna do a collab with me for Challenge 2?"},{"date":"2022-03-22T12:39:58.961795Z","msg":"you are late. :/"},{"date":"2022-03-22T12:07:55.284636Z","msg":"A. There is a bug where each hour has 60 minutes. So for every hour that passes you actually survived one more minute than you would think you did.\nB. I got 8:60 AM (exact) on day 3 using survival."},{"date":"2022-03-22T11:18:37.526214Z","msg":"ski's advice that works:\nUse `break` not `continue`."},{"date":"2022-03-21T20:08:28.601456Z","msg":"When you see 2 of the greatest 3D coders still active talking with each other . . .\n\nHonestly, I don't understand raytracing/casting or any of that stuff, but it looks cool and has unimaginably great code so  `vote += (9 / sqr(3));`."},{"date":"2022-03-21T20:05:17.881889Z","msg":"neato!"},{"date":"2022-03-21T17:07:39.107045Z","msg":"Neato!"},{"date":"2022-03-21T16:50:26.658434Z","msg":"You wouldn't happen to be open to a collab, would you?"},{"date":"2022-03-21T14:56:02.611068Z","msg":"A. Use rectMode(3); or rectMode(CENTER); instead of the x and y controlling the top left corner of the rectangle it controls the center allowing for better alignment. :D\n\nB. noStroke(); strokes are unnecessary most of the time, except when you are using any strokeWeight above 1, e.g. 2, 5, 10, are all good strokes to use when needed.\n\nC. Your 'Daedalus Programming' takes away from the project with the current font. You can also use textAlign(3,3); to help center it like rectMode(3); does. Try 'Consolas Bold' for a good font."},{"date":"2022-03-21T14:38:10.675574Z","msg":"O.o what is this?"},{"date":"2022-03-21T13:24:58.886208Z","msg":"Eh, this is for round 2, the thread you put it in is for round 1."},{"date":"2022-03-19T11:08:28.959908Z","msg":"Neato!\njmtyk has an extra break after his skill level."},{"date":"2022-03-18T14:21:10.538027Z","msg":"Go do something crazy today!\nYou don't want me to go out and do that . . .\nNo, seriously you don't, that is unless you want mass mayhem, chaos everywhere, and a ferret who has not broken a single law but is very much wanted by every country in the world. :/"},{"date":"2022-03-18T13:27:35.243714Z","msg":"Text goes outside of the buttons, maybe a better font also?"},{"date":"2022-03-18T12:37:16.250133Z","msg":"Neato!"},{"date":"2022-03-18T12:29:31.824371Z","msg":"Dolphy!"},{"date":"2022-03-18T12:08:37.850224Z","msg":"I think I lost a period somewhere over here . . . maybe its over there near where the BigMeese and Mojo1000 are talking. I can't seem to tell were it went, tell me if you see it. :/"},{"date":"2022-03-17T20:16:57.630188Z","msg":"First!\n>:( You should change your avatar back.\nEdit: I can only vote 10 times an hour. smh"},{"date":"2022-03-17T20:05:51.72386Z","msg":"Snow Mouse did something similar before . . .\n#Plagarizer\njk"},{"date":"2022-03-17T09:55:31.749863Z","msg":"You: I have no stalkers\nMe: Hold it right there!"},{"date":"2022-03-16T19:51:04.601692Z","msg":"neato!"},{"date":"2022-03-16T18:21:50.853383Z","msg":"Neato!\n\nOne thing, maybe add a bar graph of sorts (I am not sure how to do this) for the scores?"},{"date":"2022-03-16T18:04:08.324398Z","msg":"meat!"},{"date":"2022-03-16T15:13:45.907194Z","msg":"oh stalkie stalkie!"},{"date":"2022-03-16T15:01:12.075752Z","msg":"subbed!"},{"date":"2022-03-16T13:04:04.787432Z","msg":"drop dead.\n\nI see that the competition got a bit harder. *sighs* I guess this just means I have to pull out my A-game."},{"date":"2022-03-15T13:14:06.59103Z","msg":"like jmtyk said this ain't too shabby."},{"date":"2022-03-15T12:56:56.059485Z","msg":"remember how I stalked every team in COC?\n\nlemon games' homepage\n\nhttps://www.khanacademy.org/computer-programming/team-pyroach-homepage/5047495760592896"},{"date":"2022-03-15T10:41:51.855448Z","msg":"Why I can't I see the messages on my end?"},{"date":"2022-03-14T20:03:19.159578Z","msg":"I will still kill spiders, they shouldn't live in my house."},{"date":"2022-03-14T19:43:39.502455Z","msg":"Hello Green Ghost,\nI was wondering if you had time to work on a project.\n- :D"},{"date":"2022-03-14T17:17:49.016307Z","msg":"neat!"},{"date":"2022-03-14T14:36:19.050809Z","msg":"~[\"\",\"Mountaintop\",1]~"},{"date":"2022-03-14T14:35:10.578184Z","msg":"second lol."},{"date":"2022-03-14T13:48:45.833414Z","msg":"stalkie stalkie, wait there is nothing here . . . no stalkie."},{"date":"2022-03-14T12:33:13.176973Z","msg":"looks great!"},{"date":"2022-03-13T12:02:32.017527Z","msg":"neato!"},{"date":"2022-03-13T12:00:32.638749Z","msg":"lol I don't know any of the songs on anybody's list 'cept NF. XD"},{"date":"2022-03-13T11:57:15.054091Z","msg":"All the lord of the rings fans are going to be _so_ mad at you.\n\nAnd why did you post it twice on your subpage? O.o"},{"date":"2022-03-11T19:58:08.826709Z","msg":"Congrats on your Golden Winston! :D"},{"date":"2022-03-11T19:30:29.377694Z","msg":"neat, you are impersonating my brother. XD"},{"date":"2022-03-11T19:14:21.982398Z","msg":"O.o well this is neat."},{"date":"2022-03-11T15:30:02.516182Z","msg":"I read your entire speech, and I couldn't help but laugh. Oh I listen alright. I listen very closely to every argument I am in, and deliberately decide to use my listening skills to tear the other's argument to pieces. I whole-heartedly _refuse_ to react to what I just heard in any manner that is not stubborn any action that is not a rebuttal."},{"date":"2022-03-11T13:11:40.82739Z","msg":"Bug:\nOn level 23 destroy all the people and then use the sniper or rail gun to zoom in while you go to the milk. When you finish the level and go0 to the menu the screen stays zoomed in."},{"date":"2022-03-11T12:29:05.590582Z","msg":"@yourCommentOnIceDashPutHereAsNotToSpamTheOthers:\nWow. ski however can rap at least 3-4 songs from memory along with at least 100 large portions of other NF song and whenever there is a break in conversation between me and him is excersised.\n\nEdit:\nhttps://www.khanacademy.org/computer-programming/rap/5755666418417664"},{"date":"2022-03-11T12:10:43.356036Z","msg":"10000+ Spin-off proof. >:D\n\nhttps://www.khanacademy.org/computer-programming/spin-off-of-ice-dash-game/6117558609559552"},{"date":"2022-03-10T20:58:33.503141Z","msg":"Neato!"},{"date":"2022-03-10T20:14:35.666053Z","msg":"Neato!"},{"date":"2022-03-10T19:08:49.79475Z","msg":"oooh, what is this? It looks like . . . nothing I have ever seen before."},{"date":"2022-03-10T18:30:27.738918Z","msg":"moving the discussion here to not spam why. :)\n\n. . . so yeah, not ferrets . . . at least not entirely . . . I think I saw a weasel or two in there."},{"date":"2022-03-10T18:00:41.106383Z","msg":"Okay here goes nothing.\n\n\"\n1. Background is decent, about that emoji though. Emojis have a couple problems, lets start with one. \na. They don't show up the same on all computers. The reason why many programmers avoid emojis is for this reason, windows computers and mac computers can't seem to agree about emojis and cause issues for many computers because people will see different versions of the same emoji.\nb. It gets you much much more honor and attention if you code the emoji. Use the emoji as a reference image and then code it. It would look pretty stellar if you did that, and best yet works on _all_ computers. :D\n3. Interactivity. Simple interactions go a long way with good graphics. Making a full game would be amazing. :D\n4. Animation. Most likely not going to come in conjunction with Interactivity, but would be nice even for a simple sin(frameCount*10) animation. :D\n\"\n\n- A friendly Ferret named Fer Fer"},{"date":"2022-03-10T15:49:04.836633Z","msg":"you are still alive?"},{"date":"2022-03-09T20:48:43.638059Z","msg":"Neato!"},{"date":"2022-03-09T17:45:52.373362Z","msg":"death snowman?"},{"date":"2022-03-09T17:41:55.193028Z","msg":"ski told me about this and so I went through all of your projects 'til I found this one. Neato!"},{"date":"2022-03-09T17:41:25.270615Z","msg":"neato!"},{"date":"2022-03-09T16:06:44.092669Z","msg":"Neutrons beat the aces! I guess I was expecting the neutrons to be last . . ."},{"date":"2022-03-09T15:49:08.176631Z","msg":"when you remember the days where RandomProgrammer24 created 'one last game' and then realized 3 years later that the 'one last game' became 'one last* game' :D"},{"date":"2022-03-09T15:36:52.875935Z","msg":"I am pretty sure that all the greats are secretly following my plan to an extent even though they don't know they are. JSCoder is still around even though he _claims_ he isn't, I am pretty sure he is sticking around for Turkey Dash. xacer posted 4 days ago, and willard is still somewhat on, meaning my plan is ready now just to move forward with it.\nOh, and by the way if you want to learn some new stuff, go ask ski for ski.js or ES6 in PJS you will see that PJS has a little bit left to offer you.\nEdit:\nXenon is on? My plans are coming together."},{"date":"2022-03-09T15:09:15.540475Z","msg":"You don't find in the least bid odd, that you chose the 'purple-pi' avatar to represent rationality? Pi is an irrational number 3.141259 . . . so then it shouldn't represent rationality. I think I am starting to make sense ignore me."},{"date":"2022-03-09T15:04:28.107434Z","msg":"'we have sirius issuez here are some of them'\n\nEnglish Professor : 'Wholehearted agreement, acknowledgement of such a state means you will only spend three years instead of ten in Grammar Jail. Please contact the guars about rehabilitation when you are ready.'"},{"date":"2022-03-09T14:34:06.72034Z","msg":"somewehere in the top ten!\nAnyways, neat game, but annoying when you restart the program since it forces you to read the how. Also, don't you think that long animation that shows your name come down and shows off your ego could be clicked through? :D"},{"date":"2022-03-09T13:44:33.191185Z","msg":"Is this it? it keeps throwing errors . . ."},{"date":"2022-03-09T13:08:21.738098Z","msg":"You have nothing to stalk. D:"},{"date":"2022-03-09T13:03:06.595411Z","msg":"quotin' ski is gonna give him an ego boost . . . one he doesn't need.\n\n:D neat program, great tribute, _and_ great game. :D"},{"date":"2022-03-08T20:20:44.170416Z","msg":"The evolution of my stalking adventures for the past couple of minutes.\n\nlooking at my projects > finding ski post > stalking ski > finding ski & marci collab > stalking marci > finding the link you posted off of one of marci's comments > finding this > subbing to your collab thread\n\n:D"},{"date":"2022-03-08T20:16:33.208293Z","msg":"@Hotlist:\n#GetWrecked"},{"date":"2022-03-08T17:55:39.747402Z","msg":"Oh lookie!\nStalkie stalkie!"},{"date":"2022-03-08T17:52:29.945013Z","msg":"oh noise what happened to all our hashtags?\n\n#WhereDidTheHashtagsGoD:"},{"date":"2022-03-08T14:44:05.705775Z","msg":"`\nvar scene = 0,txt = [{msg:'Problem 1: x+3 = 0',x:16,y:49},{msg:'Problem 1: x+3 = 9\\n\\n*does calculation and gets wrong answer entirely*',x:16,y:49},{msg:\"*Starts contemplating life, tries to correct it and still\\ngets another wrong answer somehow*\",x:16,y:49},{msg:\"*Checks math with calculator*\\n\\nCalculator's answer: George Washington\",x:16,y:49},{msg:\"Time to ragequit\",x:51,y:186}];\nfunction titleSlide() {\n    background(149, 184, 194);\n    textFont(createFont(\"calibri\"), 52);\n    fill(105, 151, 181);\n    textAlign(CENTER); text(\"Why Math SUCKS\", 250, 150);\n    fill(255, 255, 255); text(\"Why Math SUCKS\", 250+3, 150+2);\n    textSize(20);\n    text(\"By ApolloDragon\", 250, 193);\n}\nfunction draw() {\n    if(scene !== 0){\n        background(255, 255, 255);\n    stroke(173, 222, 237);\n    for(var i = 0; i < 20; i += 1) {\n        var lineY = 6 + (i * 27);\n        line(-4, lineY, 504, lineY);\n    }\n    textSize(scene === 5? 54 : 20);\n    textAlign(LEFT);\n    fill(255, 0, 0);\n    text(txt[scene-1].msg,txt[scene-1].x,txt[scene-1].y);\n    }\n    else {\n        titleSlide();\n    }\n}\nmouseClicked = function() {\n    scene+=(scene === txt.length? txt.length*-1 : 1);\n};\n`\n\nI spent the past couple minutes shortening your code down into exactly 30 lines. Neat program! :D"},{"date":"2022-03-08T14:26:57.876666Z","msg":"'Free hearts come and get them!'\n\nRandom guy stops and looks at a friend of his.\n\n'Makes you wonder where they got the hearts from doesn't it?'\n\n'Don't tell anybody, but they are a bit cold-hearted . . .'"},{"date":"2022-03-07T18:10:01.272586Z","msg":"Another KA program for an off-KA game?"},{"date":"2022-03-07T16:00:05.116208Z","msg":"Neato!"},{"date":"2022-03-07T15:47:53.402021Z","msg":"when you realize someone has went inactive. smh"},{"date":"2022-03-07T14:28:57.83882Z","msg":":D Step 1 is in place, Step 2 is coming soon.\n\nI decided from now on I don't say goodbye, I saw good riddance. Just kidding, hope you have a good time just learning* on KA, but from what I have seen of you, you can probably start writing the next courses on KA 'cuz they ain't exactly anything new to you.\n\n* - we both know the plan"},{"date":"2022-03-07T14:01:49.889103Z","msg":"I won the entire continent of Australia for just $25! This makes the Louisiana Purchase look expensive!"},{"date":"2022-03-04T20:39:19.576927Z","msg":"When your least voted program is 20 votes . . .  XD"},{"date":"2022-03-04T17:45:36.779496Z","msg":"you broke it . . ."},{"date":"2022-03-04T15:41:51.478957Z","msg":"You don't appear to be working here . . . so I came to yell at you for not finishing your WIP! :D"},{"date":"2022-03-04T15:05:48.017599Z","msg":"Please don't leave until you finish this . . . . I have leaveyefleevphobia. The fear of levi. f leaving."},{"date":"2022-03-04T13:10:19.519888Z","msg":"Maybe add an area where you can type commands into? 'Cux right now it just seems like a bunch of buttons, text, rects, and lines."},{"date":"2022-03-04T12:48:23.380907Z","msg":"Jaw drop. I usually am against spin-offs of platformer template . . . but  you changed it in a million ways making it a hundred times better . . .\n\nTotally gave you the 52nd vote."},{"date":"2022-03-03T20:55:41.562996Z","msg":"Ah, so this was the great scheme behind it all, I have managed to supress the ferrets for a while, mind if you don't make graphics everyday from now on?\n\n\nAmazing, absolutely magnifincent!\n(I was annoyed by the fact that your team used an off-site chatting area so I couldn't talk you)"},{"date":"2022-03-03T15:07:34.485492Z","msg":"M&M - \"Choose love!\" \n\nFer Fer - \"Nope, I choose to jump off the cliff of sanity into the grat ocean of insanity. Sounds pretty nice doesn't it?\"\n\nGreat graphic!"},{"date":"2022-03-03T14:31:32.119123Z","msg":"neato!"},{"date":"2022-03-03T14:23:11.742976Z","msg":"10001th vote!"},{"date":"2022-03-02T20:57:43.622977Z","msg":"Neato!"},{"date":"2022-03-02T18:55:08.10988Z","msg":"I am sorry, but the Internet is most certianly the internet. Something had to be itself. Take me for example. If I wasn't me, I would end up like all those other philosophers like Decarte and Bacon who went clearly lost their marbles, but were rich enough to bribe the history textbook company for me to learn about them! Anyways, the internet is the internet."},{"date":"2022-03-01T15:47:13.721968Z","msg":"Seriously? I think I have already posted at least five times on how you need to stop clogging up the hotlist with these graphics. With so many CorinFist graphics on the hotlist poor ferrets won't have a chance to post anything, and start a riot. This riot will lead to crop-failure, bad internet, and the feared blue screen of death. You must stop before your diabolical actions go any further in causing an apocolyptical situation. Economies around the world would tank. Do you want to be responsible for the next Dark Age? How about the next Great Depression? Or even worse the next Covid-19 variant? If so please stop making these graphics.\n\nSilliness aside, this is neato! :D"},{"date":"2022-02-28T20:00:46.799745Z","msg":"10th! Neato!"},{"date":"2022-02-28T18:12:49.948142Z","msg":"Neato!"},{"date":"2022-02-28T15:07:55.025388Z","msg":"Okay your picking a fight. Seriously, you need to stop making graphics that are going to wreck the hot list! D:<\n\nNeato, and first!\nActual Trivia Pursuit Question vv\nQ: Who voiced R2D2?\nA: Nobody a computer did it."},{"date":"2022-02-28T13:25:21.045785Z","msg":"First! :D Neat tool!"},{"date":"2022-02-27T12:14:45.93553Z","msg":"You said that you wanted to be better at programming, so I was wondering if I could teach you. I may not be the best, but I have a few tricks. :D"},{"date":"2022-02-27T12:08:59.988979Z","msg":"neat!"},{"date":"2022-02-25T21:27:35.169599Z","msg":"A. That scares me a cat+deer animal. Yeah that scares me real bad.\nB. You say its a baby deer, but explain the antlers. The antlers prove that it is a cat in a deer disguise.\nC. Please be upfront on what you are actually creating a baby cat in a deer disguise is not what you advertised this to be, please consider this next time when you name a graphic.\n\n:D"},{"date":"2022-02-25T15:07:56.230186Z","msg":"I am the most recent commenter, in 9 days."},{"date":"2022-02-25T13:30:42.750512Z","msg":"Neato! Might want to use a for loop instead like\n\nfor(var i = 0; i<=600/23; i++){\nfor(var j = 0; j<=600/23; j++){\nrect(i*23,j*23,23,23);\n}\n}"},{"date":"2022-02-25T13:26:11.620985Z","msg":"Neato!"},{"date":"2022-02-25T13:25:09.678579Z","msg":"neat, need any help?"},{"date":"2022-02-25T12:41:08.185815Z","msg":"Oh hoh hoh! You think you are sneaky, I see those commented lines of code, and I think I remember someone saying something about an \"adopt-a-pet\" game. I see you!"},{"date":"2022-02-24T13:59:55.814698Z","msg":"Neato!"},{"date":"2022-02-24T10:45:25.964606Z","msg":"Stalking you . . ."},{"date":"2022-02-24T00:58:50.888468Z","msg":"I need a copy of your rant on drained. :D You sound like ski when he is all riled up. Flagged drained dev's post, so guardians can ban drained."},{"date":"2022-02-23T21:11:40.753206Z","msg":"I told you last time, stop making graphics! I can't post any of my projects with you wrecking the hot list, how many times do I have to say this?\n\nXD, great graphic!"},{"date":"2022-02-23T13:25:50.864547Z","msg":"1. neat game\n2. Please don't just make tons of gam es based off of Jacob's platformer template. There was a time they took over the hot-list, and those were very dark times in the KACP history. If you want I can help you create games! :D"},{"date":"2022-02-23T13:18:06.642603Z","msg":"Why did I start trying to scale up the blob so i could poke his eye out? O.o"},{"date":"2022-02-20T11:44:18.177231Z","msg":"So this is Corin Fist's new strategy, brand riding, huh. Just joking, but wondering why all the logos?"},{"date":"2022-02-19T13:00:32.108704Z","msg":"subbed, =D!"},{"date":"2022-02-18T20:36:37.746531Z","msg":"Neato, might wanna replace the numbers in the background with something random though, just in case somebody jots down when your sister's birthday is . . . that would not be good."},{"date":"2022-02-18T18:58:19.637622Z","msg":"9 blank lines of code + 1 stalker = 1 extra vote for no reason other than that would make my 9 votes this hour 10"},{"date":"2022-02-17T20:47:03.999988Z","msg":"I have never watched a graphic climb that high in the matter of half a second . . . from third row to first row third spot in the blink of an eye . . ."},{"date":"2022-02-15T12:14:29.545214Z","msg":"Great!"},{"date":"2022-02-10T13:47:58.604589Z","msg":"PRECURSOR!\n\nXD, you probably won't get it, ski and the Non-pirate would probably nobody else would know what that means.\n\nAnyways, great game! The small size allowed you to make the maps more complex.\n\n`\nvar votes = 21;\nvar my_vote = +true;\nvotes+=my_vote;\nprintln(votes);\n`"},{"date":"2022-02-07T17:37:48.018783Z","msg":". . . that is one way to be evil on KA . . . to bot-vote programs, huh. **evil ideas forming**\n\nGreat program! \n`\n//At the time of this post.\nvar Vote = 6;\nvar one = +true;\nVote+=one;\nprintln(Vote);\n`\n\n:D"},{"date":"2022-02-07T11:59:54.003765Z","msg":"You seem to like plague doctors . . .\nThats it! Green Ghost is a time traveling plague doctor from the 9th century who stumbled upon the amazing art of programing and using his stupendous amount of brain capacity wrecks the hotlist and is one of the OG programmers on KA only because he escaped the Black Death through time travel!\nI gotta get the word around."},{"date":"2022-01-22T15:14:23.599841Z","msg":"Neat! The question is which way to go . . . as always left is right, and right is only left if the right is down the middle. (<- I am not sure how that makes sense)"},{"date":"2022-01-19T15:17:08.316144Z","msg":"Victory! The second to last battle was actually harder than the final one inn my opinion. I only had a slight problem with the last battle where all the parashrooms were taking my water blasts instead of the boss."},{"date":"2022-01-19T15:02:46.224496Z","msg":"mmmm . . . fried chicked . . .\n\nXD, great game!"},{"date":"2022-01-18T17:38:29.673137Z","msg":"Maybe more detailed graphics?\n\nNeat graphic, the only problem I have is that the clouds feel wrong . . . IDK."},{"date":"2022-01-18T13:33:22.723084Z","msg":"https://www.khanacademy.org/computer-programming/sub-page/4673106612371456\n\nMy sub page for all ye who want to visit it. I warn you ahead of time, do so at my* risk.\n\n*subtract the \"m\" from beggining and add \"our own\" at the end"},{"date":"2022-01-13T11:52:12.223265Z","msg":"@LongCommentEnding\nIt may not have been over then, but is it now?\nP.S. I also suffer from lack of motivation, not thinking games through that is why all my games are made within a week less time to lose motivation and less stuff to plan out. If you want someone who doesn't lose motivation that would be ski who takes a month to make his mystery contest entry barely making it for the deadline (though unfortunately he didn't get picked and as he put it \"they couldn't give a good reason why\" for a Golden Winston)"},{"date":"2022-01-12T00:01:45.01217Z","msg":"second!"},{"date":"2022-01-10T14:34:59.363432Z","msg":"yay finally released !"},{"date":"2022-01-07T14:16:04.278202Z","msg":"Amazing!"},{"date":"2022-01-06T18:11:10.25263Z","msg":"You know what? Where is the U.S.'s national debt, if I was Elon Musk, I would start there when trying to do some good while squandering my money."},{"date":"2022-01-05T21:07:16.581551Z","msg":"You picked up OOP! (I sub to a whole bunch of threads including the collab one between you and ski)!"},{"date":"2022-01-03T18:27:39.339514Z","msg":"Sorry, but COC and the other challenges made everybody forget about this one . . ."},{"date":"2022-01-03T18:16:56.790086Z","msg":"A note: The entries are quite confusing I originally tried to copy/paste the fill out form in the webpage, but that didn't work. Then I tried to find some fill-out form, but failed, and then i just followed what everybody else was doing. And then Sax-Man started show-case programs, I have no clue what is going on what was I supposed to enter?\n\nEdit: Fund the form filling it out now, was subbed to your news thread and then found it. Why do you have that joing page, still confused."},{"date":"2022-01-03T14:05:03.134096Z","msg":"https://www.khanacademy.org/computer-programming/skis-sub-page/5108432377970688\n\nski's subpage\n\nhttps://www.khanacademy.org/computer-programming/sub-page/4673106612371456\n\nmy subpage"},{"date":"2021-12-30T14:29:19.028506Z","msg":"Sub Thread\n_Warning: Do So At Thou's Ownst Risk_\n_Superfluous Comments Will Be Flagged_"},{"date":"2021-12-20T13:29:25.708409Z","msg":"Flaming popsicles are a bit rare."},{"date":"2021-12-15T17:27:59.627451Z","msg":"noStroke the hat, it is amazing triangle art!"},{"date":"2021-12-15T15:01:40.510547Z","msg":"Russian Flag"},{"date":"2021-12-15T11:23:43.667047Z","msg":"So I am  not going to tell you that you plaigarized, but a little constructive critiscism.\n1: Maybe a bit too much light?\n2: The chair is floating\n3: The light from the computer should be a fill(255,255,255,100); and then put the light at the bottom of the code before the CPU, the reason for this is there is a fourth parameter of fill that lets you control the transparency of the shape.making the light cast a glow on the human and other things it is over.\n(Humorous From This Point on)\n4: Green pants with a purple shirt? And I thought my fashion sense was bad.\n5: Don't make the guy bald whatevere you do, just _don't_.\n\n:D"},{"date":"2021-12-14T19:43:57.663745Z","msg":"Okay, I have a couple things and take these as feedback not offensive critiscism:\n\n1: It is just text with a background nothing special to coding, yes my most voted program is similair but it was never meant to be that way, it was just an entry for a nespaper.\n\n2: You could at least give it a font or something,\n\n3: You are just riding on the message not the fact that you did something nobody else has done before or is at least something that is worth contributing, and you don't seem to try to stop people from voting\n\n4: On side note, some of the messages are controversial, e.g. social media being a good thing, (many of which I don't agree with), this hasn't caused quite the stir because it hasn't gotten to many votes\n\n5: Again side note thank you for reminding me in a round about way to switch my most voted program to something more than the text it was and the stop voting comment, which people didn't seem to take seriously."},{"date":"2021-12-14T17:47:13.536688Z","msg":"Neat! Creepy, maybe a bit less creepy next time for Christmas?"},{"date":"2021-12-14T11:51:06.441546Z","msg":"Jaw drop? What else is supposed to happen?"},{"date":"2021-12-11T11:43:25.029552Z","msg":"When I click on the link you just posted it says the link goes to nowhere, maybe repost the link?"},{"date":"2021-12-08T19:56:25.225167Z","msg":"You are stil around?"},{"date":"2021-12-04T11:42:07.619384Z","msg":"Subbed!"},{"date":"2021-12-03T13:02:41.294521Z","msg":"Taheyes eyaso amoyxingd!\n\n(Jaw dropped off can't say anything right)"},{"date":"2021-12-02T13:09:49.343307Z","msg":"How to find a great platformer\n\n1: Does Not Use Pixel Art\n2: Does Not Claim It Is A Platformer\n\nExceptions That Break Our Algorithim\n\n1: Just Your Average Platformer By Hoot Coding\n\n:D Amazing platformer, the pixel art and different block physics are great, I haven't seen the extra gravity blobk before, intresting idea.\n\nVote ++;"},{"date":"2021-12-01T19:28:53.117856Z","msg":"Great game! The graphics were decent and the buttons were nice, I also liked the difficulty. :D"},{"date":"2021-12-01T12:18:31.859543Z","msg":"The cutest pests ever seen, :p."},{"date":"2021-11-29T18:33:29.540767Z","msg":"A bunny? First Vote!"},{"date":"2021-11-24T12:27:38.527791Z","msg":"You got the pixel art function from somewhere..."},{"date":"2021-11-23T13:56:18.891172Z","msg":"Neat!"},{"date":"2021-11-22T13:40:16.868676Z","msg":"Why......? Why did you make an utterly amazing (in the coding world) graphic of an entirely of a poor mouse? The mice have been bullied for two long because of their resemblence to rats, I say mice deserve to live! :p"},{"date":"2021-11-19T20:47:47.876111Z","msg":"Amazing game, why does this have less votes than the programs on the hot list right now?"},{"date":"2021-11-19T15:27:47.674429Z","msg":"Gameplay could be improved on, but besides that decent game! :D"},{"date":"2021-11-18T11:43:42.8007Z","msg":"The shading for the pencil is nice, but the shading for the wall is off. Neat graphic though!"},{"date":"2021-11-15T18:03:24.644795Z","msg":":O I now wish I could solve the mystery, but I already know the answer. Most likely this thing called \"the very bear that is wondering this\" took a smackerel of it. :D\n\nNeat graphic! Votes = Votes + 1;"},{"date":"2021-11-09T17:47:06.685667Z","msg":"Okay this is neat...not the graphic (that is amazing), but that you were able to get _grass_ down is absolutely mind blowing. You don't know how many people find it so hard to make plain ol' grass. Vote +=1; (I would give you 10 but I can't)"},{"date":"2021-11-09T12:09:14.983411Z","msg":"I doubt you are still on, but seriously you only thought it would get a 100 votes. You underestimated the voters..."},{"date":"2021-11-05T18:11:42.769605Z","msg":":( Are you suggesting you are going to mimic eating a cat head? I am no cat lover (or dog lover for that matter), but that is just wrong.\n\n(Stops Joking)\n\nNeat graphic and pun! Vote++;"},{"date":"2021-11-02T20:08:30.905077Z","msg":"Just to let you know...if I was getting chased by a bunch of ghosts that wanted to kill me I wouldn't be smiling."},{"date":"2021-11-02T10:55:58.723185Z","msg":":O Wow! You put a lot of detail in your pixel art!"},{"date":"2021-10-22T10:38:32.15383Z","msg":"Nice collisions, the controls are a bit touchy, but that adds a nice twist to the game great job! Vote +=1;"},{"date":"2021-10-21T19:39:33.720686Z","msg":"Okay, I know it has already been said, but if this doesn't win KA is rigged, and I don't know what has happened to people's judging skills."},{"date":"2021-10-15T14:32:37.438629Z","msg":"Just something to point out, but shouldn't you guys be a bit more organized, (no offense) but it seems that you don't have a specific project or goal you are completing.(I hope you don't mind I read your little thread for member because I was curious of what you were doing)."},{"date":"2020-02-11T19:39:28.206641Z","msg":"I don?t understand this."},{"date":"2020-02-07T15:50:07.917999Z","msg":"bug once you win and you keep playing it sets you right next to the portal."},{"date":"2020-02-06T19:44:02.684527Z","msg":"Uhh?.I saw this but, It is just some rects with negative radius"},{"date":"2020-01-10T19:42:35.170709Z","msg":"Sorry not as funny as some of the other jokes I have heard like ?Who put all the math textbooks in the horror section??, and could use some functions. I might make a spin-off that uses functions."},{"date":"2019-04-18T17:11:57.603155Z","msg":"I basically blasted the game get a TON of speed boosts then do a big amount of collectors then. increase the crate amount per one then you just sit back and enjoy"},{"date":"2019-04-12T11:45:22.546996Z","msg":"Sorry this will not earn my vote I repeat if anybody asks why I didn't vote them up I've this link I am absolutely tired of games like this. People don't learn anything from these types of games all they do change a few graphics and add levels THAT IS IT"},{"date":"2019-02-21T15:55:20.223106Z","msg":"I don't have a phone sorry"},{"date":"2019-01-28T18:18:41.765591Z","msg":"I like Tau day bette than Pi day"}]}