{"REPLY":[{"date":"2023-03-14T12:46:47.652699Z","msg":"no, >:(."},{"date":"2023-03-14T12:46:32.375637Z","msg":"that wouldn't be too hard.\n\nthat sounds like too much work."},{"date":"2023-03-14T12:45:14.080498Z","msg":"i was unaware that it wasn't compatible. i'll get to it right away."},{"date":"2023-03-12T20:26:09.083121Z","msg":"sure thin', ;p."},{"date":"2023-03-12T03:55:07.022591Z","msg":"postin' here to not spam everyone else.\n\nthere are two reasons why your join code errored out on my end.\nfirst, i had an xss attack from another user an' so you can only use alphanumeric values an' spaces in namez [which don't do anythin' since i access the name through the API].\nsecond, your team name has to be ninjaz, astronomers, or leviathans. \"Ex-Host\" has been added in, so you just need to fix your name to \"Liam K\"\n\nedit: fixed the script on my end so you should show up w/o needin' to repost/edit."},{"date":"2023-03-12T02:12:53.516338Z","msg":"highscore: 1000"},{"date":"2023-03-12T02:12:48.262176Z","msg":"highscore: 400"},{"date":"2023-03-12T02:12:42.895848Z","msg":"highscore: 300"},{"date":"2023-03-12T02:12:38.552204Z","msg":"highscore: 100"},{"date":"2023-03-12T02:12:30.233397Z","msg":"highscore: 200"},{"date":"2023-03-12T02:11:52.969353Z","msg":"precisely. on the other hand if someone tries to do smth stupid, i do have a blacklist, >:)."},{"date":"2023-03-12T02:06:13.535881Z","msg":"oh, oh, yes lol."},{"date":"2023-03-12T00:50:26.798051Z","msg":"misspell an' it'll produce an error. i'll just need to let each of those users know."},{"date":"2023-03-11T15:53:37.642588Z","msg":"$[\"jsDelivr\", 2, \"astronomers\"]$"},{"date":"2023-03-11T15:42:28.531303Z","msg":"$[\"john doe\", 1, \"ninjaz\"]$"},{"date":"2023-03-11T03:38:49.473538Z","msg":"thread's been moved here, :p.\n`_*https://www.khanacademy.org/cs/-/6259188185743360*_`\nit works perfectly, the join code data is all stored on GitHub, but gettin' jsDelivr to update the scripts is a pain, ;-;."},{"date":"2023-03-10T21:16:14.152623Z","msg":"so, it looks like most of the other tasks have been taken. only one remains, an' if you can't do it/don't have time to, that's chill.\n\ncreate the logic for a parallax background for a platformer. we already have the background."},{"date":"2023-03-10T21:15:44.63559Z","msg":"change filters script version to 1.8.14 an' `posterize` now works properly, :)."},{"date":"2023-03-10T21:14:38.10166Z","msg":"let me see. it doesn't sound like it'd be too hard."},{"date":"2023-03-10T20:59:57.535028Z","msg":"no, you can't."},{"date":"2023-03-10T14:27:58.275618Z","msg":"$[\"ski\", 3, \"ninjaz\"]$"},{"date":"2023-03-10T13:34:38.084021Z","msg":"$[\"ski\", 3, \"team 1\"]$"},{"date":"2023-03-09T05:20:40.273736Z","msg":"this should've been sent to you yesterday, but it seems to have been hidden.\n\ni've sent you the link to the project on GitHub, but lmk if that one doesn't work either."},{"date":"2023-03-07T13:44:47.96175Z","msg":"oh yeah, lol.\n\nit'll get fixed in `1.8.10` which will be released in the near future. revert back to version `1.8.4` for now.\n\nif ski.js was fully finished, i would def agree that it is a terrible library.\nski.js is the best overall if we consider the costs an' benefits of all libraries. it's easier for development, basically the most efficient unless you're PixiJS an' use WebGL to draw the canvas, but lacks the sheer number of features that other libraries offer. if you're lookin' for a library packed with every feature, don't look to ski.js. if you're lookin' for a library that has the basic functions an' gets the job done, that's what ski.js is for."},{"date":"2023-03-06T16:09:26.641056Z","msg":"the Guardians will let it fly as long as you only use it for `mouseScrolled`. if you're still concerned just move to the web environment lol."},{"date":"2023-03-06T14:57:18.885205Z","msg":"eh, it's got a long ways to go to bein' a finished product.\n\ni could load all of the images on an `OffscreenCanvas` an' cache the `ImageData`, but wouldn't that be less efficient if i wanted a loadin' screen on the current canvas? i think i misunderstood you.\nthe function `set` creates an `OffscreenCanvas` on line 1092 that ski.js uses to draw.\n\nit certainly does. lol, yeah, i do. the reason why i didn't overlay HTML for the HUD here is that i was on a time crunch an' didn't see the need to add an extra movin' part by interactin' with the DOM. is there a particular advantage of usin' the DOM over the canvas?\n\nwow, thank you, :D. means a lot to me comin' from you.\nuh, it needs way more comments to be well-commented, but the first few hundred lines are okay."},{"date":"2023-03-06T14:52:18.938399Z","msg":"that i'll see if i can fix. the issue has been that KA forces me to check the events for the entire DOM instead of just the canvas. i think someone else has a fix for that, so i'll see what i can do.\n\nthat is a simple fix, but i personally like it which is why it has persisted across all versions. you can disable it with one line.\n`canvas.onscoll = () => {}`\n\nthat's an easy fix. i'll change that in a pinch. i think you should be able to change `skiJSData`.\n\nski.js never claims to be the best canvas library for comprehensiveness an' dev experience. it isn't production-stable, so i think it's slightly unfair to treat it as a finished product. ski.js is the best canvas library overall when you consider efficiency, comprehensiveness, an' dev experience. if you want more comprehension an' mediocre performance, join the p5.js train. if you want crazy efficiency [much faster than ski.js] but a worse dev experience an' completely different from the PJS you're used to, PixiJS is the way to go."},{"date":"2023-03-06T14:37:13.884446Z","msg":"i did."},{"date":"2023-03-03T19:24:30.516459Z","msg":"knowledge only matters if you can apply it.\n\nsure someone scores a perfect score on a test, but when the curriculum is useless what good is the test score?\n\nsure i'm probs in the top 10 perhaps top 5 coderz on KA rn knowledge-wise, but i can't do the simple stuff like creatin' a new script element that sets the values of other elements in the DOM.\n\nwhat do i have to brag 'bout besides havin' a head filled with useless information?"},{"date":"2023-03-03T19:21:42.031111Z","msg":"paste this into a new webpage in a script with `type` set to `module`. if it doesn't work, then you've blocked pop-ups as it should work.\n\nif `window.fullscreen` exists [is truthy], set it to a constant `run`. else, run the fullscreen script where the new window has `window.fullscreen` set to a truthy value.\n\n```\nconst run = window.fullscreen || (function () {\n    const win = window.open()\n    win.document.open()\n    win.document.write(\"<!DOCTYPE html>\" + document.getElementsByTagName(\"html\")[0].outerHTML)\n    win.document.close()\n    win.fullscreen = true\n})()\n```"},{"date":"2023-03-03T16:01:41.073979Z","msg":"lol, or it means i have smol brain 'cuz it shouldn't be this hard."},{"date":"2023-03-03T15:30:39.467925Z","msg":"no worries.\n\ni'll let him know. dunno if you could tell, but i hate admittin' defeat lol.\n\nnah, you're cool, :p."},{"date":"2023-03-03T11:49:25.281052Z","msg":"JS is \"easy\" 'cuz it's a high level language.\nC doesn't count as low-level, not even close.\nthink Assembly an' then you're gettin' somewhere."},{"date":"2023-03-03T11:48:18.708352Z","msg":"he's already messaged me privately on it.\n\nit's portin' to KA that's the issue. the entire thin' is done off-KA on another platform (CodeHS) due to KA hatin' CoffeeScript (forces me to save an' reload everytime a change is made). the issue is that CodeHS has my full name on it, an' i can't exactly share that link. there's a link i can share that shows the finished product w/o the code which i will produce when i release. the current issue is portin' to KA. it's all set up, but the issue with Liftoff's compiler was that it sent arguments passed into `fmt.Println` to the console an' i modified it to send to an element instead so the user didn't need to open the console (or in the case they didn't have access to the console). KA must hate the technique i used or it doesn't work in the sandbox idk which. if Liftoff could work on that, i _think_ that's it."},{"date":"2023-03-02T13:41:01.517644Z","msg":"except have efficient code lol."},{"date":"2023-02-27T23:09:02.021526Z","msg":"cocoa when it's 70 outside, o.O.\nthanks, :D! i hope i ace it, o.o.\nuh, i would let you see, but my name is currently on the project. it's stored off-KA rn due to weird KA environment-related issues that require me to save an' reload after every change, ;-;.\n\ni actually don't, but it sounds vaguely familiar, :p.\n\nglad to have a companion, :).\n\nyeah, :D!\nidk if i can beat my effort from last time lol."},{"date":"2023-02-27T22:14:29.168761Z","msg":"stressed like always.\ncrazy busy week. gon' take the SATs on Wednesday, o.o.\ntryin' to finish the webpage for CoC. code is not cooperatin', >:(.\n\noh yeah."},{"date":"2023-02-27T13:51:14.947298Z","msg":"furthermore, if you know how to use the modern syntax, you wouldn't be in the PJS environment.\n\ni _think_ i can do it live.\n\nhuh, i'll try my hand at it.\n\nbeen tryin' to figure out what `Program.settings` an' `Program.runTests` do. has anyone ever figured it out? KA's source code on GitHub doesn't provide any documentation, but it claims that there are settin's that programs can modify."},{"date":"2023-02-27T01:58:49.916782Z","msg":"beyond possible, is it reasonable to implement? the next step beyond doin' what _can_ be done is convincin' others it _should_ be done.\n\ni think my first endeavor of smth similar would be an implementation of CoffeeScript, but the compile times aren't pretty.\n\nin reference to your Open Problems project, is there a particular reason why the `SharedWorkers` API is particularly difficult to implement in PJS?"},{"date":"2023-02-27T01:34:33.765781Z","msg":"`eval` is stupid. a `script` tag isn't, but i see your point.\n\nbeyond provin' that the KA devs don't prioritize this community in the slightest regardless of the work involved, how difficult would it be to make the editor compatible with p5.js? technically you're manipulatin' the DOM which should arguably [in the perspective of the Guardians an' their moderation] only be done in the web environment, so PixiJS, Paper.js, ski.js, etc. are all possibilities for the editor since you essentially stripped it down to its bones in the respect of the compiler."},{"date":"2023-02-27T00:45:35.027579Z","msg":"the next round begins tuesday which is when you'll be replacin' Fer Fer, believe it or not, so i'll fill you in with any necessary details then, :).\n\nhow does it sound if i collect a list of tasks we need done an' you choose what you think you can get done?\n\nthank you for helpin' out!"},{"date":"2023-02-26T19:30:25.933949Z","msg":"no worries, :).\nthanks for considerin'; hope to see you 'round soon."},{"date":"2023-02-26T19:29:45.508858Z","msg":"yeah...she's sketchy on activity an' gone 'till March 3rd, but givin' her activity levels with Liftoff, i don't think she's active enough to keep participatin'.\nworse than last year, i daresay.\n\nnah, that's cool, i understand where you're comin' from, :)."},{"date":"2023-02-24T19:57:48.725808Z","msg":"all good."},{"date":"2023-02-24T18:55:11.026768Z","msg":"not sure if you noticed, but you haven't enabled discussions, :). ignore if you already knew, :p.\n\nnow i'm the one confused."},{"date":"2023-02-24T18:20:41.53263Z","msg":"shouldn't that mean that we should stop regulatin' plagiarism under the same principles since those peepz should feel shame for the votes they garnered? as a repeat offender for plagiarism, the answer is no, you don't. that's my issue."},{"date":"2023-02-24T18:05:34.769018Z","msg":"still faster in GPU, no?\n\n:)."},{"date":"2023-02-24T16:12:38.48489Z","msg":"\"I should probably pre calculate some stuff and insert them as uniforms.\" - sounds like it'd be done in JS, no?\n\ncreate a private GitHub repo. invite me as a collaborator. enable discussions. done, :)."},{"date":"2023-02-24T16:02:38.663156Z","msg":"so pre-calculate 'fore the `main` function in GLSL?"},{"date":"2023-02-24T15:55:45.133046Z","msg":"if you pre-calculate in JS an' not in GLSL, then your computations are done on the CPU not GPU."},{"date":"2023-02-24T15:04:29.0836Z","msg":"lol, you don't get it."},{"date":"2023-02-24T14:39:01.593663Z","msg":"@SP\nhow does the council know where you've gotten your code? it's one thin' to plagiarize code off KA since you can find it through reasonable means [how many others programs were created in an outdated language], but what if a more experienced programmer copies large portions of their program from ChatGPT? it's more than capable of producin' algorithms that could take days to complete an' programmin' in a webpage rather than PJS would make ChatGPT even more powerful. as some of the council members are Guardians, they should know that the members of the KA community aren't always honest an' simply relyin' upon their morals isn't the best idea.\n\nrules are fine an' all, but they are only feared when they are enforced. i find this proposition of the council not only confusin' as Bob has stated but also impossible to enforce. there's no tool available on the internet that can accurately [key word] detect whether code was generated by an AI."},{"date":"2023-02-24T11:16:31.78858Z","msg":"\"Oh pixel is the size of your pixels.\"\noh, that makes sense. as in i didn't know what my own code did an' you explained it to me.\n\n\"So there was no way around it :P\"\ni thought this was your response to the print.js fix, so my natural inclination was that KA's editor is garbage after a recent update as i didn't have to reload the page every time for the script to load for 1.8.3 but now i do.\n\nkernelz, :DDDD!\n\noh yeah!\n\nblur is easily the slowest lol.\nGPU faster than CPU, so why calculate on the CPU, o.O."},{"date":"2023-02-24T11:12:45.47786Z","msg":"yup, =/. unless you use the same canvas for every filter an' naturally resettin' the `canvas` width an' height resets the `canvas` itself, :o.\n\nah, that might be it.\n\nthat's good?\n\nlol, known as the bad ski way, :p.\n\nGitHub or element[.]io if you have it."},{"date":"2023-02-24T02:07:48.146812Z","msg":"lol, that sounds like a plan."},{"date":"2023-02-24T01:09:44.645017Z","msg":"that makes sense.\nah, that makes sense.\nyup, =/. i hate KA's editor lol."},{"date":"2023-02-24T01:01:30.167732Z","msg":"me have smol brain. me not know what `uv` coords are. me copy from WebGLFundamentals an' then play with it.\n\nmy definition of a pixel:\n```\nvec2 pixel = vec2(1.0, 1.0) / size;\n```"},{"date":"2023-02-24T00:59:01.804217Z","msg":"i have no clue how you would make it faster. i'm on a literal potato. it grew from the ground an' i plugged a couple wires in an' bam, a \"Chromebook\" they call it.\n\nyeah, you'll have to use `Promise`s for that.\n\ni think it's the initial setup behind the canvas API 'cuz they might optimize it for just the 2D context an' forget WebGL? mine is slower than yours 'cuz i suck at WebGL an' there's probs a bunch of performance tips that i'm missin' out on [that i'd love to hear if anyone has 'em] but hey, it works, :D."},{"date":"2023-02-24T00:55:59.393769Z","msg":"uh, there's this new weird KA bug where i have to save an' reload for the script to run, o.O. what the heck? 1.8.6 works [it used `var`, :p]\n\n`print.js` + major changes to `main.js` = version skip, :p.\n\n```texture2D(Sampler, texture + pixel * vec2(-1.0, -1.0)```\ngrabs the pixel to the upper left of the current pixel in the texture."},{"date":"2023-02-24T00:45:20.138889Z","msg":"it's not ideal, but filters are rlly only used for cached images/canvases.\n\ni just return the image element an' `image` just keeps tryin' to draw the image 'till it loads [unless you use `onload` instead, v(o.o)v]"},{"date":"2023-02-23T22:23:05.622306Z","msg":"```\nnf.constructor(\"$('*').on('wheel', e => e.preventDefault())\")();\n```\n:p"},{"date":"2023-02-23T22:16:05.401797Z","msg":"in order for `mouseScrolled` to work properly, you need to do some...sketchy stuff, :p."},{"date":"2023-02-23T16:15:29.764624Z","msg":"no, i return the filtered canvas an' store it in a variable 'fore the draw function an' then draw it afterwards.\nuh, i don't think i could do that."},{"date":"2023-02-23T15:55:33.799726Z","msg":"i am just haven't fixed the shaders to mirror that.\n\ni don't think i have those, :o. i'll have to go back an' get 'em later."},{"date":"2023-02-23T15:49:48.432559Z","msg":"fixed, i think.\n\n`posterize` but with the alpha value set to `color` not `color.a`\n\nbtw, it runs at 60 fps rn 'cuz i cached the canvas. updated to show the true performance cost, =/."},{"date":"2023-02-23T11:54:41.732696Z","msg":"lol, i did it, just didn't know if you'd gone through the trouble.\n\nthat's slow compared to usin' `ctx.drawImage` on the whole canvas if you have it stored, ;p. i think i just realized my problem. stupid JS object allocation bugz, >:(.\n\ncongrats!\n\nwonderful WebGL. might upgrade my shaders to WebGL 2 at some point. i'll have to see how hard the transition is."},{"date":"2023-02-23T11:39:59.89187Z","msg":"eh, close enough.\n\nit's always time to learn, :)."},{"date":"2023-02-22T16:46:03.740797Z","msg":"with varyin' degrees of blur?\n\nuh, not sure why you'd need that.\n\ncache the ol' canvas. draw it on the new canvas, ;p."},{"date":"2023-02-22T16:07:40.972554Z","msg":"we all start somewhere, :).\n\nnow for the hard part. i promise you `blur` will make you cry. that kernel, o.o. the second spatial derivative of the Laplacian of the Gaussian function, -.-.\n\nmy problem currently is cachin' the ol' canvas. have no clue why it won't work rn [stored elsewhere not on KA or gh], but i'll figure it out soon enough. is it truly necessary to copy properties from the ol' context over to the new context?"},{"date":"2023-02-22T15:05:36.069772Z","msg":"how do you not like CoffeeScript?"},{"date":"2023-02-22T14:58:36.607377Z","msg":"yuck? it's not too bad if you aren't on KA when developin'."},{"date":"2023-02-22T12:35:46.724168Z","msg":"i'll have to try `lowp` sometime.\n\njust 5?! took me at least 10+ an' i ended up just makin' the p5.js function better."},{"date":"2023-02-21T04:17:46.328875Z","msg":"i was unaware that `ctx.roundRect` existed lol."},{"date":"2023-02-21T02:41:29.926902Z","msg":"every filter [no matter the computation necessary] drops the fps by 40, o.o.\n\ni think i have a separate vector class lol.\ntrue.\n\nsame here which is why there's no docs after a year lol.\n\n~100% on KA. some on random other web IDEs just to make sure stuff i found wasn't weird KA stuff, but pretty much just here."},{"date":"2023-02-21T02:20:32.813267Z","msg":"total of 1266 lines of code for all addons + main script which includes functionality you probs won't have in yours [`Point` class that is mostly used for solvin' geometry problems, semi-robust random string gen, collision library]. i don't have matrices, but i think you might've over engineered some of your functions. curious to know if you'll be usin' WebGL or `ImageData` for your filters?"},{"date":"2023-02-20T22:04:24.944124Z","msg":"yup. that sounds like KA lol."},{"date":"2023-02-20T21:24:23.083372Z","msg":"for p5.js perhaps. for PJS, it does both. i'm not well-versed in p5.js so i can't conclude much there."},{"date":"2023-02-20T20:57:15.466467Z","msg":"true that.\nprobs a good idea lol."},{"date":"2023-02-20T19:42:28.177724Z","msg":"it will, :o.\ngood news for ski.js; bad news for DR's repo."},{"date":"2023-02-20T16:35:03.706394Z","msg":"eh, i found a StackOverflow article on it.\nit worked, :D!\n\n`textLeading` is, an' someone asked for it, o.O. ig it has a use?\nTHAT was weird. Fer Fer is the one who developed the formula for how to position the centered text."},{"date":"2023-02-20T03:06:38.089494Z","msg":"holy crap i entirely forgot 'bout that."},{"date":"2023-02-18T21:44:42.117289Z","msg":"here."},{"date":"2023-02-18T21:31:02.315524Z","msg":"it's a pretty late entry, so if you don't feel comfortable judgin' it, it should probs be a no. Liam has already done quite a lot with the deadline for team ski an' i don't think it would be fair to keep askin' for favors if you get my drift, :)."},{"date":"2023-02-18T21:24:59.539743Z","msg":"was pretty inactive the whole week, so no work could get done, -.-.\n\ncrud. uh, i forgot to include this-ish. dunno if you still care to judge this or not, but here's SMV's portion.\n`_*https://www.khanacademy.org/cs/-/6051327054757888*_`"},{"date":"2023-02-18T12:03:58.713994Z","msg":"true that."},{"date":"2023-02-17T22:11:51.803092Z","msg":"my note to Tuan is not a joke. he has nowhere near that much experience with buildin' canvas libraries. not sure where you got 5+ years from tho.\n\ntrue that. love to see what you come up with, :D. i think we can learn smth from each other, ;p."},{"date":"2023-02-17T21:50:49.051318Z","msg":"my deepest apologies. i presumed you intended this to be a competition rather than for the sport of programmin', :).\n\ni was entirely unaware of this fact 'fore you mentioned it, :). i'm grateful that you have an' will work on implementin' `transform` an' `setTransform` to perform any transformations.\n\na documentation is planned, but obviously not made yet.\n\nthat should be an easy fix. i'll add that in the next release, ;p.\n\nah, alr, :p.\n\nVEXCESS is on GitHub an' Tuan provided an example of it. Polar's is here [note that Polar took most of the difficult pieces of his library from ski.js].\n`_*https://www.khanacademy.org/cs/-/5081035719622656*_`\n\nyou've already beat Drawlite.js by miles.\n\n@Tuan\nVEXCESS' library is absolutely terrible. suffers from the same rookie mistakes as everyone else's library. the `draw` function is done in the most inefficient manner. only Aliquis out of those 58+ programmers could beat ski.js. additionally, VEXCESS decided that those 58+ others need no credit (line 7 `All other code written by Vexcess`).\n\nfrom the fact that you boast with an immature ego, i take it that you are the banned VEXCESS. regardless, realize that no one on KA will beat ski.js with just a couple weeks."},{"date":"2023-02-17T13:16:55.530483Z","msg":"if they're still 'round, o.O? what makes you think i left?"},{"date":"2023-02-17T12:06:10.960348Z","msg":"boom.\n\ni did?? i have no clue, an' i honestly don't care who \"steals\" as i'm sure it's a very ol' joke, :p."},{"date":"2023-02-15T04:43:03.533779Z","msg":"{\nnames: \"ski, SMV\",\ncaptain: \"ski\",\nlink: \"https://www.khanacademy.org/computer-programming/for-me/5945104410132480\"\n}"},{"date":"2023-02-15T04:42:12.816365Z","msg":"perfect.\n\nalr. i'm honestly chill with takin' a late penalty, :)."},{"date":"2023-02-15T01:27:34.071782Z","msg":"my entry will be submitted late [again smh], but it will still be submitted.\n\nFer Fer (@thelegendferfer) told me irl to just have you look at his bio for his response on this matter since he's too lazy to post. his bio states, \"on ski's team\"."},{"date":"2023-02-15T01:25:37.923009Z","msg":"i have no clue when i'll submit this now. fingers crossed but 'fore 10AM my time tomorrow or we just submit whatever i come up with which might not include functional control panels.\n\nit's bad, -.-. i need to pace out my progress next time or i end up with a mess like this [or what happened the round prior, but ofc i didn't learn smh]."},{"date":"2023-02-14T18:23:32.990989Z","msg":"thanks for clearin' that up, :D!\n\nFer Fer, :). \n\nlol, it might be rigged against Astro since he's my bro an' i'll have him accept my invitation."},{"date":"2023-02-14T03:43:37.713651Z","msg":"i'll take that as a compliment."},{"date":"2023-02-13T13:10:50.368586Z","msg":"all members of team ninjaz are active, but Promise doesn't seem to be able to stay committed for future roundz. [Liftoff pretty much did everythin' for their entry.]\n\neveryone else seems very active; relatively speakin'."},{"date":"2023-02-13T02:37:52.1943Z","msg":"too tired to respond rn, but everythin' sounds (an' looks, :D) good. i'll figure out #2. not sure how #1 will work [it'll just be text], so we'll figure it out when we get there.\n\nthere will only be one large level, so we'll see how i come up with the riddlez.\n\ndone."},{"date":"2023-02-11T19:00:26.372784Z","msg":"you might press space || enter an' a panel pops up for you to type the numbers in based on how many colored dots you counted on the wallz.\n\ncorrection, i have no clue why i phrased it like that.\nhere's my dilemna, i want different surfaces that aren't just rectangular; hence, the line-circle physix on my wip. what my head can't get 'round is how i'm gon' make the blox into irregular shapes. i've thought of maskin' the blox, but i have no clue if that will work or not. first, i'd have to mask the brix, but the part that i can't get my mind 'round is how where i'd position the image since everythin' is centered. lmk if you can think of smth else. might just create a new class called `Shape`, construct all the shapez [irregular blox] in a list called `shapez`. then when i load the level, the last bit will be cachin' all of the shape graphix. would have to place each shape by hand with RegEx parser, but that just might work.\n\nconsiderin' it's an underground prison, go for a darker blue color on the brix.\n\nif you have the time, could you make a darker colored brick background? i'll use it for a parallax feel.\n\nsounds good, :D!\nyeah, it need to at least be square.\n\nedit: the comment in the code is so true lol. i hate the new comment update, >:(."},{"date":"2023-02-11T18:51:52.08871Z","msg":"i could, an' no, it isn't there yet. it's a super simple function that i was too lazy to implement in the first round of ski.js 9 months ago an' forgot 'bout it since.\n\ni might have. i usually delete useless workspaces so i can find the relevant stuff, but i don't recall doin' it recently."},{"date":"2023-02-11T17:25:54.865609Z","msg":"ah, that might be due to the `blur` filter on the svg."},{"date":"2023-02-11T13:36:47.609355Z","msg":"i'm on a potato an' it didn't lag for the minute i used it.\n\none thin' that might be givin' you trouble is that KA doesn't reset `addEventListener` so you have to set `on[event]` instead if you don't want it to crash as you edit, but that's only for dev. \n\ni have no clue why it would be laggin' on your end. SVG is faster than canvas, an' the logic seems pretty straightforward. maybe cache all references to elements at the beginnin' of the script tag?"},{"date":"2023-02-11T00:31:29.536033Z","msg":"smth that just came to mind.\nfirst, how do control panels work?\nsecond, i need the block graphix. they should have a pattern not determined by `random` so i can string 'em together in a long line, :). i need to do some magic ski stuff to make 'em work with my current level planz, so we'll see how that goes.\nthird, i think you're nearin' the end of what you need to do. i'll probs need your help with level creation once i get there, but in the meantime, could you spice up the how an' leaderboard scenez with some animation?\n\nlooks great!\n\nfixed in my spin-off [same as 'fore].\nhttps://www.khanacademy.org/cs/-/6578001542430720"},{"date":"2023-02-10T18:23:02.274675Z","msg":"\"if i recall correctly\"\nthat should be enough if you know where it is on a circle.\n\noh, lol, yeah probs don't want my help."},{"date":"2023-02-10T17:34:41.040769Z","msg":"thanks! they won't if they can get away with doin' what they're doin' now, unless they have the drive to learn more, :).\n\ni've coded my own at one point. it's an add-on to ski.js iirc. you need to know trig, but trig isn't hard to learn ngl. i can help you if you need help."},{"date":"2023-02-10T15:53:02.815992Z","msg":"press space when you touch the blue door."},{"date":"2023-02-10T15:39:15.277442Z","msg":"oh, there's a purposeful error in the code.\nyou should be able to see it now."},{"date":"2023-02-10T15:19:07.147387Z","msg":"lol no. you'll know what i'm enterin'. it'll be huge an' be my most voted program ever, :). you can see it as *brave wip* in my projex. mostly done, but not completely. the to-do list is there as well."},{"date":"2023-02-10T13:46:13.273249Z","msg":"lookin' great, :D!\n\nif you have the time an' feel like addin' more:\ndeletion of files.\ninput on the webpage rather than a `prompt` for new file namez.\nmake some of the toolbar menus functional [i think the wifi/battery/volume or date menu shouldn't be too hard. a challenge might be to include notifications.]"},{"date":"2023-02-10T02:47:27.642344Z","msg":"it does, :D!\nyw, :D!\n\ngreat!"},{"date":"2023-02-10T02:46:48.10967Z","msg":"not well, but he does, :p."},{"date":"2023-02-10T02:25:25.77857Z","msg":"isn't it tho? he's more interested in recreatin' libraries from what i've seen on GitHub."},{"date":"2023-02-09T00:45:47.991194Z","msg":"i sure do, :D! are they your fav cat?"},{"date":"2023-02-08T22:24:38.118213Z","msg":"when auto-correct thinks many is money, o.O.\nyup, xD.\n\n:D"},{"date":"2023-02-08T22:17:56.268634Z","msg":"nope, not at all, B).\nit only has that money 'cuz KA requests the library every time you edit the code, xD, but it makes me look good.\n\nsent you smth on gh [not related to the hackathon-ish] if you could take a look, :)."},{"date":"2023-02-08T22:16:42.215847Z","msg":"uh, you didn't see this."},{"date":"2023-02-08T22:05:14.471182Z","msg":"rats.\nsure, :D!"},{"date":"2023-02-08T21:49:24.540947Z","msg":"idk if we have a gon', but my ol' school did.\nyou could've zoomed in on that crest in the back a lil' more, :p.\nsend an image of all of your PII next pic lol. make sure there's a ton of detail with a clear snapshot, ;p."},{"date":"2023-02-08T21:39:41.224366Z","msg":"xD\nthat's huge, :o. mine are like a foot smaller.\nnah, it's cool lol."},{"date":"2023-02-08T13:54:29.312068Z","msg":"at the very minimum it shows your growth. Levi wanted you to be cap'n over Longtreader, :).\n\nwe were down two entries last round, ;-;.\n\n...\n\noof, that hurts.\n\nhope to see you on the podium soon, ;p"},{"date":"2023-02-08T11:58:44.711693Z","msg":"yup, that's what i set it to, ;p."},{"date":"2023-02-08T03:49:56.731232Z","msg":"done.\nonly thin' i forgot to mention is that peepz are startin' to abuse is `randomSeed` an' ski.js is not gon' implement `randomSeed` as that is WAY too computationally expensive. new code is from lines 2191 to 2224.\n\nlmk if you have any other questions/concerns or if there's smth that's different here from the original."},{"date":"2023-02-08T02:55:25.436517Z","msg":"i was gon' put \"best coder on KA to some\", but those work too, ;p.\n\nsend it to me over there. guesstimates on how big it is [radius]?"},{"date":"2023-02-08T00:06:59.817276Z","msg":"like Astro, i'm confused as to what you need help with."},{"date":"2023-02-07T22:44:39.85335Z","msg":"slightly 'bove.\n\ndon't `lerp` the color, but part of the shape instead [width, height, etc].\n\n:D\n\nit actually isn't, xD. Astro must've voted an' then called on some friends lol.\n\nthat's better, :).\n\numm, in my world, yes lol.\nyou _can_. you _shouldn't_. i'll make the iconz if you want me to, but the pre-built icons are like makin' a game out of emojis. it just doesn't look right."},{"date":"2023-02-07T22:15:41.038417Z","msg":"lookin' great, :D!\n\neh, simple animations would be better. cop lights might be better for a scene transition.\n\nlooks good!\n\nnot me.\n\n\ncould you make the iconz/text in the buttonz bigger [fill 70-80% of the space in the button]?\n\nedit: just double checkin', but you weren't gon' leave the iconz for the buttonz as text, right?"},{"date":"2023-02-07T18:24:34.739845Z","msg":"so, the new t&t format is *crazy* annoyin' when loadin' longer threadz. support center will get a ticket very soon, >:(. but it looks a lil' more professional ig."},{"date":"2023-02-07T17:25:57.681708Z","msg":"more for your info than a need to update the page. it'll be a pain to constantly update the contest page.\n\nyup. my other two memberz had nothin' the night 'fore the deadline [Samwise & TML], so i replaced 'em with Doglover who actually submitted smth. bankin' on this round an' the potential inactivity plague for everyone else."},{"date":"2023-02-07T15:04:20.577552Z","msg":"@IA\ncan confirm that FF is subbed to this thread.\n\n@ALL JUDGEZ\nif y'all could post your breakdown on the individual programs that you judge, i'm sure all the contestants would appreciate it, :). you'll be scorin' each entry with the breakdown anyways (creativity, complexity, output, design, etc.), so it should be a trivial matter to post it in a new t&t.\n\nif you're havin' a rlly good day, short explanations for the score like Liam had posted in the news thread would be tremendously appreciated, :D."},{"date":"2023-02-07T14:56:14.577741Z","msg":"just a quick update.\nwe obviously don't have Samwise anymore, an' we don't have HS either.\nthey've been replaced by Promise [which you already know].\ni think you left Liftoff out of my team on the homepage lol. i think i didn't mention which memberz have left so you naturally assumed Liftoff was one of 'em?"},{"date":"2023-02-07T14:11:47.751212Z","msg":"perfect!\n\ni don't think the trees fit with the filter, no?\n\nedit: my progress. might not seem like much, but the jump logic took forever.\n`_*https://www.khanacademy.org/computer-programming/-/5945104410132480*_`"},{"date":"2023-02-07T13:28:11.438164Z","msg":"smth like that yeah. a few kinx are missin' in your logic, but i can work 'em out.\n\nthe new menu runs at an 20fps. not sure if you're still workin' on it, but all scenes need to run at 60fps, ;p. you should just be able to cache the menu background in an image an' then draw the background to restore the fps. [i mean i got a 5000+x2000+ image to run in the background at 60fps, so i think it would restore the frame rate]"},{"date":"2023-02-07T11:21:34.61529Z","msg":"if the arms are made from a number of complex shapes used for detail an' structure, then they will need to be cached as an image. otherwise, they won't."},{"date":"2023-02-07T03:16:47.597588Z","msg":"@Timothy\nwhat happens when you can do this? would you still hate `config`? don't need to type it all out anymore, v(o.o)v.\n```\nfunction Class (config) {\n    Object.assign(this, config);\n}\n```"},{"date":"2023-02-07T02:55:42.983571Z","msg":":)\n\noh here's the reference.\n`_*https://www.khanacademy.org/cs/-/6700758398976000*_`"},{"date":"2023-02-07T00:20:29.078237Z","msg":"i think the reference i'll link below will work if you'd rather not do limbz. i don't think we need legz, so armz should be fine, ;p."},{"date":"2023-02-06T23:47:39.506603Z","msg":"not necessarily. i might cache individual limbz if they are intensive enough."},{"date":"2023-02-06T22:22:16.039016Z","msg":"gunz. i have bowz an' swordz in *brave*. don't care if they want to hide it. their loss.\n50x50. keyz could work.\nuh, idk if i have enough time for that, but i'll put it on the list.\n\nyup."},{"date":"2023-02-06T21:52:55.179574Z","msg":"that sounds perfect.\nstart with breakout then work our way to the chase.\ncontrol panels to open doorz, knock out guards with weapons they drop, an' any other functionality you can think of.\n\nnormal ol' block graphix in a 50x50 square."},{"date":"2023-02-06T13:21:01.014435Z","msg":"i've completed the fixes in this spin-off, ;p.\n`_*https://www.khanacademy.org/cs/-/6578001542430720*_`\n\nso, the body an' the head look great, but i think limbz would look better than handz. the handz look a lil' out of place atm."},{"date":"2023-02-06T03:22:41.769051Z","msg":"thanks, :D!\n\ni didn't release it. it's an ol' workspace i used for  this, :). the release will be much better, but i'll finish it when i have the time."},{"date":"2023-02-06T00:38:28.603712Z","msg":"it is fixed here. didn't want to tamper with the original in case it disqualified the entry.\n`_*https://www.khanacademy.org/cs/-/5768518536839168*_`"},{"date":"2023-02-06T00:23:15.914324Z","msg":"rlly? i'm surprised. i expected to be deducted heavily for messy code/lack of commentin'.\n\nin theory, it is. the biggest issue is that other enemies are obstacle an' they are mobile. additionally, the whole map isn't set up in a grid form, so literally any common pathfindin' algorithm is thrown out the window. a freeform pathfindin' algorithm is the only option, but existence, much less implementation, of such an algorithm that is widely available to the public is none.\n\nbiggest issue there is performance, but that was certainly a possibility i overlooked. i'll look into that for the release.\n\ni fixed that bug after i submitted the entry. just needed to move where the collisions took place, but your idea would've worked as well."},{"date":"2023-02-06T00:00:58.178117Z","msg":"i fixed all of the issues with a few fixes.\n\nbuttons:\nyour issue is that the collision function is set to the wrong mode. you're usin' `rectMode(CORNER)` when the button is drawn, so the collision function needs to know the same. add the argument `0` after the other arguments in the collision function. you'll need an `else` statement afterwards to change the color back, but it works like a charm, ;p.\n\nimages:\nnot sure what went wrong with `draw` or the characters. uncomment the `load` function an' use the code below. lmk if you don't understand any of it or it still doesn't work.\n```\nlet scene = 'load'\ndraw = () => {\n    switch(scene){\n        case 'load':\n            load(graphics, 'hello')\n        break\n        case 'hello':\n            menuScene()\n    }\n}\n```"},{"date":"2023-02-05T23:52:29.215851Z","msg":"i'll be sure too, ;p.\n\nso, the first one takes a point `{x, y}` an' checks to see if is in a rectangle `{x, y, width, height}`. the second does the same except for a circle `{x, y, size}`. they both return true if the point is inside of the shape. the first one just does a bunch of boolean checks, the second uses the distance formula to determine the distance of the point from the center of the circle relative to its size.\n\nare you doin' that to annoy me with a fangirl approach? if so, it's very, very effective."},{"date":"2023-02-05T00:44:55.279939Z","msg":"haven't tried to work on it yet, ;p."},{"date":"2023-02-04T16:24:02.42372Z","msg":"not done debuggin', ;-;.\n\nlol, i'd rather you ask for the parts that aren't workin'/you don't understand, ;p."},{"date":"2023-02-03T22:43:39.352085Z","msg":"oh, wow. didn't even know that happened. my bad there.\n\nso, the short answer is not rlly. the way `randomSeed` works forces me to basically reinvent `random` in a rather inefficient manner an' with math i don't understand. i could make p5.js' code better, but it's a huge class rather than one function, so idk how that would go.\n\ni have some recommendations for replacements."},{"date":"2023-02-03T21:52:47.752281Z","msg":"alr, which KA program would have the highest score?\n\nvery. keeps stalkers at bay."},{"date":"2023-02-03T21:51:23.233665Z","msg":"you can have the ellipses swing with the wind usin' trig an' `frameCount`, or even better `lerp` an' `random`, but ski.js functions exactly like PJS in this respect.\n\nyup."},{"date":"2023-02-03T21:35:57.798356Z","msg":"@Agent X\nprovide a program that deserves a 10 then.\n\nmy teammates an' i do have a homepage, but we don't rlly use it. all chat is in a private repo on GitHub."},{"date":"2023-02-03T21:31:48.17581Z","msg":"the simplest, best way is to simply cache the image with `get` an' then display, ;p. \n`randomSeed` actually wouldn't help you there. that's only for when the program reloads, but it still generates random values every frame."},{"date":"2023-02-02T23:05:55.871879Z","msg":"you have to import the filter script, but yes."},{"date":"2023-02-02T21:36:53.172359Z","msg":"@ALL\nwhy don't we all just move to the new thread, :). just sort the t&t by recent, look for CBF's comment, an' you'll find everyone there, ;p.\n\n@AGENT X\nan' the low scores come rainin' in, o.o."},{"date":"2023-02-02T20:35:42.323542Z","msg":"yep.\n\npineapple?"},{"date":"2023-02-02T17:14:29.47741Z","msg":"SMV has added you to the repo.\n\ngreat, :D! the challenge has already started, so you can start workin' whenever you're ready, :)."},{"date":"2023-02-02T13:19:07.522865Z","msg":"all 3 rebuttals an' the original program you spun off of 'fore it was hidden.\ni could argue 'bout this for days tbh, but in reality, it doesn't accomplish anythin' if others don't see it.\n\nyou can't stop voters. there's too many of 'em an' you can't contact 'em all to address the situation. even if you did, the next day you'd have 10 more voterz to address. rather than address votin', you'd need to address the creation of the projex. i only addressed the situation when i knew that the two creatorz were familiar with the community an' its expectations.\n\nSMV linked that one an' her rebuttal, but i hadn't seen this program yet, ;p."},{"date":"2023-02-02T13:09:24.030925Z","msg":"we're on GitHub in a private repo, ;p. if you have GitHub, i can send SMV your username to add you to the repo. if not, are you able to create a GitHub acc? i can make arrangements if you can't.\n\npretty much. HSstudent16, Samwise, an' TML. not necessarily due to inactivity, but that's not too important.\n\ncorrection, how comfortable would you be with makin' SVGs for a webpage Liftoff is makin'?"},{"date":"2023-02-02T00:42:50.513717Z","msg":"thanky."},{"date":"2023-02-01T16:42:01.22816Z","msg":"thanks!\nit's not finished yet, :(.\n\nthe only kind of gamez i make."},{"date":"2023-02-01T15:18:38.15835Z","msg":"take a look now, ;p."},{"date":"2023-02-01T15:18:29.659514Z","msg":"it was. got smth together, but expect to see a slightly improved version on the HL soon, :p."},{"date":"2023-02-01T15:18:00.611847Z","msg":"fixed.\nit sure is."},{"date":"2023-02-01T15:11:44.403486Z","msg":"submitted. tryin' to fix the bugz elsewhere rn. \n\ni'll respond to the rest of your wonderful comments later, ;p."},{"date":"2023-02-01T14:55:48.674715Z","msg":"```\n{\n    names: \"ski\",\n    captain: \"ski\",\n    link: \"https://www.khanacademy.org/cs/-/4592469715238912\"\n}\n```"},{"date":"2023-02-01T14:07:09.80927Z","msg":"argh! there's a bug that i can't fix that no one seems to know the answer to, >:(. i don't think i noticed it in my backup."},{"date":"2023-02-01T02:27:53.746427Z","msg":"gettin' up early tomorrow to finish it. i'll deal. HS had better show up or he's kicked off for inactivity, ;-;. might get marci/The Lich King to replace him if that happens. in either case, we'd have to pair up differently. i'd have to work with Liftoff as no one else is a web dev, =/.\n\nnot that i can use.\n\nyeah...\n\nrespond to that tomorrow."},{"date":"2023-02-01T00:25:34.141273Z","msg":"it's at a relative's house miles away.\ni have enterprise enrollment, so the only way to unenroll the chromebook is to get a new one. \nnope."},{"date":"2023-02-01T00:08:34.679632Z","msg":"that would assume i have my PC, :(."},{"date":"2023-01-31T23:18:57.958643Z","msg":"yes, but i can't access the terminal due to administrative restrictions.\n\nyeah, not on a PC, :(."},{"date":"2023-01-31T22:27:12.602452Z","msg":"it's stored locally, but they're stored in whatever file location i have up at the time. the file search would take hours if i left it runnin' an' i have work to do that would hinder the search, =(. there's no order to the madness, so i can't just find the most recent script an' i forgot the name conveniently so i'm in deep trouble rn if i can't find it. might just recode it at this point an' that might work just as fine ngl."},{"date":"2023-01-31T22:14:27.73986Z","msg":"oh an' if you ever wonder why i have this many backups, it's due to the fact that my school chromebook keeps crashin' in dev (like the whole screen turns black for a full 10 seconds 'fore it goes back to normal an' lags out), so i keep a bunch of backups whenever that happens so i don't lose progress."},{"date":"2023-01-31T22:09:42.986194Z","msg":"i meant bakin' powder lol. we just call it cocoa powder here, ;p.\nstore-bought powder tastes like mud.\n\nargh! can't find the copy. have this partial WIP backup here, but i can't find the right script. have to go an' i don't think i'll get back on 'till late tonight, but the entry should be submitted by the morn' or early in the morn'.\nyup, that's me, xD."},{"date":"2023-01-31T15:55:17.312089Z","msg":"@Liam\nmy program was completed 'fore the deadline last night, but my browser crashed. i have a backup at home, but that would be later this afternoon. i'm willin' to accept the late penalty but wanted to give you a heads up that there's an outstandin' entry."},{"date":"2023-01-31T15:31:08.470694Z","msg":"yup, :D!\n\nwhat brand of cocoa powder do you use?\n\nthanks, :D!\nthey probs will. probs gon' submit after i get home 'cuz it doesn't appear to be in my private repo. tbh, it's pretty fair if they decide to dock points. i'll still ask, but don't expect a favorable response. doesn't help when i have hundreds of snippets with names like \"o.o\" or \"yusss!\" or \"meh\" or \"WHY WON'T THIS WORK?!\" or \"idk what a computer is\" or \"i'm a terrible fool\"."},{"date":"2023-01-31T12:00:10.478869Z","msg":"gettin' there. almost found it."},{"date":"2023-01-31T11:16:50.408062Z","msg":"so, good newz: i finished last night. bad newz: my computer lagged out an' crashed my browser. i have the script saved somewhere on my comp but it's hidden somewhere, so i'm not gon' count it late per se. Liam won't care as long as it's 'fore he wakes up as it's still midnight somewhere else in the world, ;p. currently testin' a bunch of different versions rn.\nyeah, :D!"},{"date":"2023-01-31T02:10:06.344932Z","msg":"no my color schemes lol.\n\nfrom experience that doesn't work, but that's a discussion for another time.\n\ni tried that an' then the sword couldn't move in tight spaces,, :(.[yes, two commas for a reason]\n\nfor you not me.\ni have lil' under three hours."},{"date":"2023-01-31T01:24:33.333404Z","msg":"they are quite terrible lol.\n\n:p\n\ntrue. i can submit it for 'em if need be.\n\noh dear, o.o. are you better now?\nwell, you did, :).\nyes, it was.\n\ngtg for now. spent the last 30 minutes on utter garbage that i just discarded on sword logic [when to count the collision as a successful attack, hard to figure out what the right balance is since we can't have the sword goin' through wallz but what happens if it goes through the player an' then to the wall?]."},{"date":"2023-01-31T00:01:06.168375Z","msg":"perfect, i'll that in.\nthanks, :D!\ni admit, i suck at graphix but i might give it a whirl when i completely finish my collab with bronte.\n\nso you want a hot cocoa out of necessity an' then dedicate it to me? \n\nDL shouldn't be submittin' for this round i don't think.\n\nwas your bio from earlier [i have a screenshot of it] for me? wanted to let you know i saw it if it was, an' i truly appreciate it. kindest thin' i've heard since Christmas, :)."},{"date":"2023-01-30T22:33:18.956346Z","msg":"what do you think?\nit's just a normal book, but i'll let it pass, ;p.\n\non my behalf lol."},{"date":"2023-01-30T22:17:27.549471Z","msg":"'ello, :D!\n\npillowz shouldn't be this hard to make.\n\nyup. i have.\ngon' have dinner soon enough."},{"date":"2023-01-30T21:27:01.09806Z","msg":"perfect, i've sent your username over so you can be added to the thread, :D.\n\na quick rundown for what you need to know.\nSMV will send you an invite to our repo [stands for repository which is a bunch of code for a certain project] within the next 24 hours. you will accept the invite (you should receive a notif; click on the bell in the top-right corner) an' navigate to the \"Discussions\" tab. should be straightforward from there, ;p."},{"date":"2023-01-30T21:13:27.15758Z","msg":"my potato of a school chromebook can view it lol."},{"date":"2023-01-30T15:43:07.414238Z","msg":"posted a stack overflow question to see if someone else knows. no existin' question had an answer.\n\nyeah, not a good solution, but if you're desperate, you're desperate, :p.\n\nyw, :D!"},{"date":"2023-01-30T14:46:05.153601Z","msg":"as to your note in the other thread on IPs, i can't find anywhere that GitHub states that it shows IPs to others.\n\nevery website you visit sees your IP [that includes GitHub] an' GitHub sees your general geolocation based on your IP [like every other website can; most certainly Google] [such as you live somewhere near Richmond in my case, but i live miles upon miles away in a suburb]. GitHub doesn't share location [SMV can testify lol] or IP based.\n\nall info stated 'bove can be found in GitHub's privacy statement in case you wish to know deeper specifics or are still concerned. if they did share IPs, the 100 million+ devs on GitHub might not be there since they know much better than any of us the danger of publicly displayin' your IP address.\n\nTL;DR GitHub doesn't show any info related to your IP includin' geolocation to others [unless you decide to], but stores it privately for GitHub's purposes.\n\nif you still don't feel comfortable usin' GitHub, i'll see if there's another method we can communicate on KA w/o others seein'."},{"date":"2023-01-30T13:58:42.329408Z","msg":"@Doglover\ndue to the time crunch, SP's activity [our other new member, :D], an' round 2 bein' right 'round the corner [starts tomorrow], your entry will be in PJS.\n\ni'll be creatin' a quick course for SP to explain the new syntax/features for round 3, so all entries afterwards should be in the web environment which doesn't mean much for you but wanted to give you a heads up, ;p."},{"date":"2023-01-30T13:54:01.954205Z","msg":"all i can ask for, :).\n\nin the news thread, i think. this theme's challenge [which you won't participate in as the deadline is midnight today] is *Team Logos*.\n\ndo you have a GitHub acc an' if not, is it possible for you to make one? our chat thread is over there to prevent stalkin' an' it's an excellent tool for collabs."},{"date":"2023-01-30T13:46:46.832389Z","msg":"@Liftoff\n85% complete. should be done by the end of tonight.\n\n\n@ALL\nnew deadline is midnight tonight. less than 24 hours to put smth together, :)."},{"date":"2023-01-30T11:43:29.288934Z","msg":"i don't want to put you in a situation you don't want to be in, :). the comp usually requires each participant to work for 3 to 5 hours a week.\n\nthere are themes, but they aren't strict so you don't have to follow 'em."},{"date":"2023-01-30T10:38:38.462113Z","msg":"try now. i was importin' a script that existed when i created this example but no longer does. [faulty `src` attribute]"},{"date":"2023-01-30T10:27:08.888584Z","msg":"hi, :D!\nyup. Bluebird's script has never truly worked an' the API was taken away so Liftoff's method doesn't work either.\n\nso, yes an' no.\nyes, there is a way, but it's certainly not easy by any means.\nnormally, you could just set the `src` of an image to the base64 data an' call it quits, but you're on KA an' that's a CSP violation.\nto get 'round that, you'd have to draw the image off-KA on a canvas, get the `ImageData` that results, compress the image data, so it isn't a monster to save, then decompress the image data here an' draw it on the canvas with thumbnail.js. the compression part is not smth i'm familiar, but i'd be willin' to give it a go. if i could figure out how to do that, it'd pretty much be the equivalent of an Imagenator but not just for a singular data type (i.e. PNG or JPG). the compression would be hosted off-KA on GitHub.\n\noptionally, you could just upload your image to wikimedia an' then display it with thumbnail.js. your screenshot is now on the internet for anyone else to use, but that's already the case with your webpage since it's under the MIT license."},{"date":"2023-01-30T02:19:37.039254Z","msg":"```\nI am not the one to say, \"I'll do it in the mornin'\"\nI'd rather get it done, don't focus on what's not important\n``` - _Green Lights_ *NF*\ni'll probs stay up 'till it's done, 'cuz i can't let myself leave it unfinished. i just can't do it.\nthere's more in my head then that, but i've gotta get to bed. see ya in the morn', ;p.\n\ni did. i'll ask SP real quick. Fireball won't cut it as there's so much to learn if you're goin' to be a game dev for me an' i need someone who knows at least a lil'.\n\ni'd move this convo to gh if you wish to continue it."},{"date":"2023-01-30T01:00:35.624838Z","msg":"as you can tell, i freaked lol.\n\nso much work to do. so lil' time to do it. won't be able to work on brave 'till 4PM when i get back from school an' then i have to grind it out 'till it's done [which might be into the wee hours of the morn', ;-;]."},{"date":"2023-01-29T23:35:20.034197Z","msg":"oh, that i was moderated due to my post on the new Karlson as it claimed that i had no notifs ever."},{"date":"2023-01-29T20:43:16.694962Z","msg":"does that make ChatGPT your bff, xD?"},{"date":"2023-01-29T20:11:32.196387Z","msg":"3 captains an' Liam agreed that was a better idea, ;p.\noh i meant tuesday as the release day lol.\n\nscore-wise FF's might win dependin' on how polished my entry will be.\n\nuh..."},{"date":"2023-01-29T20:04:20.415873Z","msg":"due monday at midnight [deadline got pushed back]. submit the wip for CoC an' release the actual project monday.\n\ni don't think you've seen FF's entry as of late, :p. his is more polished than Levi's or mine, but might not garner the same attention.\n\nyeah..."},{"date":"2023-01-29T18:26:51.519348Z","msg":"you haven't seen it in its full glory yet. once you see it tuesday, you'll see that the only similarities between valor an' brave [my entry] are the dev [me] an' the genre [fps].\n\nLevi's could certainly rival brave, but i'd say they're 'bout equal.\n\nname of a classmate. peepz were tryin' to label him as an HTML tag, so i made this, :p."},{"date":"2023-01-29T13:28:37.057391Z","msg":"@CBF/Liam\nmind if the deadline is pushed back 12 hours to 11:59 PM mountain time on monday?"},{"date":"2023-01-27T19:57:21.660451Z","msg":"in ski.js? i just added a function `loadFont` where you just enter the font name.\n\nelsewhere? `_*https://www.khanacademy.org/cs/-/5442003232145408*_`"},{"date":"2023-01-27T18:16:10.701822Z","msg":"yw, :D!\n\nyup. what goes on behind the scenes to display KA graphix.\n\ni have a demo here. literally the same as PJS.\n`_*https://www.khanacademy.org/cs/-/5099165982179328*_`\n\nnope. ES6 looks like this. there's more to learn, but it's not much for graphix devs.\n```\nfunction function_name (params) {\n    //KA allows these\n}\n//an' this\nconst function_name = (params) => {\n    //pretty much the same thin'\n}\n//what you might be used to\nvar function_name = function(params) {\n    //good ol' KA nonsense\n};\n```\n\nSMV's program was goin' to be converted after she released it, but given her current schedule she said she couldn't. to be clear, i could copy an' paste the exact same code into ski.js an' it would run fine. the only major difference that i encourage for graphix devs is function definitions [what i discussed 'bove]. i think i phrased it wrong 'fore. i strongly encourage the use of ES6+ syntax an' ski.js, but if you can't do it due to a busy schedule, i'm obviously not gon' be unreasonable. it shouldn't be too hard as you just declare functions differently. i can't rlly think of anythin' else you do differently.\n\noh an' you can import Google Fonts if you care to."},{"date":"2023-01-27T16:47:00.409395Z","msg":"sure thing, ;p."},{"date":"2023-01-27T16:05:44.535531Z","msg":"nope, you get to choose if we can see your email. i think you have to fill out a field intentionally for your email to appear publicly, ;p.\n\nsounds good to me, :D!\nidrc if you decide to use the canvas API instead, but my library is more user-friendly.\nthree main reasons as to why.\n1.) bigger projex can be created with ski.js' efficiency. PJS severely limits the creativity you can express with its terrible inefficient functionz.\n2.) it's a learnin' experience. everyone can now use ES6+ syntax an' featurez which makes codin' easier, not harder or more complex. ski.js also has additional functionality [mostly filters an' the new `curve` function] that can open up new opportunities.\n3.) last an' i think least, entries score higher if only by a slim margin. it just looks more impressive to some of the less experienced judges [every judge looks at every program].\n\nsounds good to me, ;p."},{"date":"2023-01-27T15:33:43.630208Z","msg":"to your question, only if you want to. the other two members are still technically on the team an' i can get 'em to submit a small smth if need be, but if you feel up to the challenge [deadline is monday] i can replace 'em now as the progress on the first round project would be the same."},{"date":"2023-01-27T15:30:26.468927Z","msg":"worse, laziness. they report to the chat thread but show no progress on their projex despite my urges to get movin'. i kicked 'em out lol an' went lookin' for peepz who ik would put in an effort.\n\nso the site itself is a dauntin' prospect that's meant for professional developers an' i don't even know 1% of the website other than the rlly simple stuff. however, we use the easy part of the site. you create an account an' give us your username. we invite you to a repo [short for repository. it stores a bunch of code]. you accept the invite [there's a notification bell that automatically updates] an' go to the repo. click on the \"Discussions\" tab an' you'll find our chat thread there.\n\noh, smth that you might want to know is that you have to use the web environment/ski.js on my team [for reasons i can provide if you care to know 'em], *but* you pretty much code graphix as you would in PJS (i'm not even sure there would be any difference for you). your first challenge doesn't start 'till monday, so ask any questions you have 'till then, :D."},{"date":"2023-01-27T15:20:25.471602Z","msg":"hi, :D! works was done on GitHub durin' my ban, so i'll need to port it over when i get the time, ;p."},{"date":"2023-01-27T14:55:19.50465Z","msg":"two members were given two weeks to complete one project. one has nothin' done an' the other has just barely started [not even 75 lines of code]. as long as you have a few hours every week, i can't ask for anythin' more, :p.\n\ndo you have GitHub an' if not, can you make a GitHub acc? we have a private chat over there an' it's a great tool for collaboration, :).\n\nglad that i could offer you a spot in CoC, ;p."},{"date":"2023-01-27T14:46:50.128646Z","msg":"that tells you how desparate KA is for decent content, :(.\n\nhmm, i'm not so sure.\n\n:D\n\nsame to you, ;p."},{"date":"2023-01-27T14:26:46.746135Z","msg":"me neither.\n\nthe nicknames i have earned, -.-.\n\nbtw i'm still workin' on our collab, :). slowly. very slowly."},{"date":"2023-01-27T14:01:39.290563Z","msg":"perfect, thanks for the advice. i'll start askin' 'round right away."},{"date":"2023-01-27T10:14:51.284301Z","msg":"not crash, but runs at <5 fps.\n\nChrome 107."},{"date":"2023-01-26T22:41:01.989621Z","msg":"wdym? i voted."},{"date":"2023-01-26T22:38:58.675406Z","msg":"true.\n\ni don't think CBF has been 'round for everyone mentioned in this thread.\n\nto note, Tectonic Horizon an' Sim G. were the same person, :p."},{"date":"2023-01-26T22:14:26.483155Z","msg":"@Liam\ni'm srsly considerin' bootin' two peepz off the roster once the round ends for lack of effort despite consistent reminders that they need to work if they want to be in CoC. one still hasn't started an' one has just barely started. just makin' sure it's legal."},{"date":"2023-01-26T22:09:53.437539Z","msg":"@ALL\nstop makin' me feel ol', >:(. i was 'round when all of these peepz were active an' now i'm gettin' nostalgic.\n\nthe greatest graphix creator of all time. no cap. don't even try to argue with me. i'll fight you if you disagree.\n*kaid_1182432396044358055856640*"},{"date":"2023-01-25T21:13:10.17384Z","msg":"ah, what kind of card game?\n\nstill workin' in Unity?"},{"date":"2023-01-25T21:12:26.208781Z","msg":"i said \"one of the greatest\" an' y'all seem to have thought i said \"greatest\".\n\nsure there are tonz of great graphix on KA, an' this one just joined the ranx, :)."},{"date":"2023-01-25T15:39:45.727816Z","msg":"now's the time for \"chap\" to make a comeback lol."},{"date":"2023-01-25T13:40:14.188026Z","msg":"yw, :D! i think this might have more votes in the end than my highest voted project [tutol sits at 102].\n\nwait 'till after CoC to release any of that content, xD.\n\ni concur."},{"date":"2023-01-25T13:34:12.619497Z","msg":"congrats on 100+ votez, :D!"},{"date":"2023-01-25T11:05:22.165837Z","msg":"ofc. fantabulous.\nin America, we don't care lol. doesn't matter who you are, it's pretty normal to be called dude. i think i originally got it from Captain Argon a couple years back [i'd read it in the original Sherlock Holmes books as well, i think]."},{"date":"2023-01-25T11:02:33.778673Z","msg":"@Steven\nthe best way to send your message would be to save it in the comments of a new program an' send me the link to it, :p."},{"date":"2023-01-25T02:45:06.503815Z","msg":"more like dock points for thinkin' i over-engineered it.\n\nalr, thanks, :D!"},{"date":"2023-01-25T02:18:23.435623Z","msg":"yw, :D!\nabsolutely crazy graphix dev.\n```\n_*https://www.khanacademy.org/profile/kaid_452123408199832603770169*_\n```\nit's not bad, chap. not bad at all, :p."},{"date":"2023-01-25T01:32:30.724057Z","msg":"somewhat off of what Henry said, i'm afraid that my code might not be understood well not 'cuz it's overly complex [it could be done more inefficiently with simpler methods] but that the level of complexity needed might be beyond what most judges will know. for example, there will be a RegEx parser for level creation. i'll do my best to explain, but the judgez need to understand RegEx to understand my code without just takin' my code for what the comments say.\n\npls let me know if that doesn't make sense, an' i'll be glad to clarify, :D."},{"date":"2023-01-23T20:04:25.741277Z","msg":"that's a surprise, o.o.\n\nthank you, :D!"},{"date":"2023-01-23T17:34:56.555431Z","msg":"ngl, that collab took more effort than this. not that this isn't a good project, but it took 3 days of non-stop work from the three of us to get it to a mediocre level."},{"date":"2023-01-23T01:22:42.74521Z","msg":"@IA\nthen zoom out lol.\n\n@Astro\ni'll one-up you with 16 space indentation, ;p."},{"date":"2023-01-23T01:10:28.622455Z","msg":"get a bigger editor, :p.\n\nit's called laziness lol."},{"date":"2023-01-22T23:17:14.03706Z","msg":"@IA\ntwo space? :( four space? B).\n\nyup. it's a quote from DR. i can send you a link to it if you want it."},{"date":"2023-01-22T10:50:12.596916Z","msg":"@Noah\nit was a joke lol."},{"date":"2023-01-22T02:19:46.447041Z","msg":"@Paperwad\nit would screw with the schedule too much. i'd prefer if we didn't extend the deadline for TheDark."},{"date":"2023-01-22T00:59:04.015313Z","msg":"how much you sellin' it for? if it's a new sub page, i'll but it, :p.\n\nyou're free to hold your opinion. i'm free to hold mine. i'm not here to win but learn. you can't learn if you're not willin' to put in an effort.\ni don't ask for the best work. i don't ask for the greatest programs KA has ever seen. i don't ask for the highest scorez. i only ask that i see effort. no effort, no spot on my team."},{"date":"2023-01-22T00:35:46.237983Z","msg":"you knew it was comin'.\n\nyeah, that might happen to a few members very, very soon 'cuz i see that you've gotten some blox down. they literally have one `rect`. that's it, smh.\n\noof.\ngo DR for livin' in the past, :p.\n\no.o\n\nlol surprised you did that.\ncontradiction, o.O? where?\n\nsir, how does it feel to have your quote in ski's bio?"},{"date":"2023-01-22T00:17:08.457646Z","msg":"can't wait to see it, :D!\n\n```\nhow could you doubt me?\ni've always delivered.\nrippin' the teeth out\nof the back of my mouth\nis the closest you'll get to my wisdom.\n```\n_CLOUDS (edit)_ *NF*\nsrry. i had to, :p.\n\nthis is what happens when you go to team Astro, smh.\n\nyou must change it, xD.\n\n```\nhttps://www.khanacademy.org/computer-programming/spin-off-of-ice-slide-wcc/6116887574659072/latest.png\n```\nliterally impossible to beat that.\nget rekt. you thought you had me.\n\nikr? so many peepz will read my post an' think i have bias, but i rlly don't. glad that you see it the same way, :).\n\nedit: yeah! you added the proper title to the ASCII art, :D!"},{"date":"2023-01-22T00:06:31.615252Z","msg":"@Noah\nor you can use ```ctx.globalCompositeOperation = 'source-atop'``` which looks a lot simpler than any maskin' tutorial ngl, :p."},{"date":"2023-01-21T20:05:10.58407Z","msg":"i mean `var` attaches each variable to the global `window` an' `globalThis` object, so you have a point, :p."},{"date":"2023-01-21T19:22:18.758838Z","msg":"some peepz spend their time huntin' down PII.\notherz give PII away for free so they don't have to hunt it down.\nv(o.o)v"},{"date":"2023-01-21T19:07:49.485881Z","msg":"41 minutes ago\n38 minutes ago\n29 minutes ago\n27 minutes ago"},{"date":"2023-01-21T18:26:12.23417Z","msg":"not in an unexpected sense but more of a curious, unpleasant phenomena.\n\nam i surprised? nope. \ndo i like it? nope. \nwill i put up with it? yup."},{"date":"2023-01-21T17:16:04.171306Z","msg":"did i ever claim that anyone did anythin' wrong [even KA]? i don't think so. all i agreed with is that KA's activity levels are at an all-time low. \n\nKA can handle the situation as they like; it's their site an' we live with their decisions. Emma can create whatever projex she wants to; that's her choice. can i still find it slightly curious that voterz shot this project to the top of the HL [which is no fault of Emma's]? i hope so.\n\n@DR\ntoo true. almost earned my vote ngl."},{"date":"2023-01-21T12:33:19.4154Z","msg":"\"This speaks more-so to how KA is pushing their sites activity levels so *low* that the best coders left\""},{"date":"2023-01-21T02:50:22.866951Z","msg":"how low can ya go? time to find out, =/."},{"date":"2023-01-20T23:19:05.499301Z","msg":"woah, y'all took it too far. i never claimed this was low kwality. i never criticized the program whatsoever. i only said that it wasn't acceptable for the voterz to send this project to the top of the HL not that the creator did smth wrong."},{"date":"2023-01-20T22:18:10.509159Z","msg":"@Samwise\ni think Liftoff means from the HL.\n\nif you could go check the team chat thread on the other place, it would be greatly appreciated, :D!"},{"date":"2023-01-20T22:00:55.810087Z","msg":"@Dat\nit's not public 'cuz they hid it purposefully. did the same for another support post i made an' if you end up with the same case as mine, it will silently be deleted without any response, :)."},{"date":"2023-01-20T21:45:51.962869Z","msg":"just 'cuz it's happened 'fore doesn't mean it's any more acceptable."},{"date":"2023-01-20T18:22:07.958091Z","msg":"nah, it's fine. the Guardians have rlly weird pet peeves to get used to, ;p.\n\nyou're welcome, :D!"},{"date":"2023-01-20T14:09:15.940565Z","msg":"@IA\nthey are still active an' post in the team chat everyday, but they simply won't work on their entries. it's not inactivity but lack of grind [what a wonderful euphemism lol] that's killin' me team rn."},{"date":"2023-01-20T13:55:24.300031Z","msg":"@CBF/Liam\nhypothetically, let's say that i have a library. i add to this library for my entry to fit my needz, but the library as a whole wasn't created for the comp. is the addition still judged or no?\n\nat what point can we not reuse code? i remember last year it was when the homepage was released, but wanted to see if there were any adjustments to that policy.\n\ncan we kick peepz off the team for not performin' even tho they're technically \"active\"? not just for a day or two, but for nearly a week where they have not touched their entry whatsoever despite constant proddin' from their captain to just start. i think a warnin' first would be prudent, but i wanted to see if i have that capability 'cuz i didn't sign up for a third of my team to vanish into thin air."},{"date":"2023-01-19T22:12:33.228505Z","msg":"there's your problem. school-issued Chromebooks are never up-to-date with bug fixes an' updatez due to administrative restrictionz."},{"date":"2023-01-19T21:14:03.642234Z","msg":"looks beautiful!\n\nit sure makes life easier, =P.\n\ncurious to know why you import my least fav library in the header, o.O."},{"date":"2023-01-19T11:26:16.707381Z","msg":"@Liftoff\nuh, thumbnail.js can't fail. you have to replicate the thumbnail in a PJS format(ish) for it to show up when you press escape. it's the only surefire way that you can get a thumbnail.\n\n@SMV\nwake up at 5 everyday an' go to bed at 10. that's the way i grind, =P."},{"date":"2023-01-19T10:44:09.544592Z","msg":"@Liftoff\nthumbnail.js, =P.\ni think the API method doesn't work after they moved over to a new API, =/."},{"date":"2023-01-19T02:21:45.763589Z","msg":"yup.\nDell has nothin' to do with what's supported an' what isn't. you are either on an ancient version of Chrome when IE was still a youngin' or smth else is wrong, :p."},{"date":"2023-01-19T00:42:17.766085Z","msg":"@Blind Scribe\nyou do realize that you can't access KA with IE anymore, right? so Astro has no need to include `forwards`, =P."},{"date":"2023-01-18T23:37:33.750552Z","msg":"i think i push an object into each one in ski.js, but in reality, you can just check the length of the vertex array. i think the spread operator will be of use to you very soon, ;p."},{"date":"2023-01-18T20:37:40.083398Z","msg":"@Cowboy\nmore reasonable doesn't mean that the main topic isn't any less mature or rational.\n\ni hadn't realize you had posted. that was to WinstonWinner000. my bad."},{"date":"2023-01-18T19:53:14.600887Z","msg":"you don't get it lol."},{"date":"2023-01-18T19:40:25.881853Z","msg":"i love how you managed to turn an educational contest into a matter of equity lol. give the man a prize, only a handful have that kind of talent.\n\ngl on your future projex btw."},{"date":"2023-01-18T18:33:42.165648Z","msg":"@Liftoff\ni don't know if you care to fix it, but the current thumbnail is messed up."},{"date":"2023-01-18T17:18:18.910304Z","msg":"'ello!"},{"date":"2023-01-18T17:15:09.923413Z","msg":"if possible, i'd prefer if we send any confidential messages [messages regardin' current projex or plans for the future] to stay on GitHub, :).\n\notherwise, chat [on-topic, :)] away!"},{"date":"2023-01-18T17:00:46.335358Z","msg":"'ello!"},{"date":"2023-01-18T16:57:24.787585Z","msg":"shift the logo a lil' to the left.\n\ndid you like the `go to profile` link rather than linkin' the card itself? it's fine if you did, just wonderin', =P."},{"date":"2023-01-18T15:01:08.054067Z","msg":"@Dat\ncode still needs to be clean."},{"date":"2023-01-18T14:45:45.428958Z","msg":"@Astro\nno, no, no.\n`dat = () => 'dat'`\nimplicit returns save bytes an' time, ;p."},{"date":"2023-01-18T14:38:15.334441Z","msg":"an' call `mouseMoved` as the last line of code."},{"date":"2023-01-18T14:34:46.960204Z","msg":"ah, very last suggestion, add each member's avatars as their pfps on the members page."},{"date":"2023-01-18T13:24:38.460317Z","msg":"have you not saved? the scripts haven't been beautified [an example would be line 1001].\n\nnot sure if we understood each other, but i meant on line 194 where you already have a `hover` effect in place. if you understood what i meant, you can ignore this comment."},{"date":"2023-01-18T13:11:16.113369Z","msg":"some of your scripts need to be run through a beautifier an' i'd personally add a `transition` for the `hover` effect for the \"We are\" cardz, but i think that's it, :D!"},{"date":"2023-01-18T01:58:52.974227Z","msg":"it works, but you'll need `event.preventDefault()` in your key event listener."},{"date":"2023-01-18T01:18:45.563349Z","msg":"@Levi\nthe best way is to release a new version of the script an' set the version `@[version]` to the version you just created.\n\ncreate a new release titled `0.0.1` with tag `v0.0.1` so GitHub will chill.\nonce you've published the new release, just change the version (which is currently set to `latest`) to `0.0.1`, ;p."},{"date":"2023-01-17T17:29:36.953398Z","msg":"same as i told Levi. i'd rather my team learn more than any other team than score higher than any other team. everyone has to be ready to learn an' get out of their comfort zone on my team.\n\nimho, you can't make a decent library in two weeks [from experience =/]. two hardest parts will be `text` an' vertices without needin' the user to use a `start` command."},{"date":"2023-01-17T16:01:26.506885Z","msg":"oh, that makes sense, ;p."},{"date":"2023-01-17T15:37:01.546069Z","msg":"i'd think they are line #s, but that doesn't make sense.\n```\n3\tsize\n3\tP2D\n125\tline\n128\tellipse\n253\tmouseX\n504\tmouseY\n263\tmousePressed\n264\tmouseButton\n264\tRIGHT\n272\tmouseReleased\n277\tkeyPressed\n278\tkey\n278\tkeyCode\n280\tkeyReleased\n329\tpushStyle\n333\tbackground\n342\ttextAlign\n342\tBOTTOM\n343\ttextSize\n346\tpopStyle\n459\tcolor\n511\tdraw\n```"},{"date":"2023-01-17T15:34:57.641072Z","msg":"_beat the rest of KA in 2022 CoC's first round; is the only returnin' captain._\n\ni feel like if you click on the member's cardz, they should send you to their profile without the need for the `Go to profile` link."},{"date":"2023-01-17T14:44:58.810353Z","msg":"3. alr then.\n5. true, but less functional.\n\nofc, it's your work, :)."},{"date":"2023-01-17T14:13:47.333878Z","msg":"2. oof.\n3. if you don't mind, i think i just replace the hero with a canvas an' draw a simple Japanese landscape on it. \n5. the nav open animation is pretty slow.\n6. the leaderboard page could use some work. needz some spice to it, perhaps an animation to reach the current score levelz an' some minimalistic detail?"},{"date":"2023-01-17T14:09:06.66235Z","msg":"hmm, we all start somewhere, =P. the script will work for what you want it to do, ;p.\n\nwhat are the numbers after line 24 for in your canvas script?"},{"date":"2023-01-17T12:06:25.304928Z","msg":"@Liftoff\nthat would assume the judges know what React is. only two will an' i can guarantee the rest won't based on their current programmin' experience."},{"date":"2023-01-16T22:30:32.921174Z","msg":"SQL could technically still be used if you have an outdated browser 'fore WebSQL was deprecated.\n\ni'd use indexedDB [the noSQL alternative that is currently supported] for a database in the browser."},{"date":"2023-01-16T22:25:42.768788Z","msg":"```\nopaque\ninvert\nthreshold [# from 0 to 1]\nbrightness [# from 0 to 255]\ngrayscale\nposterize [# from 2 to 255]\nsharpen\nsharpen2\nprewitt_x\nprewitt_y\nsobel_top\nsobel_bottom\nsobel_left\nsobel_right\nemboss\noutline\ndarken\nlighten\nedge\nblur [# from 1 to 7]\n```\n\n`rgba(125, 225, 150)`"},{"date":"2023-01-16T21:10:40.62755Z","msg":"we'll let Polar figure that one out, =P.\n\nAliquis."},{"date":"2023-01-16T13:49:32.73577Z","msg":"Liftoff didn't get the memo lol.\n\n2. yup, got points taken off on my homepage for Primavera for usin' it.\n3. i'll be sure to keep that in mind, :)."},{"date":"2023-01-16T00:46:58.481333Z","msg":"only for the 2D context sadly.\n\ni'll take a look, :)."},{"date":"2023-01-16T00:43:31.545798Z","msg":"yes ma'am, he is, :D. wish you would've applied for CoC, =P."},{"date":"2023-01-16T00:36:43.697747Z","msg":"you can't get `imageData` from a WebGL canvas, =/.\n\nif you could send me the link to your project, i'll fix it for you, ;p."},{"date":"2023-01-15T23:31:23.452092Z","msg":"you can't grab two different contexts from the same canvas an' since i grab the first canvas element in the body with ski.js [reason why thumbnail.js works the way it does], the contexts clash. if i had to guess, you import ski.js first, then use WebGL.\n\ni figured out how to do it, but it's not entirely straightforward, if you care for me to show you how, :)."},{"date":"2023-01-15T20:13:04.557635Z","msg":"idk lol."},{"date":"2023-01-15T12:16:30.397354Z","msg":"a few tips.\n\n1. i would suggest a more complex background, perhaps even animated [perhaps a `canvas` tag?]\n2. obviously members an' score page would be necessary for a finished product.\n3. to be a lil' picky it should be \"The Team *that* Beats Them All\" an' i'd prefer if my name was kept lowercase [line 102], :)."},{"date":"2023-01-15T11:49:56.119132Z","msg":"no argument there.\n\nif WASM was practical on KA, it would be worth usin', =P."},{"date":"2023-01-15T11:45:39.068074Z","msg":"i just removed the IIFE an' there were no errors as Oh Noes ignores any errors that come from `script`s with a different `type`, :)."},{"date":"2023-01-15T11:40:51.985972Z","msg":"originally, i didn't think web developers would be useful in later roundz due to the general transition towards gamez, but a few dayz after this program was created i realized that since all projex would be in the web environment, web devs would still be valuable teammates. \n\nif i \"hated web developers\", i wouldn't have bothered to put them on my list, =P."},{"date":"2023-01-15T02:27:50.769876Z","msg":"they are simpler than we thought, o.O."},{"date":"2023-01-15T01:00:35.809508Z","msg":"every voter needs to see this. ^^^\ngive the man a medal."},{"date":"2023-01-14T23:46:02.708364Z","msg":"ofc, you had to, smh, xD. this is what i do to my CS teacher everyday, an' he's learned to hate me for it lol.\n\nhad no clue that existed, tbh, but now i do thanks to your enlightenment, :D. what would the purpose of the property be, o.O?"},{"date":"2023-01-14T23:44:42.75881Z","msg":"there's always a time to try smth new, :)."},{"date":"2023-01-14T23:25:02.157431Z","msg":"noSQL databases stored within the browser, multithreadin', asynchronous functions an' `Promise`s, rest parameters, inheritance, new built-in data type prototypes, an' the list goes on, :)."},{"date":"2023-01-14T20:18:54.89107Z","msg":"great!\n\n`noise` is not fast which is the biggest issue. i'll release it in a separate repo an' give you the link to import as it's p5.js' `noise` stripped down for efficiency [you can already see what i'll use in my projex].\nwidth & height for text is way too buggy in PJS, so it won't appear in ski.js, :)."},{"date":"2023-01-14T20:07:26.204799Z","msg":"@Samwise\nhere's a basic demo, :). unless you use `curve`, it should work the exact same as PJS.\n`_*https://www.khanacademy.org/cs/-/5099165982179328*_`"},{"date":"2023-01-14T17:21:01.799967Z","msg":"@HS [i don't think you mind me callin' you that]\ni've never used the KA extension to format code, but if it appears as clean code to you that follows generally accepted standards, it sounds good to me, :D!\n\nwelcome Liftoff, :D! glad to have you with us, ;p. if you could read the advisory 'bove if you haven't already, it would be greatly appreciated, :).\n\n@Samwise\nwould you be willin' to learn? ski.js is built to match PJS near exactly an' it's a lot easier than it looks, :)."},{"date":"2023-01-14T16:48:25.5917Z","msg":"@ALL\nwelcome to team ninjaz, :D! glad to have every one of you on the team, :).\na few notes 'fore we begin the first round.\nwhile i cannot mandate anythin' for this team, i _strongly encourage_ that we all follow the standards below.\n```\n1. every project must be in the web environment. [if you are used to PJS, you will use ski.js, the canvas API, or whatever canvas library you wish to use as long as you can satisfy the requirement below]\n2. every project must utilize ES6+ syntax if JS is used. [ES6+ might sound dauntin', but it doesn't make codin' more complex, only easier]\n3. all code will be run through a beautifier 'fore it is submitted. super simple, super easy an' saves pointz.\n```\ni would be more than happy to help those who might need help with this transition, :D.\n\nlmk if you have any questions or concerns, :).\n\n@TML & Samwise\nis it possible for y'all to create an acc on GitHub? it makes for much easier collaborations an' would keep our team chat thread hidden from others, ;p."},{"date":"2023-01-14T16:21:42.331582Z","msg":"is CoC still a competitive competition if 42/59 [>70%] of the applicantz get selected? i think not, so i'd vote against an extra two roundz."},{"date":"2023-01-14T13:29:17.069817Z","msg":"@Polar\njust double checkin', but you do realize that Liftoff isn't on your team..."},{"date":"2023-01-14T13:24:01.045698Z","msg":"i just ran a test an' looks to be a problem in your code. not sure where or what you think the problem is, but it seems to work as intended on my end.\n\nit needs to be `args[1]`. basically it checks for the 3 rgb values from the string an' adds the last value `args[1]` as the alpha value. would run if called like this:\n`fill(color(10, 20, 30), 40)`"},{"date":"2023-01-14T11:57:11.534221Z","msg":"ouch, this looks rough.\n\nThe Money Lord."},{"date":"2023-01-13T21:59:26.316194Z","msg":"lol, it's the image i chose not the code that makes you happy, xD."},{"date":"2023-01-13T18:07:53.410332Z","msg":"yessir, :D!"},{"date":"2023-01-13T13:28:47.470262Z","msg":"this oughtta be fun.\n```\n1. HSstudent16\n2. Mojo1000\n3. Captain Longtreader\n4. Lemon Games\n5. Jake K.\n6. Liftoff\n6. TDJ\n8. CoraL\n9. YokieBob\n10. Electric Dolphin\n11. TheLegoMango\n12. 21262\n```"},{"date":"2023-01-13T11:26:15.047081Z","msg":"@Liam\ndid Polar an' Paperwad message y'all directly? didn't see it in the general chat over there [not here]."},{"date":"2023-01-13T02:26:42.951087Z","msg":"you could add `;-;` at any point in your code so you work until you're satisfied [which may be what ski does for ski.js, Web Workers, an' WebGL].\n\ngood point. i'll name the next one *greatest game KA has ever seen* an' pull a reverse psych trick, xD.\n\nbeen fixed for a while, ;p.\n\noh boy.\ni'm into riggin' figurez that punch for me. not so much punchin' myself."},{"date":"2023-01-13T00:59:27.738293Z","msg":"i'd work in ski.js as it might not be the _exact_ same (arcs & ellipses are a lil' different).\nnope, not _yet_. still don't know why but it _should_ be fixed by the end of tomorrow.\nyup, :D!\neh, not much i can do. it originally said \"look an' i promise you'll regret it\".\n\nwhy thank you.\nay, i'm unbanned. what can i say?"},{"date":"2023-01-13T00:39:22.952335Z","msg":"lookin' for your snarky comment?\nit's in my bio. was there 'fore he posted as he questioned the captain's decisions in the CoC chat thread, smh."},{"date":"2023-01-13T00:29:09.503497Z","msg":"i'm the beginner, =P. lol, this was 'fore i realized that there were only five roundz so i thought i'd be left with one round where i had to pick a noob.\n\nwebpages won't be made an' if they are, i'd be the one to do it. web devs are less helpful as the comp goes on as everyone has to collab together as CoraL stated in her application, ;p.\n\nyou're good.\n\nto note, i will be *strongly encouragin*' [_ahem_ mandatin' _ahem_] the use of ski.js, ES6+ syntax, an' the web environment in every project team ninjaz makes. comfort zone eliminated. don't tell anyone else yet. let's get settled in first."},{"date":"2023-01-13T00:19:49.803245Z","msg":"@Samwise\nthe point was that there wasn't any trash talkin', =P.\n\nit took the moderators to be 24 hours overdue for me to pull out the capitals, so you probably won't be able to, =P.\n\n@CBF\ni'll keep it in mind, ;p."},{"date":"2023-01-12T23:31:06.168109Z","msg":"@SMV\nchill. it doesn't rlly matter, =P. CBF can think however he likes. you gotta respect a dude who started the greatest comp on the site.\n\n@CBF\n```\nbut there's a big difference between confidence and arrogance\nyou hearin' this?\n``` - _Nate_ *NF*\ni think yk what i mean."},{"date":"2023-01-12T21:30:51.722101Z","msg":"yup.\n\n*sigh*. yes, i s'ppose so.\n\neye color: brown\nhair color: dark brown\nskin color: ever so slightly darker than a Caucasian's"},{"date":"2023-01-12T21:13:39.970284Z","msg":"hey guys, :D! so glad y'all are here to win CoC with me, :)."},{"date":"2023-01-12T21:11:29.418115Z","msg":"@Paperwad\nLiam said, \"Can everyone start to create another list of 12 people?\", so i assume it's a new list."},{"date":"2023-01-12T19:43:04.768455Z","msg":"captain present. homepage will be made soon, so Liam doesn't get spammed."},{"date":"2023-01-12T19:42:02.260071Z","msg":"@Liam\nthree not two? just double checkin' not disagreein'."},{"date":"2023-01-12T18:02:04.349353Z","msg":"@CBF\ni understand how a draft works an' the costs an' benefits of pickin' certain peepz.\n\nimho, no reason to pick peepz ik i won't get which would defeat the point of listin' 12 applicants as our pix, =P.\n\nunderstood, but xacer won't work well in collabs an' i hold an ambivalence toward Akbaba's abilities if you needed an additional justification."},{"date":"2023-01-12T16:39:39.711717Z","msg":"'cuz i'm an overacheiver, =P.\n\nDR probs won't get picked first by anyone but Astro, but i don't think he will.\n\nthat's my guess."},{"date":"2023-01-12T15:54:45.567288Z","msg":"@CBF\ni am skeptical of xacer's an' Akbaba's activity levels.\nNL an' i don't get along [more on my part than his].\nWalkWorthy will be taken by Levi first if i recall the draft order correctly. if not, he will be taken by others first."},{"date":"2023-01-12T13:18:53.691408Z","msg":"yup, =P.\n\nriggin' a character allows me to move its limbs. i would need the full body of the ninja.\n\nshoot, i forgot he had WCC as well. i'll switch Samwise with Ace for a safer bet. Samwise had been pretty solid last CoC. i don't expect to get snaked for any of my pix in the first two rounds, but we'll see. i think if anyone decides to snake you or DR, that would be a huge surprise an' loss for them. i need another [or backup] graphix dev, but i'm also tempted to take Chase earlier.\n\nFF isn't on my list since ik that Henry already has him on his.\n\nLiftoff won't be higher as web devs won't help unless the whole team is for web devs which won't happen due to the limited talent. TDJ an' Lemon could rlly switch places, but i think TDJ might be more prized by other captains, so Lemon would be second."},{"date":"2023-01-12T11:47:06.484477Z","msg":"```\n1. SMV\n2. Dominic R.\n3. Samwise\n4. Chase L.\n5. TDJ\n6. Ace Rodgers\n7. Lemon Games\n8. Captain Longtreader\n9. Mojo1000\n10. YokieBob\n11. Liftoff\n12. CanonRouge24\n```\n\n@Henry\nnice to see you too, =P."},{"date":"2023-01-12T11:08:52.251787Z","msg":"the bio, =P. last year i was on Team Neutrons, =P.\n\nwould be nice, but thinkin' 'bout it, i wouldn't be satisfied with myself if i didn't rig the ninja.\n\nbro, no way. tell 'em that i am a pro at playin' that thin'. whenever they need to use it, i'll show up an' won't charge a penny.\n\nedit: redid my list, so we'll see how this turns out. cannot believe FF is second on Henry's list right after xacer."},{"date":"2023-01-12T02:09:42.546835Z","msg":"it's a copy of last year's, xD.\n\ni'll think on it, -.-."},{"date":"2023-01-12T02:08:50.875237Z","msg":"yuss, finally, :DDD!\n\ni promised Liam at least 'til the end of CoC, so there's that. not postin' on pretty much any project besides CoC or to praise another user's work. after CoC, we'll have to see.\n\nhonestly, you should be higher [i might go back an' edit], but i was rushin' the list so the last 6 or so are in no particular order.\nprobs won't. new subpage will come out soon instead, ;p."},{"date":"2023-01-12T00:55:51.14919Z","msg":"ofc.\nah, you an' me both. waited 29 days for this. fully prepped an' ready.\nnah, we need a team name. i'm thinkin' *legendz*.\n\nsounds good to me, ;p."},{"date":"2023-01-12T00:43:38.47825Z","msg":"i take that _back_.\n\nno reason to bemoan the past.\n\nnow to work on that new subpage with the new fav font..."},{"date":"2023-01-12T00:40:29.128203Z","msg":"thanks, :D. jit too, =P."},{"date":"2023-01-12T00:37:42.943738Z","msg":"i am not back. i am front.\n\nlol, you have no clue how much effort it took to get here, but it was well worth the wait, =P."},{"date":"2023-01-12T00:27:12.590741Z","msg":"i just said i wasn't.\n\n:D\n\nme too, :).\n\nyessir."},{"date":"2023-01-12T00:22:16.182715Z","msg":"a penny more an' a day early, ;p.\n\nfeels so good to be in this thread.\n\n*edit*: suggestion that all captains/judges of CoC downvote all judge/captain threadz like last year"},{"date":"2022-12-12T15:57:33.069955Z","msg":"anyone know how american football is played?"},{"date":"2022-12-07T01:03:05.820687Z","msg":"@SMV\nthose users have nowhere to go. there's no site with KA's content. Python 3.0 was slower on the backend not frontend so we'll never truly see the impact but KA will. if KA improves or learners on every other section of KA except the KACP are able to excel better than they could 'fore (or even just one section), then it's worth it. the issue is that KA has just gone downhill. very few badges [hundreds less iirc]. no more backgrounds. crazy buggy discussion platform. all of these *hurt* learners. KA wants to die. that's their mission.\n\nthe very definition of bandwagon. someone hasn't been on KA recently:\n_\"KA has an impeccable track record of sticking to their word, and delivering the right content at the right time.\"_ - G. Tarun approx. 2 months ago."},{"date":"2022-11-14T22:20:48.242622Z","msg":"if you wanna see me one-up you (the comment in your code), i recreated noise here. crazy fast ngl. need to make it WebGL though...\n\n`_*https://www.khanacademy.org/cs/-/6686879353716736*_`"},{"date":"2022-11-12T11:37:03.482427Z","msg":"hey there, :D!\nfixed, =P.\ngreat, :D!\nyou sure did, :D!\npretty much, :D! not quite as active, but still active.\nit should still work. KA only broke notifs from t&t i think which is why i didn't see this right away lol.\n\ndecent. just picked it up again. got a lighted, textured cube an' image filters for the latest version of ski.js, :D! (hopefully the last for a while...)"},{"date":"2022-11-10T19:48:13.295882Z","msg":"correct me if i'm wrong, but i think a Maclaurin series would do the trick for improvin' the efficiency, potentially greatly. you gave me one when i was computin' `noise` iirc. i could explain further if i just rambled lol."},{"date":"2022-11-08T17:42:08.707043Z","msg":"summon lightnin', send fiery orbs, shoot blasts of magic, an' whack peepz with their staff (they'll actually be decent against swordsmen).\n\nthey won't be animated i don't think. i'll transform the still graphic instead.\n\nxD, i have no clue why they do. `#.toString(2)` works better...\n\nnope. if you make a call to the API for this comment elsewhere (like viewin' it from Astro's project), then the issue will be fixed until you post again. i had to use Astro's project as i couldn't see your post."},{"date":"2022-11-08T15:01:35.470705Z","msg":"1.) ik just forgot to change the comment. thanks tho, :).\n\n2.) that's how the `main` function is defined in C which is what GLSL is based on. the `main` function looks like this in C.\n```\nint main () {\n    //main code\n    return 0;\n}\n```\n3.) what's the difference when adjustin' resolution?\n\n4.) do you know why some programmers use `void` as the parameter? was it needed to patch an ol' version of GLSL?"},{"date":"2022-11-07T13:31:49.319613Z","msg":"lol, just churnin' out dumb memez lol."},{"date":"2022-10-31T13:23:47.170069Z","msg":"it's gotten worse, but it's out of our hands unless we hire a private investigator or report Y to the authorities in some other fashion but i don't think we'll ever get enough to dox Y on our own.\n\nthe situation hasn't entirely resolved itself, but we're currently stuck between a rock an' a hard place with no progress over the past few days. at this point, i can't do much else other than sit an' watch.\n\ni won't mention names for reasons i'm sure you will understand, :).\n\ni was approached by a user, i'll call him X, a lil' bit ago that there was an urgent situation regardin' bots. a user who you know, i'll call him Y, had been generatin' bots over a prolonged period of time. 1 million bots. X had created his own bots, but not for the malicious purposes that Y had an' shared his bot gen script with me. they were quite similar to that of Y, if not better. sent most of what we knew to KA (what i've said here. there's more but i can't discuss that here.) as well as the developments that have occurred over the past week or so to get 'em to stop the creation of bots entirely. KA did what KA does best. i'm sure you have an idea what that would be.\n\nif you want to know more, i've added info on my GitHub bio (github . com / thelegendski).\n\ni've resumed development on all collabs (an' added another one to the list, smh), so there should be progress soon, :D."},{"date":"2022-10-18T23:18:34.769626Z","msg":"ofc not. i just have this thin' against jQuery. it's terrible in so many different respects.\n\nfirst, developers are too reliant on it. \nsecond, it doesn't actually make life easier by a wide margin.\nthird, it's inefficient an' massive.\nfourth, the creator is now a part of KA's dev team who have proven themselves worthy of another outage."},{"date":"2022-10-18T20:18:12.11972Z","msg":"@Astro\nhow did you read my mind 4 hours 'fore i posted, o.O?"},{"date":"2022-10-15T22:55:00.226593Z","msg":"true.\n\nme neither. might do some research, :)."},{"date":"2022-10-09T23:49:54.408753Z","msg":"yessir."},{"date":"2022-10-09T02:20:59.988699Z","msg":"hoorah! now to stop him from reappearin'..."},{"date":"2022-10-07T21:33:13.631806Z","msg":"your parents don't rule the world."},{"date":"2022-10-07T21:32:32.667466Z","msg":"hmm, the magic part might be a stretch. there are two sides in a great war. one focuses on innovation, the other on magic. we follow a character on the magic side which is clingin' to the ol' traditions. he wishes to avenge those who innovate for...well, just to keep the mood light for stealin' a pineapple, xD.\n\nwell, we're still decidin' on what it's goin' to be, so i haven't made much."},{"date":"2022-10-07T21:04:38.115903Z","msg":"this thread will be deleted in 5 minutes. \n\ni'm goin' to log into FF's account an' delete it."},{"date":"2022-10-07T20:36:18.461397Z","msg":"thanks, :D!"},{"date":"2022-10-07T20:03:35.184121Z","msg":"thanks?"},{"date":"2022-10-07T13:01:12.67699Z","msg":"yay, :D!"},{"date":"2022-10-06T20:51:58.734762Z","msg":"hmm, not rlly, :p."},{"date":"2022-10-05T23:02:36.985318Z","msg":"@HSstudent16\nxD\n\n@YokieBob\nit's not. a less skilled programmer who i'm not fond of. if you care to know who it is, i posted on one of the spin-offs with my accurate suspicions."},{"date":"2022-10-01T19:47:06.344895Z","msg":"@DR\ni'll sum it up for you.\n\nWKoA has refused to comply with the ToS that he agreed to. this caused quite a conflict with the Guardians an' still does.\n\na lil' over a week ago, i was quite unhappy with CL (i think you saw) for the poor effort that he continually puts into his projects. the thread got out of hand an' i deleted it. in that thread, WKoA popped up an' i left a rather snarky comment for him. i had originally left a much harsher comment in the Khancorrenza \"trash\" thread, but it was hidden for whatever reason an' consequently deleted.\n\nit ought to be noted that he took rather drastic measures when he wasn't banned by postin' a highly controversial flag an' intentionally targetin' the \"liberal\" population of this site. he has noted that his sole goal is to eradicate the site of LGBTQIA+ programs.\n\nin the Khantober thread which has been deleted due to spam, i had attempted to post another snarky comment to a user who had been banned comparin' him to WKoA. the attempt never followed through, but a project with my post in the comments remained. WKoA found the post an' decided to leave a comment of his own. he alerted the Guardians of my \"rude\" behavior (who acknowledged his alert), but over the past 3 days no action has been taken. i've been harassed since.\n\nlet me know when you see this an' respond as you see fit. this project may be deleted at any time in the near future as you are aware of the situation which should be sufficient. i would prefer to leave WKoA banned if possible."},{"date":"2022-09-30T01:16:26.862299Z","msg":"KA already stores the project data on their end without the need of your replit. i deleted it so you'd stop poppin' up.\n\nyou're startin' to sound more an' more like Drained.\n\ndude, lay off.\n\nit's an online _learnin'_ platform, but your sole goal is to discriminate against another group. LGBTQIA+ are still people. they're just like you an' me. just 'cuz you don't agree with 'em doesn't mean you get to wage war.\n\nyou're stubborn an' insensible simply due to your ignorance of others an' the rules set in place by the Guardians. go make your own learnin' platform if you don't like KA."},{"date":"2022-09-27T23:29:07.645075Z","msg":"@DR\neh, some peepz have. most likely due to the downvote or perhaps misguided preconceived notions.\n\n@Chester\nthanks, :D!"},{"date":"2022-09-27T17:10:02.504051Z","msg":"ik. he's already said that he can't match me, so he'll live in peace."},{"date":"2022-09-20T01:53:08.24911Z","msg":"@CL\ni appreciate your response. i have decided to neglect to respond in kind as everythin' that should be said has been said (at least to you).\n\ni have the right to freedom of speech. if you don't like what i have to say, ignore it.\n\nthe reason why i don't capitalize \"i\" is due to the stress it puts upon oneself. i see it as selfish. in addition, it makes the glorious Name of our Heavenly Father stick out a bit more, no?\n\nthe choice of apostrophes is dialect.\n\n@WKoA\nquit with the trite phrases."},{"date":"2022-09-19T12:23:18.102078Z","msg":"i honestly just couldn't think of much else on the spot. i'd put \"wonderful teammate\" if this was a team comp.\n\nthat makes two of us, :).\n```\nMaybe you're just like me and feel the need to stay in your rut\n'Cause if you left it, you might feel like you're no longer you\n``` - _JUST LIKE YOU_ *NF*"},{"date":"2022-09-18T23:32:48.147102Z","msg":"thanks, :D!\n\nthat's what marketin' came up with, :p."},{"date":"2022-09-18T23:28:49.075206Z","msg":"it _could_, but the Guardians hate that. it only creates an' sends messages in this program alone, :)."},{"date":"2022-09-18T18:36:03.748973Z","msg":"at graphix? hardly.\n\nhmm, either reach a certain rank, find a certain person, or avenge an enemy.\n\n:D\n\nas soon as you get back, drop a post here an' i'll get to it, ;p."},{"date":"2022-09-17T20:29:22.355123Z","msg":"ayyy, you joined the apostrophe gan', :D!\n\nyw, :D!\n\nty, :D!"},{"date":"2022-09-16T12:28:38.885753Z","msg":"ayyyy yw :D xD\n\ni think we shouldn't be the ones to judge that. we would take it upon ourselves to be God an' judge others by what we _perceive_ to be their character.\n\nyessir.\n\nhaha, i'm nowhere near southern, :p. i lived most of my life in Las Vegas & NJ.\n\nsame, :)."},{"date":"2022-09-11T14:41:33.074558Z","msg":"@YIVauEivoj YIVauEivoj\nthe Guardians are rather indiscriminate of what they hide based on _users_. now, discrimination against the content of the program rather than the Guidelines is quite arguable, but that's for another day somewhere else.\n\nthey have hidden `externals` every single time it pops up on the HL up until, well, now. they might have the weekend off, or maybe they've decided it isn't worth their time. perhaps Guardians are leavin' due to KA's executives (see KA's Glassdoor reviews) an' now they're understaffed. whatever the reason is, the outcome is the same. these projects have yet to be hidden.\n\n@HSstudent16\ni wonder if they would let wikimedia images fly...\non another thought, i wonder what their restrictions against API calls from PJS will be.\n\ni've been told by Evan that *any* use of `externals` will be hidden from the HL, regardless of its actual use. perhaps the policy changed without notice."},{"date":"2022-09-11T01:45:41.66501Z","msg":"it sure is, :D! it's the one an' only legend that never finishes what he started. let's hope he finishes this.\n\nthanks lemon, :D!"},{"date":"2022-09-10T01:56:16.707042Z","msg":"nope.\nsure thing, :D!"},{"date":"2022-08-24T19:46:37.110099Z","msg":"there actually isn't a \"canvas\" method.\n\nthere are two methods. Polar's stubborn method (which Henry originally used) an' the stylesheet method.\n\nPolar's method calls the font in a script, but you have to have the link to the font's file in Google's server in order to use it rather than just the name.\n\ni prefer usin' the `link` method which you normally use. \n`<link href = 'font link here' rel = 'stylesheet'>`\nthen call `textFont(fontNameInStringForm, fontSize)`\nyou don't need to wrap the font name with `createFont`.\n\nyou may ask, why not add a `loadFont` function? the reason is that the page doesn't load twice, so if the `draw` function isn't used an' the `text` function not made `asynchronous` (which would screw so many more things up) your font would never load an' the text would be set to the default `sans-serif`."},{"date":"2022-08-11T21:14:47.746862Z","msg":"so, this version sucks. go to the one here for a _much_ better version.\n\n`_*https://www.khanacademy.org/cs/-/4791341272317952*_`\n\nif you have any troubles, link the program an' i'll help out, ;p."},{"date":"2022-08-10T16:53:30.096261Z","msg":"collisions by technical definition is to check whether two object intersect.\n\nphysics is the behavior that should follow a collision."},{"date":"2022-08-05T18:55:38.941774Z","msg":"heyo, :D!\n\ni think either Liftoff or Leviathan invented the method. i've used it for the mountaintop homepage an' trava, an' i must tell you that it's a pain to deal with, hence thumbnail.js.\n\nanyways, here's how it works. \n```\n1.) grab your base 64 image data. \n2.) open the *Network* tab in your browser's console\n3.) you should see a request sent that begins with your project ID. *right-click* on it.\n4.) under the *Copy* menu, select *Copy as fetch*\n5.) go to the *Console* tab. \n6.) *paste* the data\n7.) there should be a long string containin' the base 64 image data (under the \"image_url\" key tho don't look for \"image_url\" as the JSON object isn't well formatted). *replace* the base 64 image data with yours (note that it only works with PNGs an' GIFs).\n8.) *press enter* to send the request\n9.) *enjoy* you hard earned thumbnail! \n```\nonce you've done it, it's pretty straightforward. just make sure that you have saved a copy of the base 64 image data in case you need to make changes to the webpage after release, :)."},{"date":"2022-08-04T14:59:34.752029Z","msg":"the most important part is that you can use `import` in the `module`, but not with Some Name's method (no offense meant to Some Name)."},{"date":"2022-08-04T14:21:51.912252Z","msg":"we were talkin' bout portin' scripts from GitHub to KA. if you wish to use ES6+ classes in the KA HTML environment, you can simply assign the `type` attribute to `module` an' not use the brackets, :)."},{"date":"2022-08-04T14:21:00.269066Z","msg":"ah, you have my understandin'."},{"date":"2022-08-01T17:56:09.910595Z","msg":"huh, that's odd."},{"date":"2022-07-28T18:21:12.687519Z","msg":"thanks, :).\n\nah, thanks for the tip!\n\nthere isn't? hmm...ig i'll just loop backwards then. is there a reason why `.forEach` is the only forwards loopin' method that does not produce the glitch?"},{"date":"2022-07-26T14:37:17.154121Z","msg":"JavaScript is built on C++ which is built on C, at least that's what i've read. online sources don't give a very clear result."},{"date":"2022-07-26T13:56:58.412216Z","msg":"alrighty then. now i've gotta find some newz."},{"date":"2022-07-18T10:54:06.685868Z","msg":"well, anyone can find through the API that the project was created on August 20th, but i'm not sure if that's the exact date or not."},{"date":"2022-07-16T13:49:36.238027Z","msg":"i went through some of your code an' will continue to further make it efficient in the future. you can easily manipulate arrays like so (tho in the web environment, it's much easier).\n```\n//copy arrays\nArray.prototype.copy = function(){\n    return this.concat();\n};\nvar a = [1, 2, 3];\nvar b = a;\nb.push(4);\nprintln(a);\nprintln(b);\n\n//check if two arrays are equal to each other\nArray.prototype.equals = function(arr){\n    if(this.length === arr.length){return this.every(function(item, index){return item === arr[index];});}\n};\nvar a = [1, 2, 3], b = [2, 2, 3], c = [2, 2, 3];\nprintln(a.equals(b));\n```"},{"date":"2022-07-13T14:50:02.06558Z","msg":"yeah, fixed, :D! thanks for the help, :D!\n\nnow, nearly thrice as fast, o.o. still think `async` might be faster...i'll have to try.\n\nah, that's why. thanks for lettin' me know, :D!"},{"date":"2022-07-11T16:40:13.482267Z","msg":"then the legend outdid himself AND HSStudent16.\n`_*https://www.khanacademy.org/cs/-/5725226885758976*_`\n\nmessy code go brr."},{"date":"2022-07-11T15:04:32.404714Z","msg":"huh, that's odd..."},{"date":"2022-07-11T13:41:26.451446Z","msg":"`get` only causes lag due to the crappy PJS library."},{"date":"2022-07-10T18:16:25.033531Z","msg":"MS Edge, the router doesn't exactly send a message, it does this weird thing that sends me to the \"Hmm...the connection was reset.\" page."},{"date":"2022-07-07T14:26:11.968768Z","msg":"ah, a lack of understandability. the same reason lawyers an' CPAs have job security, lol. GitHub helps with that a lot if you're addin' you're own scripts or plug-ins. you can find me on GitHub @thelegendski. Vexcess is on there too.\n`_*https[colon]//github[dot]com/thelegendski*_`\n\nsweet music to my ears. this heat wave probs makes the walk miserable, :(.\n\nmy pop says he felt a callin' from God to become more self-sufficient an' have financial freedom (aka no debt) in Jan. of 2020. i wish we knew why we haven't found home. we thought a couple years back it would take us 1 months to get to our next home. now it's been 25.5 months...ig it's a miracle in itself that we have relatives who will take us in.\n\nsure thing. just make sure yk when to leave, ;p.\n```\nsome days, i just want to leave the negativity in my head.\ni just want relief from my stress.\n``` - _My Stress_ *NF*\n\nyup. that's what we've said for 2+ years. trustin' in people is hard enough. trustin' God is so much harder."},{"date":"2022-06-02T15:01:52.295881Z","msg":"@CompoundMaster\nlet me know if i overcomplicated it for you, :).\n`_*https://www.khanacademy.org/cs/-/6684461454901248*_`"},{"date":"2022-06-02T09:51:41.952139Z","msg":"i second this motion."},{"date":"2022-05-31T14:22:47.410979Z","msg":"well, that's what they claimed. no one's sure.\n\nhaha, that just shows you how desperate i am to hide from certain stalkers."},{"date":"2022-05-31T11:08:17.546259Z","msg":"yup, :D! mostly 'cuz i'm figurin' out which pathinfindin' algorithm to use."},{"date":"2022-05-30T09:49:39.650741Z","msg":"yup, Polar's right. it means downloadable content, usually for games to mean content that needs to be purchased separate from the game itself."},{"date":"2022-05-30T09:43:39.197934Z","msg":"that's the canvas api. not me, =/."},{"date":"2022-04-27T20:06:16.800118Z","msg":"haha, thanks, :D!"},{"date":"2022-04-26T10:30:05.945791Z","msg":"we'll now diagnose this issue as marci syndrome, =P.\n\nno worries at all, ;p.\n\nthe fact that i'm willin' to put that in my bio or what Lemon said?"},{"date":"2022-04-15T14:08:56.900652Z","msg":"if i do get an outdated library, i scream an' jump up an' down lol.\n\nthat reminds me, i plan on makin' a portfolio in HTML for the next challenge. my \"language\" to learn is CSS logic an' advanced selectors. anythin' specific you want in there?\nso far:\na.) thank the peepz who've helped me out. Quinn Hardbrook especially for lookin' like a fool to prove my points.\nb.) a list of 20 fun facts but 2 weekz after the trend lol.\nc.) some rap, perhaps?\nd.) list of employees at ski co.\ne.) allow users to post in the t&t any questions they want to ask my manager."},{"date":"2022-04-14T19:02:27.626769Z","msg":"it does, but you have the Guardians an' KA tryin' to destroy itself.\n\ntomorrow, bright an' early...the only thing i'm missin' is a briefcase an' NF, =P."},{"date":"2022-04-13T17:27:55.529835Z","msg":"2.) i hope so.\n6.) at least you bothered to learn OOP. unlike ski who took 4 months to finally realize that OOP wasn't for people who want to overcomplicate code.\n7.) i think i can, =P.\n8.) Major Mono Display, Grenze Gotisch, Cormorant Garamond, Staatliches, Varela Round, Patua One, Josefin Sans, Ubuntu, Unica One, Inconsolata. to name a few, =P.\n9.) NF = fire\n12.) at least our restricted environment doesn't cause as much lag, =P.\n13.) stop being Dominic\n16.) i ask NP, \"why did you use `rect` over `curveVertex`?\". classic NP response, \"I did that because I'm terrible at `curveVertex`. It's so much easier to use math than to bother with tricky stuff like that.\"\n\nnope, the real reason everyone loves minecraft is that they used Steve, xD."},{"date":"2022-04-13T13:12:32.123811Z","msg":"i did a test to see if anyone read my bio, an' one person responded within an hour, o.O."},{"date":"2022-04-11T16:43:02.943121Z","msg":"@tokajothepumi\ni like to at least set reasonable goals.\n\n@Polar\nthis is more a certification of blindness if you will.\n\n@VEXCESS\nwhoops! i got sidetracked an' didn't finish my post. i meant within the next 24 hours."},{"date":"2022-04-07T17:16:18.51694Z","msg":"so, i ran the project at the maximum possible speed that `setInterval` would go, an' i got this.\n`_*https://www.khanacademy.org/profile/themischeviouspachyderm/projects*_`\n\nlucky for me, i had the ingenious idea of lookin' at the network tab in my browser's console. here's the good news an' the bad news.\ngood news: so, it is doin' as i said above where it's sendin' multiple requests to KA, but not for the reason i thought. whenever KA tries to create a new webpage, it errors out as the script runs over it to an extent. the only issue is that the webpage is still saved. so, KA tries to continuously create new webpages until smth clicks on their end.\nbad news: \na.) i now have an alt filled with 20+ programs of a singular project.\nb.) i only saw 4 projects error out, but as you can see, there are way, way, way more. took a good 20 seconds to save the project.\nc.) someone could use it to boost their project on the HL by simply creatin' a ridiculous amount of spin-offs.\n\nedit: nevermind, i just tried with an alt an' 120 spin-offs didn't move it on the HL at all."},{"date":"2022-04-07T14:06:08.704342Z","msg":"yup!\n\na few ways to do it.\na.) go online an' find a PNG to base 64 converter (there are tons out there). i even know one on KA if you want the link.\nb.) if you want to copy a KA project to base 64 data, you'll need to use some `canvas` element methods. here's an idea of how one would do it in PJS.\n```\n//top of code.\nvar externals, canvas = externals.canvas;\n//end of code.\n//you'll need the browser's console as println is a lot more resource intensive an' will crash your browser.\ndebug(canvas.toDataURL());\n```\n\njust remember that your file shouldn't exceed 750kb. otherwise, KA won't take it."},{"date":"2022-04-06T19:07:45.177169Z","msg":"i believe you once said that you're a master of overengineerin' or smth of the sort. i must be your apprentice.\n\n'cuz accessin' `canvas` is much more fun. who doesn't want to create an HTML image element in PJS without HTML? found a hybrid. the legitimate reason as to why is that i can use the same method for wikimedia images, so that means i could create a function for both.\n\nedit: on second thought, yours is much easier to incorporate elsewhere.\n\nedit (2x): works wonderfully. thanks!"},{"date":"2022-04-06T17:58:27.936959Z","msg":"more like:\n```\nnf.constructor(\"const img = new Image(); img.src = 'https://www.khanacademy.org/cs/-/123456789/987654321.png'; img.crossOrigin = 'Anonymous'; return img;\")();\n```"},{"date":"2022-04-06T17:33:20.920129Z","msg":"no, don't you dare."},{"date":"2022-04-06T13:46:46.526582Z","msg":"yw, :D!"},{"date":"2022-04-04T19:07:22.069173Z","msg":"haha, at least i'll get third place, ;p. GW probs beat me to second, o.O."},{"date":"2022-03-30T17:53:36.187707Z","msg":"a.) ah, the downfall of Bob. or is it NP?\nb.) ah, alright.\nc.) i guess we all have our forms of enjoyment."},{"date":"2022-03-26T10:12:09.063558Z","msg":"actually, he learned it from VEXCESS, but the trick has been 'round for quite some time, :)."},{"date":"2022-03-25T18:44:24.257497Z","msg":"insult? i'd say i'm merely observin' the world 'round me. tell me how i'm wrong for this particular circumstance. don't give me a bogus excuse or say how you're right in smth you can't prove. own up to your actions."},{"date":"2022-03-24T12:16:26.31619Z","msg":"just as a note, it's near impossible to get Liftoff to give someone a 7. even if JS gave them a 10, the _max_ score anyone on the team Liftoff judged would be 8.5 which is unfair regardless of whose team he's judgin'."},{"date":"2022-03-24T09:56:39.755106Z","msg":"tutol's collisions were much different (an' parhaps easier) as they were circle-rect collisions which relied on trig rather than determinin' the angle."},{"date":"2022-03-22T19:27:53.156079Z","msg":"sounds good, :D! let me know when you finish, ;p."},{"date":"2022-03-22T19:21:32.463959Z","msg":"yup, :D!"},{"date":"2022-03-22T17:03:26.951Z","msg":"ignorance is bliss."},{"date":"2022-03-18T09:25:50.392113Z","msg":"true, but two animations might be a bit much, =P.\n\nissue i thought we might have is that it focuses on \"I\" which isn't much of a team motto. i'll go ask in the team thread what everyone thinks."},{"date":"2022-03-17T20:12:40.537385Z","msg":"_\nCoding is Magic Challenge\n\nCoding is magical, and your goal for this challenge is to bring some magic to the hotlist. Maybe make a magically themed game, or experiment with a new concept. However you interpret it, let's make some magic!\n\nDeadline: 4/4/22\n_"},{"date":"2022-03-17T19:11:21.898321Z","msg":"you can work on the first challenge (or any challenge besides the final challenge) at any point 'fore the deadline of that challenge, =)."},{"date":"2022-03-17T17:36:08.301855Z","msg":"[*redacted*]"},{"date":"2022-03-16T18:34:12.660629Z","msg":"some peepz vote for no reason at all, *shrug*."},{"date":"2022-03-16T14:36:36.228227Z","msg":"*cackles*\n\nah...which challenge would that be for?"},{"date":"2022-03-16T11:07:11.927487Z","msg":"true, but after further thought, Terratrice could claim the same, =/."},{"date":"2022-03-15T11:15:22.030676Z","msg":"245 is better.\n\nb.) ik. that's what NP told me for CAPTIVE, so i wouldn't question The Great One (that's his new name). the words did fly off the screen, but judges will knock points off if they have to wait forever.\na.) vertically, you want to bring the buttons up some to give it padding. that would mean movin' the text up as well as you have a lot of empty space on top an' crammed everythin' to the bottom of the screen."},{"date":"2022-03-14T23:00:38.652435Z","msg":"i'll code up a pizza if there's progress involved, =P.\n\nsmth that just came to mind an' is entirely irrelevant, _never_ use `arc`s in PJS. the built-in function create vertices for each degree along the arc which could easily prove harmful to performance."},{"date":"2022-03-14T22:55:01.875903Z","msg":"chants _\"we demand progress! we demand progress!\"_."},{"date":"2022-03-11T19:25:37.200083Z","msg":"why not, =P?"},{"date":"2022-03-10T20:58:21.47749Z","msg":"it accomplishes the same feat, an' usin' `jshint` is your choice."},{"date":"2022-03-10T20:31:42.075286Z","msg":"the silent e would make the i in chamomile into a long i, but i could be wrong."},{"date":"2022-03-10T15:58:18.983375Z","msg":"true. his attempt is more complicated, but it seems to work. i mean, i don't have another person to try it out with, so i can't say for certain."},{"date":"2022-03-08T15:31:21.936403Z","msg":"i believe i posted the link on my sub page, =P. just pointin' out a small inaccuracy."},{"date":"2022-03-07T18:42:58.015292Z","msg":"huh. that doesn't make sense, but the Guardians don't either."},{"date":"2022-03-07T14:23:15.822728Z","msg":"haha, i just realized you want \"Inactive\" when i posted, so i thought best not to ask a question i thought i already knew the answer to, =P. if you want to join, you're more than welcome, :D!"},{"date":"2022-03-07T09:48:00.288845Z","msg":"it shouldn't lag. how many windows an' tabs do you have open?"},{"date":"2022-03-06T15:01:42.843697Z","msg":"ah, well Argon said he didn't entirely mind. here's the project if you ever get back on, ;p. \n\n`_*https://www.khanacademy.org/cs/-/6068030036557824*_`"},{"date":"2022-03-02T19:47:04.027208Z","msg":"yeah...i'll ask for a 19th century musket an' bayonet an' see what happens next.\n\nedit: updated."},{"date":"2022-03-02T17:50:20.864245Z","msg":"thanks!\n\nunderstood, =). could i be notified when this policy changes, if it does?"},{"date":"2022-03-02T15:14:01.806397Z","msg":"wait, they have access to multiplayer games? live or local (as in do you have physically have to have someone next to you, or is it someone else on the web?)?"},{"date":"2022-03-01T16:03:55.478917Z","msg":"yeah, :D!\n\nhaha."},{"date":"2022-03-01T13:19:37.363921Z","msg":"yup, works like it should! which is not good, lol."},{"date":"2022-02-26T11:09:55.272043Z","msg":"well, it semi-works. i haven't gotten 'round to actually drawin' the image yet, but here's the test run:\n`_*https://www.khanacademy.org/cs/-/6730863254487040*_`\ni got stuck on somethin' rather simple, lol. i can't manage to get `e.data` to a higher scope.\n\nedit: got it to run the image at least. still bein' blocked by CSP. wonder if i can store it on their end with a fake URL...\n\nedit edit: after three attempts, i admit defeat. this is impossible. unless you know how to store the base 64 data on KA's sandbox domain so that it can be retrieved, it's not possible."},{"date":"2022-02-26T10:41:11.122628Z","msg":"@VXS. actually, if you set the third argument of `nf` to `-1`, `nf` won't return a decimal point, =)."},{"date":"2022-02-25T16:10:02.436999Z","msg":"NP is a genius, =P. no doubt there.\n\nyw, :D!"},{"date":"2022-02-24T13:25:06.898361Z","msg":"have you listened to _Remember This_?\n\nthanks, :D!\n\nvery."},{"date":"2022-02-23T17:55:10.918928Z","msg":"ah, as it should, =). i actually borrowed it from one of my school's learnin' platforms, lol."},{"date":"2022-02-03T20:14:02.827223Z","msg":"me too."},{"date":"2022-01-28T11:16:37.258526Z","msg":"really? what part of the player movement?"},{"date":"2022-01-25T15:12:19.110884Z","msg":"nope, >=(. here's the link (not that it has anythin' useful atm):\n`_*https://www.khanacademy.org/cs/-/5317708780453888*_`"},{"date":"2022-01-19T19:42:38.880254Z","msg":"that last one sounds nice, =P. if you could make the platformer mechanics, i'd make the graphics and backgrounds for the different levels."},{"date":"2022-01-18T14:28:54.125424Z","msg":"how?"},{"date":"2022-01-18T00:04:04.062191Z","msg":"i'm not sure i understand."},{"date":"2022-01-15T11:02:53.088287Z","msg":"hmm, i have a WIP at the moment that will be released for CoC round 1 called valor that is an FPS. i had to rush it in 4 days, so we might do another FPS based on valor (titled honor?) that would be much better. i've also had a knack for battle simulations, so we could do an FPS where you're in the middle of a battle?\n\nwe pretty much only align from 1-3 A.M., but that should work, :D!\n\nedit: if you're up for a big project, we could try an RPG. that would be interestin', and i have an idea on how the general functionality would work."},{"date":"2022-01-12T14:37:56.121826Z","msg":"there we go, :D! now, i just have to contact National Geographic for the sightin' of a new hybrid species of canine and cervidae, =P."},{"date":"2022-01-12T14:14:18.3703Z","msg":"i picked 90% of it up in a day. it isn't hard at all, so i can do most anythin' with it (or teach you if you'd like). do you know if input elements in HTML can have their height set to `auto`?\nwoohoo, :D! i'm not sure what kind of game (or graphic, i haven't tried to make a graphic before) you'd want to make, but i'd love to try, =)."},{"date":"2022-01-10T14:22:59.917634Z","msg":"add a total of fifty to the fur color, and change the background to `background(245);`"},{"date":"2022-01-07T18:58:52.396308Z","msg":"haha, no worries."},{"date":"2022-01-06T20:29:17.992438Z","msg":"yours doesn't either, e.g. the bigger the burden, the better the life."},{"date":"2022-01-06T11:27:19.660575Z","msg":"done with your logo! there have been some minor changes in placement and animation, =P. \n`_*https://www.khanacademy.org/cs/-/5794070247030784*_`"},{"date":"2021-12-28T15:09:29.193265Z","msg":"thanks!"},{"date":"2021-12-24T10:48:20.597271Z","msg":"ah, that is working for me. the error i had gotten was `__env__.size is not a function`."},{"date":"2021-12-17T13:31:28.768553Z","msg":"i was tring to make 3D here:\n`_*https://www.khanacademy.org/cs/-/5840950930751488*_`\n\ni knew you had worked with Unity before, and WebGL is made by Unity so you might have a some idea as to the answers.\na.) in the program linked, i'm drawin' all of the coordinates on lines 62 to 98. they _should_ draw an octahedron, but they don't. i know that an octahedron has 12 vertices, but i have no clue what those other 4 vertices would be.\nb.) how would one do collisions in 3D? would you have any idea as to the more ambiguous math from your experience."},{"date":"2021-12-02T20:32:42.165834Z","msg":"ah, okay, :p.\n\ndo they live in America?\n\nwhy do you have to make them so faded? the just blend in like ghosts do! jk"},{"date":"2021-12-02T18:54:16.834818Z","msg":"lol, yes and no. yes, we have a basic premise. no, we have no real characters. my best shot is below, but i'm not the greatest in the creativity department, :p.\n\nyour name is ____ (jake? or something gender-neutral like charlie?). you wake up one morning in your small quaint town of Tutol. (note all proper nouns that are not names were generated by my random word generator. `_*https://www.khanacademy.org/cs/-/5123081716596736*_`) as you walk outside a neighbor stops and tells you about the horrifying news. the precious cottonball (something silly, it was the first thing it thought up of) that your great-great-grandfather had prized had been stolen from the local museum. (perhaps this is all a cutscene and the cutscene ends here?) you have to go talk to Bob (he'll look like a character graphic one of my friend's made.) to learn that he lost his lucky coin (penny?) in the garden nearby. you go into the garden and find the lucky coin which you give to Bob. Bob then gives you a book to give to the librarian in the library (most likely in a separate world map). the librarian gives you a coin that you spend at a local breakfast stop for a donut. you give the donut to Winston who gives you a taco. the taco is given to the mayor who is starving after his house flooded due to some squirrels triggering his fire alarm. the mayor gives you a key to an old room in the library that you open to find a pair of glasses on the floor. you bring the pair of glasses to an old man (not too far from Bob) who gives you a key to go to the upper floor in the breakfast shop. you go up to find the prized cottonball waiting in the middle of the hallway. the game ends when you take the cottonball back to its rightful place in the museum. that transitions to the end scene which says \"you may have found the cottonball. but who stole it?\" i was thinking that it could be the squirrels, Bob, or the mayor. i would need to write all of this dialogue out, but i think this is a good start."},{"date":"2021-11-30T18:05:16.634313Z","msg":"I don't believe I do, but I'll make sure to let you know if that issue should arise."},{"date":"2021-11-23T11:05:17.233018Z","msg":"After looking back at old content, I have only been on KA for two years and of those only six were spent programming."},{"date":"2021-11-22T20:29:16.28699Z","msg":"alright. may the best programmer win."},{"date":"2021-11-19T14:20:12.941898Z","msg":"no, been working on collisions. gettin' it now.\nwill take a look after your tool is made."},{"date":"2021-11-17T14:30:45.919632Z","msg":"Nevermind, I just figured it out."},{"date":"2021-11-16T19:59:36.20748Z","msg":"i'll listen to them. thanks for the suggestions! did you mean O'Brien, the one from AGT?"},{"date":"2021-11-16T00:23:25.796407Z","msg":"You can call it KT."},{"date":"2021-11-12T13:51:12.783315Z","msg":"What is the use for this? Actually, a better question would be what the use is for a fountain of strawberries?"},{"date":"2021-11-12T11:23:35.813011Z","msg":"found the exact date. it was when Chester released Little Cube, so it would have been oct. 2 2018."},{"date":"2021-11-08T10:42:16.444472Z","msg":"The game is more about how many times you play as you find the tricks behind each level. The best tip is to constantly run in circles.\n\nDecreased Level 9's time. I've added Level 7 and  level 8 (meant for health regen)."},{"date":"2021-11-03T11:15:17.451307Z","msg":"I've tried for about an hour, but I'm not sure how to make a transition between levels. It seems like it will have to be a separate function that is called on line 402 or so rather than in the draw function. If you have any questions on my messy code, feel free to ask."},{"date":"2021-11-02T18:07:52.93308Z","msg":"May want to slow down the acceleration then, xD."},{"date":"2021-10-28T19:46:32.094387Z","msg":"That sounds like a good idea. Have you tried your hand at pixel art before?"},{"date":"2021-10-28T12:54:33.149011Z","msg":"Ah, alright. Hmm, I'll see what I can do."},{"date":"2021-10-27T16:46:55.927928Z","msg":"Do you mind detailing what time zone you are in as well as a time & date that you would be active?"},{"date":"2021-10-26T23:16:35.769081Z","msg":"Ah, alright. Thanks!"},{"date":"2021-10-21T14:40:16.03059Z","msg":"Ah, I'm getting close to finished. I'll let you know when it is done."},{"date":"2021-10-21T14:20:15.849769Z","msg":"Here's the link. It used to be a sub page I did for someone else, so it is all 100% of my code. I'm working on a place to encourage people to join and sub tell them why to sub and why to join and lastly who the members are.\n\n`_*https://www.khanacademy.org/cs/-/5848889403064320*_`"},{"date":"2021-10-21T13:54:59.927853Z","msg":"Tree trunks changed."},{"date":"2021-10-18T19:52:57.244485Z","msg":"As for the defender, he seems to lack some basic knowledge and creates rather poor quality programs. His game reiterates different functions for collisions instead of directly checking collisions for each object.\n\nThank you! Fixed the sudden pop-up of text with a quick animation. Anything else?"},{"date":"2021-10-18T19:22:04.961245Z","msg":"Sorry, busy with another project as well. I know Daniel T. I don't mind if you ask him, it is the defender that I inquired of."},{"date":"2021-10-16T10:11:09.107689Z","msg":"Most certainly, :p."},{"date":"2021-10-15T23:47:34.691214Z","msg":"Thanks, Gray Wolf!"},{"date":"2021-10-13T19:03:53.740632Z","msg":"Uh, I'm not sure what you need help with, but I'm decently sure the month code is mine, so are you looking for help in creating a phone or at least its OS?"},{"date":"2021-10-11T19:10:20.617263Z","msg":"https://www.khanacademy.org/computer-programming/rig-attempt/6056405948907520\n\nWhat do you think? The OOP and the functions and the graphic. Couldn't have done better myself, :p. \n\n`_*https://www.khanacademy.org/cs/-/6056405948907520*_`"},{"date":"2021-10-07T13:58:34.73677Z","msg":"Please elaborate, I'm not entirely sure what you mean."},{"date":"2021-04-20T10:01:01.9318Z","msg":"Wow, thanks Murray! That will definitely help."},{"date":"2021-04-18T10:03:23.093333Z","msg":"Ah, understood. Do you have a price for the game in mind or a platform to release it on?"},{"date":"2020-10-20T13:25:52.367446Z","msg":"Alright, I do have a couple of suggestions.\n\n1.) Trees need to have a spawn variable, so we can add levels with more difficulty as the plot progresses.\n\n2.) I would suggest making the bullets the same color, so they might be distinguishable.\n\n3.) They should have spurts (every 250 frames or so) in which they spray a certain amount of seeds and bullets per say 1 seed and 3 to 5 bullets based on difficulty. Seeds should have a chance of dying as well."},{"date":"2020-10-19T15:07:44.851209Z","msg":"Spawning is automatic, so there is a timer that goes off. Summoning is the ability to create an enemy while the timer has not gone off for that enemy."},{"date":"2020-10-12T14:30:29.979228Z","msg":"Ah, alright. Well, have a good day!"},{"date":"2020-10-10T21:12:51.356843Z","msg":"Thanks!"},{"date":"2020-10-09T14:21:54.024753Z","msg":"Yes, you posted first! Here's mine. It was pretty rushed and the quality isn't there, but here we go.\nhttps://www.khanacademy.org/computer-programming/battle-sim/6187485146333184"},{"date":"2020-10-09T14:14:10.31027Z","msg":"Use sin/cos to scale the images.\nHop? What do you mean by not reflected in gameplay? If they hop, won't it be in the game play or do you mean using sin/cos to move their y up and down?"}],"COMMENT":[{"date":"2023-03-12T02:12:19.525473Z","msg":"*score thread*\n_highscore: [SCORE]_"},{"date":"2023-03-10T14:27:44.323995Z","msg":"*join thread*\n_for testin' only\npost in the followin' format._\n```\n$[NAME, LEVEL, TEAM]$\n```"},{"date":"2023-03-10T13:33:56.881836Z","msg":"*join thread*"},{"date":"2023-03-09T02:56:52.650579Z","msg":"that's how posterize should look. you're usin' posterize only on the gradient itself not anythin' the gradient is applied to/on. in order to do the latter, you'd need to crash performance by at least 3x an' run the filter every frame."},{"date":"2023-03-09T00:34:34.66719Z","msg":"in a nutshell, it's an issue i fixed in the later versions of the filter script.\n\nthe issue with the other versions is that they return an error. i'll see if i can fix that error real quick."},{"date":"2023-03-08T13:48:33.829173Z","msg":"if you know PJS, thumbnail.js should be wicked simple.\n\nlmk if you have any questions, :).\n`_*https://www.khanacademy.org/cs/-/6737783223271424*_`"},{"date":"2023-02-27T00:57:14.746868Z","msg":"it occurred to me that you could just add a new script tag to the DOM if you got the code in the editor as a string [which you seem to have done to some degree, perhaps not a string]. curious to know why you didn't do that?"},{"date":"2023-02-26T19:48:03.744896Z","msg":"no WebGL, :(."},{"date":"2023-02-26T19:46:15.216901Z","msg":"hey NP, :D!\n\nso, i have a favor to ask of you.\n\ni lost half my team at the start of a competition an' then found replacements. well, some of the original team an' the replacements dropped out, so i'm back to half a team. lookin' for any an' all replacements rn.\n\nto be very clear, i'm not askin' for a time commitment. i'm not askin' for a full-time member who grinds day in an' day out without sleep to crank out what they can. two to three hours a week would be appreciated, or not even that, any an' all help, no matter the perceived insignificance, is greatly appreciated. an example would be just the buttons for a menu, not the menu itself.\n\nit's totally fine if you can't, but thought it would be worth a shot, :)."},{"date":"2023-02-26T11:21:29.875041Z","msg":"hey Levi, :D!\n\ncall me crazy, but there's a difference between desperation an' craziness.\n\ni've lost half my team in CoC [again] [Fer Fer, SMV, an' Promise] an' i need some help. not a full-time captain, not a full-time member. i need someone who can contribute 2 to 3 hours of code a week, which given your current projex makes you an opportune candidate. you don't even have to be active for two to three hours a week or make any commitment, even a lil' help [just buttons or a singular enemy graphic] would go a long way, :).\n\ntotally understand if you don't want to an' call me crazy for recruitin' the ex-rival cap'n, but it was worth a shot."},{"date":"2023-02-26T11:19:43.471084Z","msg":"hey Argon, :D!\n\nso, i have a favor to ask of you. 'round this time last year i was in dire straits for an annual competition, an' i asked for you to create a menu [which wasn't used due to my inactivity over the weekend]. \n\nwell, that same annual competition has come back an' this time i have found myself in a pickle. granted picklez have to take time to well, pickle, an' this came along quite rapidly so maybe it's a cuke [cucumber]?\n\ni lost half my team at the start of the competition an' then found replacements. well, some of the original team an' the replacements dropped out, so i'm back to half a team.\n\nto be very clear, i'm not askin' for a time commitment. i'm not askin' for a full-time member who grinds day in an' day out without sleep to crank out what they can. two to three hours a week would be appreciated, or not even that, any an' all help, no matter the perceived insignificance, is greatly appreciated. an example would be just the buttons for a menu, not the menu itself.\n\nit's totally fine if you can't, but thought it would be worth a shot, :)."},{"date":"2023-02-24T14:51:47.019371Z","msg":"i luv votes."},{"date":"2023-02-24T14:45:53.170661Z","msg":"pls don't vote. this is still a WIP. it's garbage."},{"date":"2023-02-23T00:02:45.589491Z","msg":"now we know why there was a run on toilet paper in 2020. \n\nit will dominate the world, o.o."},{"date":"2023-02-22T16:15:53.795551Z","msg":"now that's water."},{"date":"2023-02-21T13:23:36.211083Z","msg":"try in WebGL, :p."},{"date":"2023-02-20T21:48:26.776638Z","msg":"uh, the transformation is contained within `pushStyle`/`popStyle`?"},{"date":"2023-02-17T13:23:44.290154Z","msg":"\"Dark.js hopes to fix a few technicaly issues with ski.js, be much faster than ProcessingJS, but also add new features that make using Dark.js worth it\"\n\nlove to see the grind, man. openin' an issue on ski.js would be too easy, a PR that just fixed the issue would've been laziness, you had to recreate the library from scratch.\n\nsaw this on GitHub 'fore i saw it here believe it or not.\n\ni've spent over a year on ski.js an' it's not just my knowledge that went into that project but the enormous wealth of knowledge the greatest programmers on KA possess. PT, HS, Polar, bravo bravo, the names go on an' on. VEXCESS an' Polar miserably failed at their own creation; i'd love to see what you come up with, but i will warn you that it's next to impossible to beat 10+ programmers over a year as one person in a month or so. \n\nat the very least this project is a worthy endeavor, :). it's noteworthy for one to want to create their own canvas library. it's another to claim you'll beat ski.js."},{"date":"2023-02-17T12:08:50.237926Z","msg":"incredible recreation of the album cover, :D.\n\ndef my fav track of his so far (curious to know what he does with a track titled HAPPY tho lol). already listened to it a dozen times an' countin'.\n\n#NFRealMusic. the only kind of music.\n\nlet's top the HL like NF tops the charts, ;p."},{"date":"2023-02-14T10:51:23.182384Z","msg":"probs belongs in questions but whatevs.\n\nso 21262 has asked to join my team, but there's currently some debate over the matter. if you could tell him, that i [more like we] am considerin' his proposition but have not come to a definitive conclusion yet. i'm currently not a fan of the idea that participants get to choose their teams as you've taken a hard stance on the matter with Phantom Falcon last year an' your note to SMV this year. cap'ns should have the say imho, but that's just my two cents an' this isn't my comp, ;p.\n\nhow do you level the playin' field out if not all teams can have 7 members an' all members of team Henry want to still participate? i don't think it'd be fair to tell any member of team Henry that they can't participate anymore, but if they do, do the teams who have 6 rather than 7 members get to recruit more? that sounds like a decent idea since all teams are somewhat back to where they started but also are somewhat in a better position. just tryin' to figure out how it all works out, :)."},{"date":"2023-02-11T19:37:54.864784Z","msg":"well done Liam, :D!\n\nline 1398 to 1415 are sketchy to enter into an official contest, no?\n\nsmth that i just learned the hard way recently is that you shouldn't modify any native objects or built-in methods whenever possible (line 1418), :)."},{"date":"2023-02-08T11:20:28.042245Z","msg":"i think the only critique i have atm is that there should be a smoother transition when you maximize a window or have over the close button, ;p."},{"date":"2023-02-08T03:31:08.413348Z","msg":"who would've thunk that we'd compete as cap'ns in CoC?\n\nglad to have a skilled competitor to compete with, ;p.\n\nlotta smack over on GitHub that team Levi is out now that Lemon is at the helm. tbh, it's Levi's entries not his leadership that would've scored more pointz. inwardly rootin' for you now that you're the underdogz, :).\n\njust smth that might be interestin' is that i kicked Samwise off my team, so i actually expect a higher performance with you than with me.\n\nwhat's your project for this round gon' be?"},{"date":"2023-02-06T01:02:32.380419Z","msg":"the lack of clothin' may be inappropriate for young children, :)."},{"date":"2023-02-06T00:07:38.877959Z","msg":"i don't want to spam the others, so this is posted as a separate t&t, :p.\n\n'fore i begin, i want to clarify that i'm not askin' for a revised judgin' or challenge your scorez/reasonin', but more for advice.\n\nhow would you have improved the enemy algorithm? the movin' aspect would've required a freeform pathfindin' algorithm of which there is no documentation anywhere on the web. the attack an' movement could be triggered by when the player is close enough to the enemy, but i don't think that is what you had in mind as that's literally one line."},{"date":"2023-02-02T11:29:56.513994Z","msg":"for the description of the *Middle Ages* contest, the links are missin' `target=\"_blank\"`, ;p."},{"date":"2023-02-02T11:22:17.457633Z","msg":"my entry to our code-off should be on the HL within a week, ;p. lmk when yours releases, :D."},{"date":"2023-02-02T10:26:11.55098Z","msg":"readin' this two months later is weird, ngl.\n\npoint 5: i'm curious as to know what your suggestion is to fix the community effectively. i think i've tried every solution to the problem, an' obviously, they haven't worked."},{"date":"2023-02-02T02:24:53.634399Z","msg":"i'm sure you already know why i'm here since SMV pretty much laid it out, but i'll say it anyways.\n\ni am here to invite you to join my team in Clash of Code. i have lost three members an' am currently in search of replacements. the contest runs until Mar. 13th an' the rest of the challenges are collaborations so the workload will be shared.\n\nhow comfortable are you with SVGs?"},{"date":"2023-01-31T16:13:06.376828Z","msg":"if you could submit your CoC entry even if it's not finished, it would be much appreciated, :)."},{"date":"2023-01-30T23:49:55.133044Z","msg":"the entry to beat."},{"date":"2023-01-30T17:53:35.928607Z","msg":"that menu is sick.\ngameplay not so much, but i don't think anyone else managed to stop gawkin' at the menu an' actually play, :p."},{"date":"2023-01-30T02:21:28.780976Z","msg":"good day SP, :D!\n\ni am here to invite you to join my team in Clash of Code. i have lost two members an' am currently in search of replacements. the contest runs until Mar. 13th an' the rest of the challenges are collaborations so the workload will be shared."},{"date":"2023-01-27T14:16:05.000053Z","msg":"hey Doglover, :D!\n\ni am here to invite you to join my team in Clash of Code. i have lost two members an' am currently in search of replacements. the contest runs until Mar. 13th an' the rest of the challenges are collaborations so the workload will be shared. think Primavera but more competitive an' only the best coders, ;p."},{"date":"2023-01-27T14:15:39.803788Z","msg":"good day apex, :D!\n\ni am here to invite you to join my team in Clash of Code. i have lost two members an' am currently in search of replacements. the contest runs until Mar. 13th an' the rest of the challenges are collaborations so the workload will be shared."},{"date":"2023-01-27T02:20:30.022209Z","msg":"*challenge*: make a WebGL program that doesn't crash my potato."},{"date":"2023-01-27T02:08:44.228685Z","msg":"did you expect us to say no lol?"},{"date":"2023-01-26T22:40:33.462456Z","msg":"nice job, mate, :D!"},{"date":"2023-01-26T22:30:26.146061Z","msg":"on the HL rn lol."},{"date":"2023-01-25T21:15:00.607376Z","msg":"someone lost their mind.\n\ndelete this project 'fore it gets hidden an' the Guardians treat themselves to your notifs. spin-offs work just fine an' they'll still be there even if the original is hidden."},{"date":"2023-01-25T15:32:32.923495Z","msg":"so this might honestly be one of the greatest graphix i've seen on KA. love the attention to detail an' the japanese characters in the background.\n\nthat savage/surprise ninja is like lookin' into a mirror. only not the fact that you committed a codin' crime by settin' the `draw` function to another function _within itself_, but we'll ignore that for now, ;p.\n\nfor all of our sanities, pls add `enableContextMenu();` so we can all make this our desktop wallpaper."},{"date":"2023-01-25T02:35:38.242505Z","msg":"so i'm tryin' to import my own music into KA an' have had great trouble findin' a method that doesn't crash the browser. this seems to work beautifully, so i have a few questions for you if you don't mind.\n\nfirst, i don't fully understand the Web Audio API so if you could explain what `AudioContext`, `AudioBuffer`, `AudioBufferSourceNode`, an' `GainNode` are, it would be much appreciated, :D!\n\nsecond, i'm not sure what you did, but what text does the audio need? it doesn't look like it's base64 encoded. i think i could figure out the rest from there, but i'm stuck as to how i would recreate this in a faster environment [the web environment with imported scripts]. i can have the string size be as long as necessary, but i can't run your C++ code as i'm stuck on a chromebook atm.\n\nany answer would be appreciated, :D!"},{"date":"2023-01-25T02:03:24.401717Z","msg":"any plans for this?"},{"date":"2023-01-25T00:47:20.8997Z","msg":"i just saw this now [i mean i think i glanced at it 'fore] an' iirc that poem was for me.\n\nthe graphic is beautiful an' stunnin' altogether. the filterz rlly made this project shine an' the danglin' orbz make me think of the greatest graphix artist [at least rn] to have graced KA, RP24.\n\nas to the poem, i don't think i ever thanked you for it, an' readin' it again i feel that i ought to. it's nice to think that from pain we'll see our destiny unfold an' that's what i hold on to everyday. thank you again, :)."},{"date":"2023-01-25T00:21:22.492107Z","msg":"ik FF's code when i see it lol."},{"date":"2023-01-24T21:09:15.724576Z","msg":"slightly concerned ngl."},{"date":"2023-01-22T00:02:45.828135Z","msg":"that snow tho, o.O. i'd reuse that for your CoC project on the menu screen; they're epic, :D!\n\nshould be `const keys = {};`, :). `keys` doesn't change only its attributes.\n\ntwo space indentation, >:(. come back from the dark side! don't join Polar in that madness.\n\n@ASCII it's 2023 not 2022 lol.\n\nthat contrast has sent me to eternal color blindness.\n\nscore of 8.\n\nimho, should be named *ski slide*. not that i have any bias."},{"date":"2023-01-21T17:20:34.317636Z","msg":"when this gets on the HL, smh.\n\nif i don't get a 10 on efficiency, i might cry, :(."},{"date":"2023-01-20T22:21:40.939769Z","msg":"if you could go to the team chat thread on the other place an' join the team chat thread here on KA, it would be greatly appreciated, :D!\n\n`_*https://www.khanacademy.org/cs/-/5403470941437952*_`"},{"date":"2023-01-20T13:39:42.640365Z","msg":"the Guardians are slackin' on hidin' programs that access `externals`, o.O.\n\ni find it highly unnecessary to go through all of the trouble of bypassin' KA's restrictions when you could've accessed 'em normally with `width` an' `height`. tbh, looks a lil' flashy to me."},{"date":"2023-01-18T14:38:46.559745Z","msg":"i believe you meant zatizfyin', but i'll let you pass, ;p."},{"date":"2023-01-18T01:29:03.901066Z","msg":"classes should always start with a capital letter, ;p."},{"date":"2023-01-17T16:03:18.506341Z","msg":"to be clear, you don't need to use ES6+ syntax to use ski.js; i enforce it for other reasons, ;p.\n\nhave fun lol."},{"date":"2023-01-17T14:51:23.855798Z","msg":"hey xacer, :).\n\ndo you have any suggestions for these image filterz? the code is originally based off of WebGLfundamentals but went elsewhere once i wanted image kernelz.\n`_*https://www.khanacademy.org/cs/-/5116098904637440*_`"},{"date":"2023-01-17T11:48:19.772635Z","msg":"tryin' to one-up ski.js i see.\n\nyk that you can't beat the year's worth of work that's gone into that library, right? jk lol."},{"date":"2023-01-16T13:55:52.149078Z","msg":"nav link hover script with a tad bit more efficient script, ;p.\n```\nlet links = document.getElementsByClassName(\"navlink\");\n    for(const link of links){\n        link.onmouseover = () => {\n            for(const l of [...links].filter(el => el !== link)) l.style.opacity = 0.3\n        };\n        \n        link.onmouseout = () => {\n            for(const l of links) l.style.opacity = 1\n        }\n    }\n```\ni'd add a blur filter to the nav background. \n\ni feel like the hero is the only thin' that doesn't fit. the color scheme doesn't mesh well. maybe more blue an' green?\n\nyou shouldn't be able to scroll while the nav is open."},{"date":"2023-01-16T00:42:49.305404Z","msg":"lovin' the simple homepages just like last year, :D.\n\ngood luck to you an' your team, :).\n\na few notes on the code.\n1. do you not indent the tags inside of the `head` or `body` tag?\n2. it's terribly inefficient to use `querySelector`, so here's a quick fix for lines 205 to 206 in case you care to. [line 211 will need to be `for(const el of links)`]\n```\nconst cursor = document.getElementsByClassName('cursor')[0]\nconst links = document.getElementsByTagName('a')\n```\n3. curious to know why you wrap the `event` parameter `e` in parentheses when it isn't necessary. is it better codin' practice?\n4. any particular reason why you wrapped your `link` tags with a `div`?"},{"date":"2023-01-15T11:37:50.489932Z","msg":"lookin' good!\n\ngenerally prefer to set `type` to `\"module\"` an' remove the IIFE for the `script` tag, ;p."},{"date":"2023-01-14T20:12:53.774456Z","msg":"@Evan\nmay i ask why you import jQuery an' then you don't use it?\n\na wonderful idea! i can already see the amazin' entries, :)."},{"date":"2023-01-14T16:23:54.700327Z","msg":"you're right an' wrong. ski.js does have a bug, but not what you think it is. the other rectangle is just colored by whatever the last fill color was.\n\nthanks for catchin' this, i'll go fix it right away."},{"date":"2023-01-13T23:32:22.017141Z","msg":"test."},{"date":"2023-01-12T00:29:10.908347Z","msg":"i voted."},{"date":"2023-01-12T00:28:11.152237Z","msg":"beautiful webpage Liam.\n\nsrry JSC, but this is so much better than last year's, =P."},{"date":"2023-01-12T00:09:44.119767Z","msg":"test."},{"date":"2022-12-11T14:06:31.724626Z","msg":"how did you convert the strings of code into functional code without `eval` or `new Function`?"},{"date":"2022-12-11T01:29:20.203947Z","msg":"lol, what stops me from importin' the entire game script from GitHub? it's still under 20 lines here on KA."},{"date":"2022-12-10T17:26:46.973695Z","msg":"works for me."},{"date":"2022-12-09T22:49:08.148508Z","msg":"to answer your first question, it simply isn't efficient to do so. i would need to record every random value possible an' assign those values accordin' to when the function was called which is not safe as the number of times the random numbers were called varies. the only other way would be to inefficiently employ the same method as PJS. i don't think it will matter too much, but i can manually adjust the random values for each tree if you feel like we need `randomSeed` i could try to import PJS, but that's too much of a headache.\n\nas to your second point, you have two conditionals at once for `i` in your `for` loop. you need two different `for` loops as the first conditional for TRAVA ends first, so the same number of characters (5) is what is displayed of TELENOVA. all strings come with a built-in property `length` so there's no reason to `.split('')`, :)."},{"date":"2022-10-18T20:20:11.952127Z","msg":"gee, i wonder if someone just posted to gain votes rather than spin-off from the original, o.O.\n\nsmh, peepz these dayz think we're gullible to an otherworldly degree or can't see what's in front of 'em if their pet was on the line."},{"date":"2022-09-17T18:40:34.792089Z","msg":"i'm sorry Jake. i just had to tear this to pieces once i saw the code.\n\nfirst, the compliments.\n\nabsolutely beautiful transitions, :D! wonderfully unique, distinct an' most certainly eye catchin'.\n\nthat Lorenz attractor is quite nice, ;p.\n\nan' then, we all saw it comin'.\n\nthis is actually one of the only programs of yours where i feel that there was a lack of effort, or perhaps you were rushed. either way there is _a lot_ to be improved upon an' i've only listed the few (okay, several) things that jumped out at me.\n\na.) the font choice might blind some users. with this color scheme, it just doesn't mesh. at all.\n\nb.) black an' white do not work. don't do it. unless you're goin' all out with the design of the webpage you *cannot* sacrifice color.\n\nc.) the cacteye avatar is in side of a neat little box that nearly blends with the background. make it pop out by borderin' it with white instead of puttin' black on black.\n\nd.) the use of green on this webpage, particularly that shade of green, just does not mesh again. the colors should pop out without bein' an eyesore.\n\ne.) you're in the web environment. _use it._ ES6+ syntax is available to you with extra benefits, but instead you settled for good ol' painful ES5.\n\nf.) while i complimented your transitions, you also did it in the most painfully complicated manner. simply chainin' the animations an' displays with `onanimationend` would've worked beautifully without causin' the code to look like Greek.\n\ng.) your backgrounds are plainly just pasted into the webpage as if you just picked the first search result. a webpage should be a harmonious symphony of color not chaos.\n\nh.) there should only be two animations, at the very most 4. once the user hovers over the element, once the user moves out of the element, an' optionally, once the user clicks on the element. perhaps there could be an intro or `onscroll` animation as well, if deemed necessary. on the news page, you change from the terrible black an' white to an even harsher blue an' white to a blindin' green an' white that bobs up an' down an' screams \"look at me steal your vision from years to come!\".\n\ni.) JSONP an' callback functions are much easier to use than _jQuery_. the KA devs can't get their implementations straight. the creator of _jQuery _leads the KA devs. what does that say 'bout _jQuery_? additionally, it's more of an easy way out, so to speak.\n\nj.) space out operations. instead of `1+1` write `1 + 1`."},{"date":"2022-09-06T01:39:54.562429Z","msg":"bro needz to take a chill pill, :p.\n\ntysm, :D!"},{"date":"2022-07-21T22:19:43.743743Z","msg":"aaay, nice, :D! \n\nsmall critique:\nthe hands should go on the keyboard instead of the arms reachin' 'round the laptop.\n\ni've been here for three years now, an' the one thing i've learned is that people change, they come an' go, but PJS _will always be the worst_."},{"date":"2022-07-20T10:28:50.536283Z","msg":"i would think that this would be a slightly more efficient implementation on lines 42 to 51:\n```\nconst styles = document.getElementsByTagName('style-sass')\nfor(const style of styles){\n    Sass.compile(style.textContent, result => {\n        const style = document.createElement('style')\n        style.innerHTML = result.text\n        document.head.appendChild(style)\n    })\n    style.remove()\n}\ndocument.body.style.display = 'block'\n```"},{"date":"2022-07-17T20:04:08.935256Z","msg":"may i ask the reason for the thread in the t&t."},{"date":"2022-06-01T14:06:45.049416Z","msg":"ofc, you could one-up Bob Lyon if you happen to be the one an' only ski. make it one line, B).\n```\nnf.constructor(\"document.getElementsByTagName('canvas')[0].onwheel = e => e.preventDefault()\")();\n//or this if you don't have an awful hatred for jQuery\nnf.constructor(\"$('canvas').on('wheel', e => e.preventDefault())\")(); \n```\n\nyou sure your stalkerz are gone, o.O? i didn't vote."},{"date":"2022-05-31T14:28:09.813944Z","msg":"just poppin' in to say hi.\n\ncurious to know if you have any recommendations for pathfindin'."},{"date":"2022-04-25T18:45:32.291173Z","msg":"one-up Dominic.\n```\nfunction find (w, h) {\n    for(var i = 1, sum = 0; i < Math.max(w, h); i++) {\n        sum += (w - i) * (h - i);\n    }\n    return (sum + (w * h)) * ((sum + (w * h)) < 0 ? -1 : 1);\n}\n```"},{"date":"2022-04-01T13:59:38.018396Z","msg":"i just tried with API an' failed. out of curiosity, what's your method for how one would get the code back?"},{"date":"2022-03-28T14:44:44.147742Z","msg":"hey No Name!\n\nif you could reformat the link in your recent entry to the one below, that would be a huge help, :D!\n~\"https://www.khanacademy.org/computer-programming/chiwi-and-the-magician-primavera/5003677889773568\"~"},{"date":"2022-03-10T00:58:12.101522Z","msg":"ah, yes. the level creator. i'd suggest takin' a look at Invasion's for an optimized one, ;p."},{"date":"2022-03-07T11:16:48.474042Z","msg":"is it wrong to stalk Danny even tho he hasn't done anythin' in a month, o.O? what happened to your official contest entry this month? will we see any more projects? do i have to post on my subpage to have all of my subscribers post to get you back on KA? nice bio, =P."},{"date":"2022-01-19T14:17:43.840169Z","msg":"somebody already voted this who wasn't me, o.o.\n\njust a couple things i learned from _tutol_.\na.) i'd probs make the enemy & npc objects separate.\nb.) i have a typin' function we could use to make it look nice. this also means that the dialogue logic is nuts. here's how i set it up previously, tho we should probs make it more efficient. all of the npc data was stored in an array title, well, _npc_data_.\n```\n/**\n * list of variables and what they do for NPC dialogue:\n * in @Player:\n     * this.listen checks to see if the player is listening.\n * in @NPC:\n     * this.dialogue is the array of dialogue for the NPC.\n     * this.talking is the boolean to determine whether or not\n       the NPC should update the typing/talking.\n     * this.done is the boolean for whether the talking is done\n       for the NPC.\n     * this.phew is the boolean for whether the talking is done\n       for the player.\n     * this.check is the boolean \"loading\" the dialogue before\n       talking.\n     * this.given controls whether or not the player has been\n       given the object needed.\n     * this.have is the boolean for whether or not the player\n       has the item the NPC wants.\n     * this.checkered is a boolean made to make sure that the\n       second dialogue is typed and that it isn't repeated.\n     * this.type is the constructor for type.\n * in @type:\n     * this.t is the wanted text.\n     * this.txt is the returned text.\n     * this.char is the character that this.txt is on of this.t\n     * this.del is whether or not text is being deleted.\n     * this.speed is how fast the text is written.\n     * this.done is whether or not the text is done being typed.\n**/\n//npc oop\nfunction NPC (x, y, id){\n    this.x = x;\n    this.y = y;\n    this.size = 50;\n    this.id = id;\n    for(var i in npc_data[this.id]){\n        var id_ = npc_data[this.id];\n        this.char = id_.name;\n        this.take = id_.take;\n        this.recieve = id_.recieve;\n        this.dialogue = id_.talk;\n        this.rot = id_.rot;\n    }\n    this.index = 0;\n    this.talking = false;\n    this.done = false;\n    this.check = false;\n    this.given = false;\n    this.have = false;\n    this.phew = false;\n    this.checkered = false;\n    this.type = New.call(type,\"\",30);\n}\n//update which dialogue the npcs should be on\nNPC.prototype.update = function() {\n    if(!this.given && !this.have){\n        this.index = 0;\n    }\n    if(this.index < 1 && this.have){\n        this.index = 1;\n        if(!this.checkered){\n            this.checkered = true;\n        }\n    }\n    if(this.given && this.checkered){\n        this.index = 2;\n    }\n};\n//chat away, npcs\nNPC.prototype.talk = function() {\n    //set the dialogue to what it needs to be set to\n    //if it hasn't already been set.\n    if(!this.check){\n        this.type.string = this.dialogue[this.index];\n        this.type.txt = \"\";\n        this.talking = true;\n        this.type.char = 0;\n        this.type.done = false;\n        this.phew = false;\n        this.check = true;\n    }\n    //tell the program that the typing is done\n    if(this.type.done){\n        this.done = true;\n        this.phew = true;\n    }\n    //if not done, display.\n    return this.type.update();\n    \n};\n//runs collisions and npc dialogue\nPlayer.prototype.collide = function() {\n    //npc-player collisions\n    for(var k = npc.length - 1; k >= 0; k--) {\n        var n = npc[k];\n        var r = (this.size + n.size)/2;\n        //dialogue check\n        if(dist(n.x, n.y, this.x, this.y) < r) {\n            var a = atan2(this.y - n.y, this.x - n.x);\n            this.x = n.x + cos(a)*r;\n            this.y = n.y + sin(a)*r;\n            //initiate the dialogue\n            if(keys[32] && !this.open){\n                this.npc = true;\n                this.open = true;\n                this.listen = true;\n                this.initiate = k;\n            }\n        }\n    }\n};\n//checks player inventory\nPlayer.prototype.act = function() {\n    //checks to see if you have the object the npc needs\n    for(var k = npc.length - 1; k >= 0; k--){\n        var n = npc[k];\n        for(var j = this.inventory.length - 1; j >= 0; j--){\n            var inv = this.inventory[j];\n            if(n.take.type == inv.type && n.take.spec == inv.spec){\n                n.have = true;\n            }\n            if(n.have && !n.given && this.listen && this.initiate == k){\n                this.inventory.push({\n                    type: n.recieve.type,\n                    spec: n.recieve.spec\n                });\n                n.given = true;\n                this.inventory.splice(j,1);\n            }\n        }\n    }\n};\n//shows the hotbar and dialogue\nPlayer.prototype.gui = function() {\n    if(this.open){\n        rectMode(3);\n        noStroke();\n        fill(50);\n        rect(300,550,600,100);\n        textAlign(1,1);\n        textFont(createFont('Lato Latin Bold'),18);\n        fill(245);\n        text(this.txt,10,520);\n        this.bane.draw();\n        if(this.npc){\n            for(var i = npc.length - 1; i >= 0; i--){\n                var n = npc[i];\n                n.update();\n                if(this.initiate == i && n.type.txt.length < n.type.string.length + 1){\n                    this.txt = n.talk();\n                }\n                else{\n                    this.txt = this.txt;\n                }\n                if(this.initiate == i && n.phew && this.bane.update()){\n                    this.txt = \"\";\n                    this.open = false;\n                    this.listen = false;\n                    n.check = false;\n                    n.done = false;\n                }\n            }\n        }\n    }\n};\n```\nc.) just as a note, i find it easier to make a `prototype` called `all` that has every function in it.\n\ni'll get to those graphix right away, ;p."},{"date":"2022-01-06T18:14:15.551832Z","msg":"i have no clue what i'm lookin' at."},{"date":"2021-12-10T14:48:00.557538Z","msg":"_when_ do i get to see the program?\n\nedit: i did what you did in three lines, >:). don't call global variables inside functions. that makes them useless elsewhere.\n```\nfunction when(val,min,max){\n    return val >= min && val <= max ? true : false; \n}\n```\n\nedit edit: what you did in three lines with all of the code including your global, >:).\n```\nfunction when(val,min,max){\n    return val ? (val >= min && val <= max ? true : false) : (time >= min && time <= max ? true : false); \n}\n```"},{"date":"2021-12-06T14:18:29.08823Z","msg":"two things.\n\na.) your collisions are off. start on the right side of a block with the block above you and you will get stuck when moving left.\nb.) instead of constantly creating a `new` instance of `Player`, just set `p.x` to `j * 20` & `p.y` to `i * 20`"},{"date":"2021-12-06T14:12:13.471689Z","msg":"go here: `_*https://www.khanacademy.org/cs/-/5043631293513728*_`\nthere's a thread there. let's go."},{"date":"2021-12-02T13:09:23.461415Z","msg":"won't load. your image for water, due to the noise, is killing my computer. some remedies are in the t&t, especially CtmGamer and IA's remarks."},{"date":"2021-11-08T18:31:06.559391Z","msg":"will you be able to fit such a large project on ka (from your subpage)?"},{"date":"2021-11-07T10:10:43.629373Z","msg":"wow, this looks like a kacp need of revival, smh.\n\nedit: ia, levi f., _and_ CowboyFan_ on your tail. i'll link a post of mine below. this message was not directed at you when posted. doubt you'll read it or respond, but worth a shot.\n\n\"The hardest problem about Khan Academy is its breeding ground for sociology. What I mean by that is, you put thousands and thousands of users onto a single platform over ~ten years, and as that platform ages, you see a growth, climax, and the eventual decline. Now, the KACP (as defined by Willard [the creator of MineKhan] who I had a similar discussion with) is most like a representative democracy, not necessarily a republic by technical definition. This means that all of the voters (below 13 or \"childed\" and above 13) select which programs will receive their vote. Now, the government urges voters to stay informed, so that come election time, you know what you're voting on.(I believe it is reasonable safe to believe that you live in the United States of America.) More accurately, voters choose which creators will receive their votes. Now by the connotation most often used, \"voter fraud\" is not plentiful on KA and is nearly non-existent as no specific instance (that follows the connotation) has been recorded. A separate wholly unique and unprecedented issue plagues KA, quality. Effort and time are thrown aside when choosing which programs are selected as \"hot\". Voters choose whichever program pleases, entertains, or brings the most enjoyment to them, so the best solution for this aspect is to keep the voter informed as to the need for supporting programs that require an intense effort as opposed to those that do not but bring the same entertainment value if you will. This task will be incredibly difficult to accomplish due to the natural desires of the users based on previous voting history, and the fact that no one has decided to address this issue which I find beyond appalling. In conclusion, I will probably inform the viewer of the necessity of supporting the programs that required an \"intense effort\".\n\nNow the other issue that is much more plausible to fix is that there are low-quality projects in the first place. There are two causes to this issue, and I will address both. The first is that new programmers feel left out and wish to be known like all of these other programmers. It can be pretty intimidating when someone realizes just how difficult it is to garner votes and attention. As Lin Gh. put it (I assume you know who she is.), (note that this is a paraphrase) \"It isn't a bad thing to want votes.\" There are much, much worse ways to get votes, and a platformer template or two or a meme here and there won't bring Armageddon, but it is most certainly a cause of alarm. Either the programmer feels this desire to be popular without effort (unsolvable from our position), or the desire to be popular with effort but no one willing to pay attention. Hence, the best way to solve this issue is to constantly monitor the \"Recent\" list and vote on projects vote-worthy, regardless on whether or not they are noticed.\n\nThe last cause is that these programmers may have the capacity to become stellar programmers, but are lacking the assistance needed to create such projects. These would be projects that may not seem quality at the surface, but to the user seem to the utmost standard. The best way to solve this issue is to help as many users as possible which KA has conveniently built a system in just for that. Help requests and discussion questions are being answered frequently, and help is in abundance, so what is the problem? We are neglecting to help those who don't feel comfortable to post help requests, perhaps out of fear of being insulted for being \"so dumb\" (which I have found a user who did as said recently) or of \"not being good enough\". I might seem to be taking this to an extreme, but you cannot deny the reality that the KACP is facing. (If you would like me to hunt down the post, I would be glad to.) How do you help someone who doesn't ask for it? How do you meet a need that you don't even know exists? By providing constructive, positive feedback that nurtures those programmers to their fullest potential regardless if they ask. Now, you shouldn't tell them that what they are doing is wrong, but rather suggest that there is a better way. If someone seems to have a hit a roadblock, go the extra mile and fix it for them regardless if they ask. If a user sees this as intrusive, then we will respect their wishes, but unless otherwise noted helping, supporting, and caring are the best options.\"\n\nedit: it is more frustrating then anything for me, but consider the other novice programmers that could have made it on the HL if your program hadn't taken up a spot. what if the next GG is just waiting to be found but can't find the motivation without being noticed? please be considerate of others."},{"date":"2021-10-20T18:21:03.210991Z","msg":"Ooh, definitely going to continue stalking this, o.O."},{"date":"2021-10-08T17:20:43.072645Z","msg":"Keep up the great work! Can't wait to see this finished, :)."},{"date":"2021-10-07T19:42:44.71684Z","msg":"This looks amazing. I'll have to wait to see how it turns out. Also, you should probably color the tree trunks a little darker if you care to, :)."},{"date":"2021-10-07T17:13:40.622383Z","msg":"Nice graphic!"},{"date":"2020-10-21T18:20:31.312291Z","msg":"Isn't this more of a method rather than a function?"},{"date":"2020-10-06T17:10:49.45582Z","msg":"If you don't mind me asking (you don't have to answer), but what happened with 'OsuKi-ai!'? Has he just become less active?"},{"date":"2020-02-06T16:00:23.084548Z","msg":"I'd play it if you _gave_ me money, >:). It really depends on complexity and user experience, so without knowing what others think of it I can't really say anything."},{"date":"2020-01-23T11:29:56.561445Z","msg":"Hmm...interesting. The purple text doesn't really fit Oh Noes and the dark background. Despite being a Thanos quote, `fill(150,200,150);` works better. It is practically the color of Oh Noes, so it looks like he is saying it. Besides, the color of the text (which is probably just me), the particles were done pretty well to reform Oh Noes."},{"date":"2019-12-17T22:11:19.477816Z","msg":"The cursor stays a hand/pointer after I click the subscribe button. I fixed it here. No credit needed. https://www.khanacademy.org/computer-programming/fixed-cursor-glitch/6095174811795456"}],"ANSWER":[{"date":"2023-03-03T16:19:01.634225Z","msg":"glad you enjoy it, :D!\n\n`window.open` is the key. relevant code is on lines 695 to 707.\n\n1. open the window an' assign it to a variable. `const win \n= window.open()`\n2. open the document for that window. `win.document.open()`\n3. write the contents of the current webpage into the document. `<!DOCTYPE html>` is standard practice for all webpages which is followed by the `outerHTML` [includes the tag of the element] of the `html` tag. `win.document.write(\"<!DOCTYPE html>\" + ${document.getElementsByTagName(\"html\")[0].outerHTML})`\n4. close the document since we're done writin'. `win.document.close()`\n5. this is a unique aspect of my fullscreen functionality. set the `fullscreen` attribute of the new `window` to true [`!0` is a shortcut of sorts]. `win.fullscreen = !0`.\n\nbased on whether the `fullscreen` attribute is true i display the fullscreen icon, therefore you can't open a new screen once you're already in fullscreen mode."},{"date":"2023-02-24T00:24:08.893661Z","msg":"yes, please. i have no clue why KA won't recognize the two functions `println` an' `clearLogs` as globals. it started at 1.8.6 an' kept goin' 'till 1.8.8, =/."},{"date":"2023-02-20T21:10:00.563811Z","msg":"based on PJS, it's for everythin' which is what i based mine off of.\n\nit might make more sense to do everythin' but transformations for greater user control, but that's also reduced performance."},{"date":"2023-02-10T02:47:04.806795Z","msg":"a better question would be if you want rage's collisions in particular or just circle-rect collisions. i've optimized the collisions further in the `collision.js` addon of ski.js, but here's the code from rage.\n`_*https://www.khanacademy.org/cs/-/4634057996812288*_`"},{"date":"2023-02-07T21:20:24.243491Z","msg":"no promises, but i might give it a whirl."},{"date":"2023-02-02T09:36:39.016052Z","msg":"actually `var` counts as a global variable as long as the script type is not set to `module`, ;p."},{"date":"2023-02-01T16:10:42.228723Z","msg":"not yet. it's missin' a bunch of featurez, so i'll add those in soon an' release then.\n\nthere's a major bug with enemy collisions that i haven't fixed [enemies glitch through wallz] an' there are s'pposed to be multiple maps in the town. i might update the couch graphic as well as the weapon GUI in the release as well."},{"date":"2023-02-01T15:25:51.043726Z","msg":"the first thin' to consider is that you're forced to work in a module which isn't attached to the global scope. line 2694 wouldn't work.\n\n`fps` is a global variable that defines fps instead of `this.__frameRate`.\n\nevent listeners haven't always worked properly, so you'll need to add the `event` parameter. instead of `mousebutton`, `e.button`. instead of `key`, `e.key`. instead of `keyCode`, `e.keyCode`.\n\ni don't see anythin' else right away.\nski.js doesn't differ from PJS that much. it only opens the door for more complex JS. i'll get back to you with Embers in ski.js when i get the chance.\n\n[to flag you'd just have to hate Lemon]"},{"date":"2023-01-23T10:41:11.790221Z","msg":"nope. hasn't worked since the project API endpoints were deprecated a couple weeks ago, =/."},{"date":"2023-01-14T22:51:51.847322Z","msg":"first an' foremost, it allows us to create bigger projex without bein' limited by PJS.\n\nsecond, everyone will be able to employ more advanced programmin' concepts which opens a learnin' opportunity.\n\nlast but not least, it is bound to improve our score if even by a small margin due to code complexity."},{"date":"2023-01-14T21:17:57.641707Z","msg":"read lines 18 to 38 an' then lmk if you have any questionz."},{"date":"2023-01-12T00:24:14.727077Z","msg":"no sir. i am not."},{"date":"2022-10-15T22:57:59.929112Z","msg":"create a new project. post your code. adjust the width an' height as necessary. done."},{"date":"2022-10-10T20:21:55.650179Z","msg":"i've never personally reached the character limit, but i've been told that the file size of any program cannot exceed 1MB. savin' will simply error out an' the \"save\" button will be stuck on \"saving...\"\n\nthe best way is to store all code on GitHub. there are issues with this such as the need to constantly test an' tweak code. i would work on chunks of the code at a time. due to the limitations an' restrictions of this environment (particularly the scope of exported variables), there are quite a few workarounds necessary for different situations.\n\nif you want a surefire method that would only last for a few months (perhaps less), you could simply abuse (not literally) the API."},{"date":"2022-10-05T20:54:52.989811Z","msg":"the idea was for this contest to inspire creativity an' quality in the form of a rickroll, not flood the HL with a bunch of rickrolls."},{"date":"2022-08-22T22:54:49.546914Z","msg":"could i have a link?\n\nthree ideas that come to mind.\n\na.) blank nodes were needed for older browsers (specifically IE), but KA no longer supports IE so idk (they've also made some pretty darn silly dev mistakes, so i wouldn't put it past 'em havin' things that don't need to be there).\n\nb.) blank nodes could just be empty `script` tags for imported scripts or `link` tags for stylesheets. it depends on which nodes these are.\n\nc.) since you're in a sandboxed `iframe`, we don't have full access, so they could've restricted the capability of webpages to read the nodes.\n\nunless smth changed, i think you should still be able to access what you need without encounterin' the blank nodes. i would at least be able to find a workaround for you, :)."},{"date":"2022-08-20T22:59:38.220454Z","msg":"that's the issue. you'd have to know the previous endpoints to utilize 'em.\n\nthere's actually quite a lot on spin-offs currently in the API, _BUT_ it seems that KA goes off the data initially set, so it can't be changed (a.k.a. i've already tried). width an' height can be changed after the program is initially saved, as well as thumbnail, in normal conditions but the content type won't."}]}