{"REPLY":[{"date":"2023-03-15T01:29:40.118003Z","msg":"Bonjour, Tyler! Je m'appele Marie!\n(Why did I do that? Je ne sais pas.)\nI am bored once more, lol. So, ofc, I'll just annoy you, and, ofc, just don't respond if you don't wanna :p\n\nI need to get a life again b'cuz now my Tuesdays and Thursdays have opened a bit which sucks 'cuz I like actually having smthn to do; I'd die of boredom elsewise :pp\n\nHow's life?\n\nOn a slightly less tangential point, are there any particular backgrounds you want me to make for the CoC program? Maybe I can put this time to a bit of useless use. And portal gun or time machine? I already made a time machine, so idk if I should make both... =P"},{"date":"2023-03-14T22:48:14.678328Z","msg":"Rip, my schedule has now reached a significantly healthier status b'cuz my parents have [understandably. It's an hour away, lol] refused to drive me back from track on Tuesdays and Thursdays xPPP\nI hope I don't get kicked out of the team b'cuz of that, tho >:(((\nI always have HS, ig. And it might be even better b'cuz we're moving... To the US... To Virginia... =P"},{"date":"2023-03-14T21:15:41.286623Z","msg":"xD\n(So would I, tbh, lol)\n\nI did! :D \n...\nUnderstandable, tho, ngl :p\n\n=)"},{"date":"2023-03-14T17:42:06.682423Z","msg":":D\nLol, imo, the 45 min ride back home is plenty enough time xD\nBut yes. Soggy granola bars ftw! (I don't actually eat in the shower, ofc...)\n\nThat's true.\nSo are vegetables.\nNot everyone enjoys them.\nB)\n\nYup :)"},{"date":"2023-03-14T17:22:32.041076Z","msg":"Yeah :DD\nI mean, why tho xD\n:DDD\nMe, too. Life is boring sometimes but it's not so much atm =P\n\nAww. Well, that awkwardness should dissipate soon enough, too :)))"},{"date":"2023-03-14T17:01:31.774202Z","msg":"- ski.js is _running_ normal JS in HTML, but things I used in the code like `strokeWeight` aren't in 'normal JS', as you know; if you were rendering graphics using normal JS on an HTML5 canvas, it'd be `ctx.lineWidth`. I was talking about the game's code not being in normal JS, not ski.js not being in JS. That's obviously JS, lol.\n\n- There's just a blank loading screen for, like, 45 seconds if it's `loopTimeout` by dkareh or KWC, and idk any others, so perhaps I'm mistaken. Ik there's `jshint:ignore` or `jsesnext:true` and those, but that's not what I meant, :p. If you toss in `type`, even if it's blank, in the `<script>` tag, there's never any wait or delay and it always works =p\n\n- Is that legal?"},{"date":"2023-03-14T14:36:16.577339Z","msg":"Ah.\nPolar's bot.\nThat'd make sense.\nxD"},{"date":"2023-03-14T11:22:40.86357Z","msg":"Oh, lol, I should've done that xP\nBut now, doing that with 43 votes might attract even more attention xPPP"},{"date":"2023-03-14T09:42:09.394265Z","msg":"Hi, who are you and why are you spamming me with base64-hashed decimal points?"},{"date":"2023-03-14T01:55:37.923119Z","msg":"Lol, where were the latter from, then?"},{"date":"2023-03-14T01:47:37.584165Z","msg":"No, but seriously, why does that have 8 votes xD"},{"date":"2023-03-13T15:57:31.810397Z","msg":"@Jake K -\nNot too familiar with them, but Ashkenazy. And have you heard their double concerto? I'm sure you have... o.o\n\nBeethoven is amazing and _Moonlight Sonata_ is beautiful, although I wouldn't call it my favourite. _Symphony No 3_ is his best imo. Vivaldi's _4 Seasons_ is a stunning composition (my favourite is _Autumn_) and Chopin's _Fantaisie-Impromptu_ is insane, lol. I still like Rachmaninoff more overall :p\n\nWhat's your favourite key?\nI love G minor and F# minor."},{"date":"2023-03-12T21:46:24.334618Z","msg":"xD\n\n=D\nThe ratio? Ikr? It's crazy! I'm so happy, lol!\nI mean, I'd have run so... Yk... Sweaty... And in, like, the tank-top they give as jerseys, so obviously I'd wanna change xD\nThanks, me too :D\nProbs gonna get burnt out, though, ngl, but that's better than not having smthn to do imo :)\n\n_Yayyyyyyyy!_ :DDDDDD"},{"date":"2023-03-12T21:40:15.662282Z","msg":"Where?\nIdk, I only did the graphics [minus the blocks] and, obviously, I didn't copy you there xD"},{"date":"2023-03-12T21:10:33.924483Z","msg":"Those two slashes are to make it a comment on PJS :p\nThe actual slashes you don't even need =P\nTHANK YOUUUUUU :D"},{"date":"2023-03-12T21:03:55.449956Z","msg":"xD\nWe'll see if it was, ig.\n\nFantastic, actually! :D\nI got into the track team and, like, _dusted_ everyone, passed [it was 90% + to pass, o.o] an insanely difficult exam so I can skip another year in maths [if I pass the next phase, which I have super high hopes on], made a new friend, built something that is _insanely_ efficient [1275 : 1 STRENGTH TO WEIGHT, RATIO, HOLY _CRAP_], learned to do smthn, learned how to do another smthn, made tons of progress on CoC, and have garnered enough of a life to literally be busy straight down from 5 AM to 9 PM (school 'til 2:15, track 'til 4, home at 4:45, 4:45 - 5 shower + quick snack, 5 - 6 singing practice, 6 - 6:30 help with supper or exercise or smthn, 6:30 to 7 eat, 7 - 8 planning for a large event, 8 - 9 studying, 9+ _finally relaxation,_ lol. I'm happy, though :D)\n\nHow about you? How was your week?"},{"date":"2023-03-12T20:52:28.09634Z","msg":"Pretty much, same.\n\nLol, oki :p\n\nCan you release the scores for the Friendly Collab Challenge?"},{"date":"2023-03-12T14:00:12.338716Z","msg":"Well, certainly not before October. I've gotta learn how to do logic and make games, ig. And I'll be inactive from around April to August so no time... :p\n\n'Tis true =)\nYup.\n_Yup._"},{"date":"2023-03-12T13:49:11.418234Z","msg":"Lol, yep xP\n\nI thought I did, tho... SP told me so I made another program and deleted the old one with the same name, but doesn't look like it worked, lol, idk... Seems to have worked for him, tho, so v(0-0)v\nMaybe it doesn't work in HTML, yea, ;-;"},{"date":"2023-03-12T13:14:22.968509Z","msg":"Thanks, lol\n\nIf you did, we'd sound pretty similar so you wouldn't point out my accent xD\n>:)\nI mean, same, _lol_\n\nThanks again, heh. Finding random PII ftw! :p"},{"date":"2023-03-12T02:59:11.731952Z","msg":"Most KA users are American so my default goes there. Timezones match, somewhat. Most words are spelt using the American spelling. Your reaction to my being British; teasing my accent online, you probs do not have received pronunciation, which'd really limit the number of countries you could be in. America? High likelihood. Canada? Colour? Also decent likelihood.\n\nOr perhaps I'm completely wrong v(0-0)v"},{"date":"2023-03-12T02:55:37.463989Z","msg":"@smore ingredient #1 -\nAs to your original comment, dear mr grammerly, _nah,_ I won't name 'em after politicians; I should start naming them after you morons xD\nI'll start with glasses, then nInJa, then yahoo... You three just form your own gang... Call it the \"we love ticking off KA gang\" or smthn. Btw, bets on how long 'til I get milkshaked? Literally, this thread is... o.O\n\n@Tailwind -\nHmm.\nIg you'd have to be vxs.\nYou weren't a part of the 'others' I was speaking of, but unless someone made another alt, I doubt you're any of those guys. Yet you seem to know smthn [albeit not everything...? Do you know his non-commenting-alt?], so, v(0-0)v, hi, fancy meetin' ya, you're rather infamous :D"},{"date":"2023-03-11T20:22:29.096598Z","msg":"It's never gonna get finished, lol.\n\nThe team? \nWe probs work the best together out of all the other teams, ngl :)\nBut I'm not gonna take up any collabs in the future nor do CoC again."},{"date":"2023-03-11T20:17:39.080782Z","msg":"The thing that makes your alts so obvious is the way you phrase stuff\nAnd the emoticons you use\nDo the others know this one yet?"},{"date":"2023-03-11T20:02:17.038546Z","msg":"Still, you could've stuck a bunch of random letters at the end or smthn xD\n\nOfc c:"},{"date":"2023-03-11T17:52:08.201108Z","msg":"That's a very unique name, lol.\n\nYes c:\nWhen a banana gets banana-ed, it becomes a milkshake, therefore it has been milkshaked :d"},{"date":"2023-03-11T17:42:18.701114Z","msg":"I saw, lol. How do you come up with those? Generator? Randomly pickin' out names?\nWonder how long before this one gets milkshaked..."},{"date":"2023-03-11T17:34:50.294038Z","msg":"_This_ is your alt's name when I don't give you another nickname? _Smh._"},{"date":"2023-03-11T14:33:31.87769Z","msg":"Oh, cool! Ours is an entirely different letter, lol, but many follow the same basic rules for the \"addons\", so to say.\n\n:O"},{"date":"2023-03-10T22:42:35.543749Z","msg":"I personally have an affinity toward Rachmaninoff; his Cello Sonata is absolutely amazing, probably my favourite piece (cellos and pianos ftw!). I also love Schumann. Actually, I love Romantic era music in general, although I wouldn't say I'm a fan of opera. Verdi is amazing, though. It's really nice to see other classical lovers :D"},{"date":"2023-03-10T22:00:49.342998Z","msg":"`$[\"rick astley\", 0, \"i want cake\"]$`"},{"date":"2023-03-10T21:48:21.751201Z","msg":"*Deadline Update*\nThe final challenge, the 'No I in Team' challenge, will be extended by 10 days ('til 30 March), as per request. Good luck! =)"},{"date":"2023-03-10T21:29:40.113353Z","msg":"Oki :)\n\nDone, but it's now on https://www.khanacademy.org/cs/i/6110739742113792 b'cuz updates go brrrr"},{"date":"2023-03-10T21:10:05.828032Z","msg":"Can you add that in the future?"},{"date":"2023-03-10T20:44:19.390272Z","msg":"Can you specify text width + height (`text(\"\", x, y, w, h)`) on ski.js?"},{"date":"2023-03-10T15:09:32.549084Z","msg":"Do you combine the consonants and vowels to get other combo letters or just put them side-by-side like in English? That's interesting tho :D\n\nOki, xD, I can't do Hindi either, lol. Ik a lot of other random languages but perhaps I should focus more on the Indian ones, huh... xP\nFrom there, don't live there anymore.\nYou follow IPL?\n(yes, this is my 1st question when I find someone's Indian, _lol_)"},{"date":"2023-03-10T10:52:33.599727Z","msg":"Well. There are 12 vowels and 18 letters, both of which can be used separately. And then 12 vowels ? 18 consonants to make more letters. Combo letters, ig. And then one unique letter that makes the consonants sound like i + [consonant]. There are also special letters (that I didn't count in the 247; they're called Grantha letters) that are really similar to Sanskrit, like ????, sri, and are used pretty much exclusively for writing English or Sanskrit in Tamil.\n? > ka, consonant\n? > aa, vowel\n? + ? = ?? > ka + aa = kaa, but kaa is also just a letter\n? + ? = ?? > ka + uhk = ik\n? is only a half-letter, though, it can't be used elsewhere, except for one or two words like ????, meaning steel :p\n\nThat is painfully relatable xDDDD\nAre you Indian? Or just learning Hindi on Duolingo, lol...?"},{"date":"2023-03-10T10:52:33.599727Z","msg":"Well. There are 12 vowels and 18 letters, both of which can be used separately. And then 12 vowels ? 18 consonants to make more letters. Combo letters, ig. And then one unique letter that makes the consonants sound like i + [consonant]. There are also special letters (that I didn't count in the 247; they're called Grantha letters) that are really similar to Sanskrit, like ????, sri, and are used pretty much exclusively for writing English or Sanskrit in Tamil.\n? > ka, consonant\n? > aa, vowel\n? + ? = ?? > ka + aa = kaa, but kaa is also just a letter\n? + ? = ?? > ka + uhk = ik\n? is only a half-letter, though, it can't be used elsewhere, except for one or two words like ????, meaning steel :p\n\nThat is painfully relatable xDDDD\nAre you Indian? Or just learning Hindi on Duolingo, lol...?","edited":true},{"date":"2023-03-10T10:52:33.599727Z","msg":"Well. There are 12 vowels and 18 letters, both of which can be used separately. And then 12 vowels ? 18 consonants to make more letters. Combo letters, ig. And then one unique letter that makes the consonants sound like i + [consonant]. There are also special letters (that I didn't count in the 247; they're called Grantha letters) that are really similar to Sanskrit, like ????, sri, and are used pretty much exclusively for writing English or Sanskrit in Tamil.\n? > ka, consonant\n? > aa, vowel\n? + ? = ?? > ka + aa = kaa, but kaa is also just a letter\n? + ? = ?? > ka + uhk = ik\n? is only a half-letter, though, it can't be used elsewhere, except for one or two words like ????, meaning steel :p\n\nThat is painfully relatable xDDDD\nAre you Indian? Or just learning Hindi on Duolingo, lol...?","edited":true},{"date":"2023-03-09T23:36:19.191737Z","msg":"It's the one for the current round, so new, I suppose."},{"date":"2023-03-09T03:03:10.902589Z","msg":"That is not how it should look.\nI know I'm using it only on the gradient and the gradient should not look like that. Check GH again for an example :)\nI'm using posterize on the gradient and layering said gradient atop the menu. The gradient should still have posterize and I don't _want_ the rest to have posterize b'cuz that's stupid."},{"date":"2023-03-08T23:27:33.368551Z","msg":"Perfect, nice job :)"},{"date":"2023-03-08T23:25:20.959399Z","msg":"https://www.khanacademy.org/cs/i/5620217076301824\n\nUncommenting line 306 makes everything black. It shouldn't be black b'cuz of the alpha value. What did I screw up this time?"},{"date":"2023-03-08T22:20:28.08399Z","msg":"The gears are gonna be somewhat hidden anyways using a posterized gradient to make the text and buttons pop. Yellow on it would detract attention from the text in the foreground b'cuz yellow, being such a bright colour, naturally attracts the eye ;p"},{"date":"2023-03-08T10:48:34.440054Z","msg":"=)\n\n_I meannnnn_... True, ig xD\nA lot of stuff, lol.\n\n:D\n...A lot of stuff, lol."},{"date":"2023-03-08T03:02:58.343981Z","msg":"Yup, lol. Aw, that's nice :)\n\nI really don't say it much :p\nJust me giving love advice to a [completely platonic] friend of mine who's a guy xD\n\nChanged my bio yet again, lol.\nMan, I'm just so generally _ded_ xP"},{"date":"2023-03-07T18:11:06.609537Z","msg":"Yep! :D\nThey're super freaking easy, too :DDD\n\nLol, thanks! Nope, no images, 'cept the masked ones >:)"},{"date":"2023-03-07T17:36:05.548684Z","msg":"@Animation Guy -\nB'cuz 50,000 calories per meal with 30,000 calories of snacks in between is downright insane and startlingly unhealthy. Perhaps you're mistaken in the count?\n\n(My concern merely increases as the phrase \"only 54 Oreo cookies\" appears... \"Only\"... o.o)\n54 Oreo cookies a day.\n893 Oreo cookies a day.\nWhat seems healthier? \nYour, ah, _method_ may give you more Oreo cookies but mine gives you more... You know... _Years alive_ xD\n\nThink\n\n...Also, yes, perhaps if they were Chips Ahoys as opposed to Oreos I would join you in eating that 893 xD"},{"date":"2023-03-07T17:00:06.930314Z","msg":"Lol, I'm a tad bit concerned, you guys!\nFemales should eat from 1600 - 2400 calories a day and males should eat from 2000 - 3000 calories a day :p\nI have no idea how much I eat but I weigh around 48 kg, around 105 lbs, lol (5'4, female).\n\n@Sprout -\nAnd some soil might help too :d\n\n---\n\nPoor Astro\nGetting spammed this much\nRip\nWilling to be he'll delete his comment, lol"},{"date":"2023-03-07T15:04:23.619061Z","msg":":p\nEh. I wouldn't say coding is particularly my favourite thing to do so idrc, lol.\n\nYes c:\nIt is annoying\nLike me C:\n\n:DDDDDDDDD"},{"date":"2023-03-07T14:17:40.179644Z","msg":"- :D\nI'm doing track rn and I get home at 4:45 PM on Tuesdays + Thursdays ('lil more frequently when there's a race coming up). Can only begin 'coding' after 8 PM, tho, lol. But I love running, and I'm good at it, so... :D\n- It was during Khantober and got barely, like, 50 votes xD\nLemme go fish out the link somewhere ig, lol\n\n:DDDDDDD"},{"date":"2023-03-07T14:00:17.937744Z","msg":"- Okay, true, lol.\n- You definitely did deserve to be there, and hey, it looks like you might even be a cap'n next year :p\n- I've made one game, lol, and it was sad ;-;\nI'm gonna try and make a better game at some point xD\n\n:DDDDD"},{"date":"2023-03-07T13:29:51.220013Z","msg":"Which still means I won by default ;p\n\nI mean...\n- *I* didn't make a program _rightfully_ criticising the KACP; I'm not good enough at coding to do that, lol\n- *I* wasn't 90% of the CoC captains' first or second pick\n- *I* don't know how to make games xD\n\n:DDD"},{"date":"2023-03-07T13:25:19.706184Z","msg":"Ah, you mean the stars for the hero? That can be fixed, lol. It's actually the same image, except I used complicated SVG filters to make it look cooler >;)\nThanks! :D"},{"date":"2023-03-07T13:17:35.177018Z","msg":"That'd be an ESTJ, then.\nRather surprised, lol. You don't seem like an ESTJ here, but ig idk you well enough on that :p\n(And I'm not scary intelligent if I screwed the order that much xD)\n\nSome people here are _super_ obvious to guess, though, lol.\n\nAlso, yay, someone else who knows smthn about cognitive functions on KA! =o\nAnd, lol, I didn't memorise, but the method for finding cognitive functions after looking at a type is quite easy ;)\nIf the first letter is E, the third letter + E is the dominant (ex: ESTJ > T + E = Te). Auxiliary is the opposite extrovert/introvert for the second letter (es: ESTJ > Opposite of extrovert [thinking] is introvert. 2nd letter S. S + I = Si.). Tertiary is the opposite of auxiliary (ex: ESTJ > opposite of Si is Ne). Inferior is the opposite of dominant (ex: ESTJ > opposite of Te is Fi). See, easy! :D"},{"date":"2023-03-07T13:06:57.562324Z","msg":"Done."},{"date":"2023-03-07T03:19:05.445717Z","msg":"Lol, a win by default is still a win! >:D\n\nWhat does that mean?\n\nMost, ngl. I'm only good at stupid graphics and am currently learning how to make webpages (dunno if you saw my updated subpage but that's probs my best one yet, lol)\n\n:D"},{"date":"2023-03-07T02:42:17.267335Z","msg":"Ty lol\nPage looks better, no?\n\n:D\nHmm.\nCognitive functions.\nYou have Fi, looks like.\nThat'd mean Te.\nI don't think you have Ni, so Ne, which would be Si.\nI cannot, however, decide the order of these functions...\nDominant, auxiliary, tertiary, inferior...\nLooks like Ne dom. If it's Ne dom, it's aux Fi, tertiary Te, then Si inferior.\nIf you're anything irl like you are on here, you are an ENFP. Perhaps an INTP irl, but here, you appear to be an ENFP, or against my better judgement (confused 'bout high Fe, too; trickster function?), an ENFJ :)"},{"date":"2023-03-07T02:16:31.971988Z","msg":"I love the 'this time', lol.\nCurrently, the one-up scores are:\n\nS. M. V. - 2 (this and the logo >;))\nbread - 0 (_hahahahah_)\n\nJk, we both know you're a better coder than me, lol\nThis is just fun, tho\n:p"},{"date":"2023-03-06T22:02:32.361669Z","msg":"Sweet lol\n\nI'm sure he could xD\n\nMine was better tho >:D"},{"date":"2023-03-06T16:53:06.213911Z","msg":"Lol, mine is better, tho :p"},{"date":"2023-03-05T13:30:19.348311Z","msg":"Ah, yes, ofc it was; I made it B)\n...SuReLy TO tAlk to Me and My FaNtAbUlOuS peRSoNAlity, tOO? \n(Jk, ofc not; at that time, you didn't know me, lol)"},{"date":"2023-03-05T04:24:19.010612Z","msg":"Cool :o \n\n:D\nLove that confidence xD\n(Definitely justified, though :D)\nOfc, this community is awesome, super glad to be here =)\nAnd I'm also glad RS spawned into that thread months ago, lol :))"},{"date":"2023-03-05T04:21:03.659453Z","msg":"Not really, idrc myself :p\nJust not a big thing, lol.\n\n:)"},{"date":"2023-03-05T03:54:44.792875Z","msg":"Noice. Brave the browser, I presume? \nAlso how the heck do you have both parental controls and TOR; you're what... 16? o.O\n\nAh, coolio :D\nmr grammer, you've learned a crazy lot for 2 years, though, o.o"},{"date":"2023-03-05T03:35:53.755977Z","msg":"Certainly will, with your talent! :D\n\n_Man._\nYour passion is obviously cyber-security\nI wish I had a passion like that that'll lead me somewhere in life, lol =/\n\nWhen did you start coding? :p"},{"date":"2023-03-05T03:28:04.071686Z","msg":"It's fine, lol. I don't celebrate my birthday irl anyways so who even cares, really xD\n\nEverything'll be alright; it always turns out that way :D"},{"date":"2023-03-05T03:25:25.20342Z","msg":"So\nIg you're gonna be one of those super-cool h4cky spy people for the CIA or smthn when you get older xD"},{"date":"2023-03-05T03:15:25.903139Z","msg":"=)\nI'm not comfortable sharing my exact birthdate here at all, lol. You're not going to receive that information from me :)\n\nOof, okay. Glad it's better now =)\nxD"},{"date":"2023-03-05T02:46:45.33586Z","msg":":p\nB'cuz. Why? >:)\nNo. But stop guessing, lol, I don't want _all_ my PII leaked here, smh xD\n\nWhy, what happened? o.O\nNoice :D"},{"date":"2023-03-05T02:31:33.074103Z","msg":"Oh. Welp. Oki, then, lol.\nThe answer is no, heh :p\n\nHow's life?"},{"date":"2023-03-05T02:06:47.641308Z","msg":"I do want them answered which is why I'm asking... :p\nI might answer that after you answer mine =P"},{"date":"2023-03-05T01:36:42.699364Z","msg":"Yay :D\nWhy those in specific? xD"},{"date":"2023-03-04T20:11:44.20078Z","msg":":D\n\nAh, yeah, the SVG layering is screwed for some reason and I'm not able to fix it! `z-index` hasn't been helping with that, either xP"},{"date":"2023-03-04T20:09:35.690947Z","msg":"It's November, lol."},{"date":"2023-03-04T20:08:12.85937Z","msg":"I am right, lol. You can Google 'WebRTC leak' if you want, and it'll show up :p\nEven through a NAT Firewall, VPNs, proxies, and apparently now even through TOR, it could get your IP which is kinda terrifying, ngl. \nAlso wow, you  have a ton of security o.O"},{"date":"2023-03-04T04:23:12.357351Z","msg":"**_they're_ >:p\nUse the WebRTC API to communicate with a STUN server and it could reveal your IP even if you use a VPN o.o\n\nGo to bed xD\nI gtg anyways :p"},{"date":"2023-03-04T04:11:10.771713Z","msg":"Oh, cool. Were you doing smthn with WebRTC leaks? \nOki :p\n\nYou should probably go and sleep, lol.\nIt's like 10 there, right?"},{"date":"2023-03-04T04:01:19.886282Z","msg":"Why are some of your recent programs about IP logging? I didn't click on them for obvious reasons, lol, but _why?_"},{"date":"2023-03-04T03:50:50.558091Z","msg":"Yep, lol.\nOh my goshhhh, mr grammer, _please_ don't tell me you didn't know of `ctrl + h`! xDDD"},{"date":"2023-03-04T03:10:29.119408Z","msg":"I literally told you on the chat the time you asked for feedback, though xD"},{"date":"2023-03-04T01:52:49.745774Z","msg":"=P\n\nNope, lol.\nMy exact birthday? I doubt it... It's been a few months tho :p"},{"date":"2023-03-04T01:50:55.720589Z","msg":":D\n\nYep! From my original code [on a GitHub repo atm, lol]:\n```\n    <!-- HOLY CRAP IT WORKS [the second]: loading -->\n    <!-- <script type=\"module\">\n        let load = document.getElementById (\"load\");\n        let menu_tab = document.getElementsByClassName(\"menu_tab\");\n        \n        const delay = (millis) => {\n            return new Promise(resolve => setTimeout(resolve, millis));\n        }\n        \n        const hide = async() => {\n            await delay(1500);\n            load.style.opacity = 0;\n            await delay(2000);\n            load.style.display = \"none\";\n        }\n        \n        hide ();\n    </script> -->\n```\n\nThat you are :D\n(Although I've only seen one of 'em, maybe I'll dig through your projects later, lol.)\nWhy thank you! You actually have no idea how much that means lol :DDD\nAnd yes, they're so easy. Even easier than `begin`/`endShape`, tbh, lol.\n\nAh, yeah. Improved my CSS, though; everything for the nav-bar (except showing active) is done using CSS! >:D\nYeah, I'll probs just leave 'em, lol.\n\nFix the sticky menu? Sorry xP"},{"date":"2023-03-04T00:49:44.353448Z","msg":"But everything is impossible until it happens >;)\nIt is :D\n\nMy birthday? I can't tell you that! Lol"},{"date":"2023-03-03T23:27:41.793923Z","msg":"In a final sense, what information is not \"useless\"? What will truly help us? What will being able to \"apply\" it ever do? We're all heading to the same place in the end, lol, so what even... _Matters,_ really? I suppose only time will tell... You never know what's actually useless until you need it :p\n\nAlso, you have bragging rights for being my friend >;P\nAnd for being the best savage ninja ever :D\n...You're a fantastic person, yk, and you're the only one of you to ever exist, so you already have bragging rights for that, and you always, always, will ;)\n\nNow wouldn't it be cool if we could clone not only ourselves, but also experiences?"},{"date":"2023-03-03T22:56:01.577428Z","msg":"_And the crowd goes wilddddd!_\n\nYeassss, Mr Maple Syrup! Maple Syrup and french toast, the perfect combination :D"},{"date":"2023-03-03T22:28:07.776243Z","msg":"_Oui! Oui!_ \nNow the only thing missing is maple syrup xD\nLet's see if we can spawn mr maple syrup in here _>=D_"},{"date":"2023-03-03T22:16:55.541308Z","msg":"_A plagiarised program is around the top! The plagiariser has also plagiarised my projects and then - get this - asked me to help them plagiarise, more or less!_ I just didn't respond, lol, but o.O\n:DDDD"},{"date":"2023-03-03T22:03:48.197729Z","msg":"_Plot twist: tHe ToasTEr eatS yoU_ :oooo\nNo. Thou hast become a burnt bread :d xD"},{"date":"2023-03-03T21:55:57.881207Z","msg":"_Puts bread in toaster_ >:)))"},{"date":"2023-03-03T21:54:57.40165Z","msg":"Why were you mad lol\n:DD"},{"date":"2023-03-03T21:49:17.150196Z","msg":"My, my, my, what a sweet bio we have there, eh? Lol! Though, now I'm doubly satisfied you asked _me_ to make Primavera avatars xD"},{"date":"2023-03-03T21:45:40.868943Z","msg":"_Steals bread's popcorn then yeets it back at Sprout b'cuz I don't like popcorn but bread is bread and we must steal from bread_ >;)\n\nWe were where we were which was where?\n\n_Smirks at bread b'cuz bread_"},{"date":"2023-03-02T17:13:42.903776Z","msg":"?De verdad hablas espa?ol o era un traducor?"},{"date":"2023-03-02T17:13:42.903776Z","msg":"?De verdad hablas espa?ol o era un traducor?","edited":true},{"date":"2023-03-02T17:13:42.903776Z","msg":"?De verdad hablas espa?ol o era un traducor?","edited":true},{"date":"2023-03-02T17:11:05.196313Z","msg":"Not just travel, there's also a ton of other stuff going on.\nBut to go there, I'm leaving on the 5th of June and returning on the ~23rd of August."},{"date":"2023-03-02T16:22:04.43204Z","msg":"Ask\n- DR\n- Astro\n- LG\n- ski(-ish)\n- Sprout\nif I am annoying and see what they say ;p"},{"date":"2023-03-02T13:43:45.548331Z","msg":"Ty, ty, tyyyy, I'm so _awesome_ that way >;DDD\n\nToo bad I'm not gonna be around for it, this year at least xP\n\nYes it is and you know it, too >:P\n**mr wheelZ\n:D\n#modesty ftw xD"},{"date":"2023-03-02T12:27:30.138892Z","msg":"1) Way too true xD\n...But I am the most annoying person on KA anyways, so... >;p\n2) Alright, I'll fix it once I get the chance again :D\n3) Lol, yepp :p\n4) =P\n\nI love SVGs, lol. Thanks :D\n\n'Tis\n\nYeah, that's probably true, lol.\n\nAlright :p"},{"date":"2023-03-02T02:59:27.09352Z","msg":"Thank you! :D\n\n1) Ah, thanks for the feedback :). I personally like it a 'lil longer, tho, so I'm just gonna keep that there for now ;p\n2) That's 'cuz it's a `box-shadow`, lol. Line 304. Fixed now, is it better? :D\n3) True, lol. Too lazy to change it rn tho, xD, but I'll definitely keep it in mind for next time :)\n4) It seems to fit with the styling a 'lil better with both but maybe I'll change the 2nd one to posts =)\n\nAh! I doubt you'll find one like that ;)\nSeverely modified used `feCovolveMatrix` + `feDisplacementMap` and a kernel matrix; hardly recognisable at this point, I'd say :D\n\nThat's good to know, but sucks that it only works after you reload, smh xD\n\nTo you too!\n\n---\n\nYep, you did, lol."},{"date":"2023-03-02T02:47:37.167167Z","msg":"As you should >:D xD\n\nAlright! Yepp... But hey, you're talkin' to _me_, ofc they will >;p (yes, yes, yes, I be a _master_ of humbleness, yes :D)\n\nOki :D\nWell, yeah, but the KACP is mostly ded, but :p\n\nRolling bread :o\nmr wheels :d\nYou'll be fineeee\nIt'll end up awesome, no doubt :D"},{"date":"2023-03-02T01:51:32.122463Z","msg":"That's what I'd have _expected_ =P\n\nOki =)\n\nAlr, will do\nAny specific themes? Like in my WCC, the elements or smthn like that...?\n\nOh, if there were 6 [didn't bother counting on that page xP] I don't mind making one more; not a particularly giant difference xD\n\nbread\nWhy do you sound so formal\nIt's weird\nLol"},{"date":"2023-03-02T01:47:50.317579Z","msg":"That's a tad bit confusing, lol.\n\nYup!\nI'm kinda surprised you heeded attention to the nicknames' capitalisation, tbh xD"},{"date":"2023-03-02T01:41:36.32698Z","msg":"_Eats in general_"},{"date":"2023-03-02T01:37:40.092587Z","msg":"(When have I said I make simplistic things?)\nUm, thanks again ig, lol\nLiterally just scaled my SVG logo on my subpage here to use as my pfp irl... :p"},{"date":"2023-03-02T01:33:28.751455Z","msg":"Lol, thanks :D\nHmm, idk. Perhaps I will, we'll see ;)"},{"date":"2023-03-02T01:31:25.072108Z","msg":"Did not at all expect that reaction xD\n\nAh, tysm for the link :D\nDo they each need to have 5 stages?\nAre you gonna use 'em as images using the thumbnail? (Animate or no? I'll make 'em separate too if necessary ;p)\n\nRight :D\nAlr, that's plenty of time, I'll go ahead and make 5 avatars :P\nLol, nice!\n\nAy, it's alright =)"},{"date":"2023-03-01T16:58:43.927037Z","msg":"You've been active on this account for, like, a week, and this is the first comment you've given to me despite my being the bestowe-r of your nickname ;-;\n_How could youuuu!_ :o\n\nEdit: Also, yea, your name is capitalised (from your bio ;p)"},{"date":"2023-03-01T16:52:53.529582Z","msg":">;p\nI know, right? I'm amazing like that ;DDD\n(Nice use of the word, btw xD)\n\n[Counters with arc-tangent :P]\nHmm, I'll see, I suppose. Extremely busy irl but if it's just avatars, those'll be easy and maybe relaxing, lol.\nWhen do you need them by?\nWhat do you need them to be about?"},{"date":"2023-03-01T12:17:34.053756Z","msg":"It probably won't but it looks a teeny bit more juiced =P\nJust add smthn like `+ 5*sin(frameCount)` to the y value on line 1345 maybe :p"},{"date":"2023-03-01T09:22:03.082468Z","msg":"@Biscuit -\nIt's not :P\nAn oreo is not a pastry, lol.\nA pastry is baked and has flour, water, and smthn like butter and is used as a base for pies or tarts or some other delicacies\nAn oreo [with cream in the middle] does not count as a pastry xD\n\n@CodingChamp01 -\nYeah\nCookies are the big ones\nDough-ier ones :p\nBiscuits are the ones that are awesome with tea\nI do like both tho :P"},{"date":"2023-03-01T09:14:51.033875Z","msg":"Lol xD\n\nWell, yeah, perfection is impossible :p\nBut you're better than most, lol.\n\n:D\nTrue =P\n:p\nNp lol"},{"date":"2023-03-01T09:12:17.179842Z","msg":"Thanks :D"},{"date":"2023-03-01T03:33:46.050543Z","msg":"Thanks =)\nMessing with that z-index screws up the rest of the stuff tho, lol. The up button and down button cease to work, for inexplicable reasons xP\nBut thanks for tryin' to help :)"},{"date":"2023-03-01T02:38:12.0868Z","msg":"That still wasn't the most brilliant idea tho\nOfc not B)\nOfc you have B))\nNow, to further rub salt in that wound, here's a quote from last week (during the debate w/Sprout): \nYou > \"idrc, i'm a better arguer than you are anyway >:D\"\n...See? You're really not >;D"},{"date":"2023-03-01T02:06:23.742014Z","msg":"Can we add a 'lil trig bobble to the characters? c:"},{"date":"2023-03-01T01:45:37.554364Z","msg":"?Hola!\n\nThank you! :D (It is, by quite a bit, but I shouldn't have copied material from the _Facts 'Bout Me_ blindly, lol. Fixed now :p)\n\nTy! _Smol hands ftw!_\n\nidek anymore lol:\nCoolio\n\nIkr?\nThanks! =)"},{"date":"2023-03-01T01:45:37.554364Z","msg":"?Hola!\n\nThank you! :D (It is, by quite a bit, but I shouldn't have copied material from the _Facts 'Bout Me_ blindly, lol. Fixed now :p)\n\nTy! _Smol hands ftw!_\n\nidek anymore lol:\nCoolio\n\nIkr?\nThanks! =)","edited":true},{"date":"2023-03-01T01:45:37.554364Z","msg":"?Hola!\n\nThank you! :D (It is, by quite a bit, but I shouldn't have copied material from the _Facts 'Bout Me_ blindly, lol. Fixed now :p)\n\nTy! _Smol hands ftw!_\n\nidek anymore lol:\nCoolio\n\nIkr?\nThanks! =)","edited":true},{"date":"2023-03-01T01:42:04.732257Z","msg":"Why the heck would someone make them shapes tho\nThat looks more unprofessional tbh; the default fonts' letters are more perfectly aligned and shaped and it's unnecessary to make them customised if the quality, speed, and effort/efficiency levels are compromised upon doing so :P"},{"date":"2023-03-01T01:39:14.713207Z","msg":"I won't b'cuz it never will! ;D\nOkay, I'm not \"arrogant\", I'm, ah, _self-confident_ xD\n\nB'cuz.\nYou are.\n:p\nLol\n\nThanks! :D\nThat's not all either, unfortunately xPPP\nThanks! Not that recent, actually. I've been getting birthday wishes here tho b'cuz of that so I fixed it now, lol. Ah, ofc you did xD"},{"date":"2023-02-28T23:25:08.077824Z","msg":"No wayyy, yours is freakin' awesome, too :D\nWhat do you think of the colour scheme, though? Too dark? A hint of pink or red might be nice to offset it but idk where to put it v(0-0)v"},{"date":"2023-02-28T23:17:15.708453Z","msg":"Thanks! :D\nYup, but because of the way I designed it (all navbar logic is in CSS as opposed to JS [trying to get better there, lol]), I... Screwed up xP\nSo fixing it means a lot of other issues arise xPP"},{"date":"2023-02-28T21:27:35.066456Z","msg":"I just sent \"mr i desperately need a watch or 15 but _ohhh no_ i'm too busy taking 5 ap classes to look at it\" sKI a screenshot of this convo ;p"},{"date":"2023-02-28T21:16:12.555836Z","msg":"With pleasure ;)"},{"date":"2023-02-28T20:55:31.873391Z","msg":"Thanks! :D\nAh. Welp. I'll do that next time :p\nSorry 'bout bugging the CoC judges during the first round, btw, lol."},{"date":"2023-02-28T20:51:00.005457Z","msg":"Thanks :D\nHuh, yeah. They're fixed for me, now, tho =)"},{"date":"2023-02-28T20:48:18.033211Z","msg":"Tyyy :DDD\n\nI want the new one to be voted to the top, lol. I'll go fix that xP\nYeah, `type=\"module\"` enables es6, but using it on the page script ensures nothing works at all, for some reason o.O\nIdk why; ik the code's right... Liftoff said the same thing on the team ninjaz homepage :P\n\nYup."},{"date":"2023-02-28T20:44:58.648306Z","msg":"Lol, go vote the original, I'm gonna delete this ;p\nEmail me when you're bored :D"},{"date":"2023-02-28T18:53:25.473901Z","msg":"Heya everyone!\n3 things...\nRELEASE: 28/2/2023\n\n- Updated my subpage. Like an insane lot o.O... Please dish out feedback (yes, ski lookin' forward to this barrage! >:p)\n- Collab with SP for round 3... \nhttps://www.khanacademy.org/cs/i/5173572157095936\n- Please resub in & vote up the new sub-thread I've made; you'll find it in the recents :P\n(The new comment loading format is not particularly friendly with sub-threads xD)"},{"date":"2023-02-28T12:09:57.391594Z","msg":"Thanks! :D"},{"date":"2023-02-27T23:18:06.347015Z","msg":"_Yes._ Chocolate is fantabulous and has surpassed the mortal sensations of temperature acuity  :o. Therefore, you _must_ have hot cocoa. 'Tis necessary :ooo\nYw! You're _you, ofc_ you will! :D\nAh, oki. (You're _sure_ you're name's not Tyler, Wyatt, or Warren? xD)\n\nWelp.\nYou did.\nAnd it was funny. \n:p\n\nYay c:\n(For once I'm more than annoying, =O)\n\n:D\nYou can always try...\nEven if it's half as good, tho, it'll still be tremendously entertaining, _lol_\n(think of this as relaxing after you finish whatever you need to do for the CoC program lol :p)"},{"date":"2023-02-27T23:11:36.49016Z","msg":"_Oh._ Oops!\nBut you're the cap'n so noice job, still! :D"},{"date":"2023-02-27T23:10:52.298137Z","msg":"Friendly reminder to release the WCC scores ;)"},{"date":"2023-02-27T23:09:43.746092Z","msg":"In response to that message (please delete, btw =)) -\nI'll give Ace a reminder. I was once again unable to judge this round, but I'll make sure everything gets to where it needs to be :)"},{"date":"2023-02-27T22:39:13.42218Z","msg":"Aw, man. Get some cocoa and relax. You probs won't do better stressed, eh? :D\nOooh, good luck with your exams! I have no doubt you'll ace them (but no pressure. I mean, even if one were to fail, what's the worst that could happen? Life'll move on, so it'll all be fine; it has to :P)\nMay I see?\n\nLol, remember the \"confidence lessons\" from flash? xD\n\nI shall-eth be-eth here-eth to give-eth thou-eth company for a few hours. -Eth. Finished all my work early so got some time to burn. It's lunch now anyways so... :p\n\nOh, finished the design for my subpage! Now all I need to do is add the content :D\nAnd then after that I shall brace for the new scathingly hilarious criticism from ya I'm looking forward to :DDD"},{"date":"2023-02-27T12:29:47.893667Z","msg":"This should be fine, ig. On line 126, though, it's annoying me a bit, can you change `this.h - 1.5` to `this.h - 2.5`? I forgot it has to be 1/2 the radius, not strokeWeight xP\n\nAlso, take away the stroke for the arrow."},{"date":"2023-02-26T23:39:31.121696Z","msg":"Nah, nah, nahhh... _Everybody_ loves me and my fantabulous personality, Rocket! And you know you do too! >=D\n\nYeah you are :p\n=)\nOoh, cool! :D\nLol, ikr, it's just _delightful_. Smh... xD"},{"date":"2023-02-26T22:13:53.677281Z","msg":"**smirks** well I _am_ \"everybody's favorite people\" >;DDD\n=P\n\nAw. Well, you're perfect, ya know! :D \nIt does make sense :)"},{"date":"2023-02-26T20:16:01.550132Z","msg":"Game great, then :D\nI have literally  no idea how to make games lol"},{"date":"2023-02-25T18:36:33.085559Z","msg":"Well yeah, that's probs true, but being arrogant is so fun! :D\n:p\n\nHow's life?"},{"date":"2023-02-24T01:39:07.357851Z","msg":"Heya... I don't have the time to judge this round either, sorry; go ahead without me (again) xP"},{"date":"2023-02-23T02:18:49.690878Z","msg":":D\nOi, oi, oiiiii, that's rather the point, tho! >:D\nThat's classified xD xD"},{"date":"2023-02-21T17:15:04.029309Z","msg":"hmm, so I haven't become a banana o.O"},{"date":"2023-02-21T17:14:42.387886Z","msg":"test 3"},{"date":"2023-02-21T17:13:34.021799Z","msg":"test 2"},{"date":"2023-02-21T04:54:48.765334Z","msg":"Thank youuuu :DDDD\nRather elated, lol :D\nIdk, maybe? It's international so ik you have it in the US, too, but we do it differently here and I'm not gonna name it b'cuz _someone_ is stalking my Discussions to find out what country I'm in and that'd be a dead giveaway, lol."},{"date":"2023-02-21T03:47:39.652215Z","msg":":D\n\nYup.\nI placed 1/18,000.\nOverall, the team placed 2nd. \nWe're goin' to States/Territories, then Nationals :)"},{"date":"2023-02-20T23:37:17.139815Z","msg":"It's (more or less) the square root of negative one."},{"date":"2023-02-20T23:19:58.016062Z","msg":"i: imaginary number; base of the complex number system. i^2 = -1.\ne: Euler's number"},{"date":"2023-02-20T23:12:46.778629Z","msg":"Precisely my point :D"},{"date":"2023-02-20T21:48:28.581752Z","msg":"Huh, all the comments were h1dd3n =/\n\n@StuffStash -\nNo way you're significantly over 13 and don't know/haven't learned about i and e... o.O"},{"date":"2023-02-20T15:15:44.650378Z","msg":"They're not even variables o.O\nI'm gonna guess you're 13 and 7 months old d:"},{"date":"2023-02-20T13:41:46.820465Z","msg":"Lol, why is i = to 0 in yours and why is e = 1? xD\nAnd the sine of 80 is very different from the sine of 80 degrees, lol."},{"date":"2023-02-20T13:31:18.635477Z","msg":"Added you to Caela :)"},{"date":"2023-02-19T23:25:54.012635Z","msg":"_ski once said \"have a virtual cookie\"?!_ \nWhy does this blow my mind so much? xDDDD\nYes, I am randomly here now b'cuz...\nJust b'cuz :)\n\nAlso, ski, yeah, you're definitely a \"weird little dude\"\nMaybe not \"little\", but you're definitely \"weird\", dude.\n...And a \"crazy nerd\" xD"},{"date":"2023-02-18T22:35:12.685124Z","msg":":D\nNah... Way too busy and I suck at collabs anyways :)"},{"date":"2023-02-18T22:31:37.102825Z","msg":"Aw, 'tis still sad =("},{"date":"2023-02-18T21:36:38.919284Z","msg":"I do, lol. Not my favourite artist, but he's definitely amazing and I'm excited for the new album :D\nYeah :p\nOh and yk that competition I was talkin' about a long, long while back?\n...\nIt went well =D"},{"date":"2023-02-18T21:33:55.388008Z","msg":"Thanks! :D"},{"date":"2023-02-18T21:33:17.671448Z","msg":"Why 'tis?"},{"date":"2023-02-18T21:29:34.367134Z","msg":"Aw, 'tis sad =("},{"date":"2023-02-17T18:04:36.007517Z","msg":"Huh? I do :D"},{"date":"2023-02-17T01:27:09.863409Z","msg":"Welp. Thanks again =)"},{"date":"2023-02-17T01:26:22.164468Z","msg":"'Tis :DDD\n\nSuper hyped lol"},{"date":"2023-02-15T23:27:08.034621Z","msg":"Nah, I'll just call you Cardstock >:)\n\nWhatever you say... =P"},{"date":"2023-02-15T23:18:12.072353Z","msg":"Tbh, no, not at all, lol. I knew you as Ace Rogers, not a random character from LotR >=(\n\nI _highly_ doubt it :)"},{"date":"2023-02-15T22:37:44.240895Z","msg":"Wow, okay then...\n\nUh, because I'm not entirely an idiot ;P"},{"date":"2023-02-15T21:40:46.607883Z","msg":"Ace Rogers, why are you doing this?"},{"date":"2023-02-15T10:37:24.057695Z","msg":"B'cuz it's not right to dump so much stuff on you =/\nYeah, lol.\nAw, thanks :))"},{"date":"2023-02-15T01:27:46.182917Z","msg":"(I'm sorry.\nIdk who to talk to.\nYou're awesome <3)\nLife? Insane. Absolutely insane. Stressed to the max, but I can't show it. Crazy number of stuff going on. Suddenly feel super alone; really miss some people I used to know. But I've always been an independent person, so gotta grind my way out. Gonna have to travel again for three months, gonna have guests, schoolwork is utterly psychotic, and I am taking the optional credit exam and college-level sciences for a future chance at a scholarship via a huge national, heck, _international_ competition. Yet I feel like a moron; ik I can do better, but also, life is meant to be lived and getting a PhD like my 16 yo cousin is not what I plan to do. Look around irl and I still feel _somewhat_ smart; take a look on KA, and there's my fellow friend taking 5 college classes at 15-16. Oh, and music concerts in between all that. I suppose CoC, too, but that's not particularly the highest priority. Finished my part for round 2 ages ago, but my collab partner is not done with his part. \nEssentially, gonna break, generally dead, but... It's not the worst it could be, I suppose :)"},{"date":"2023-02-15T00:48:29.618574Z","msg":"Hopefully...\n\n#heh\n\nTo you, too! =)"},{"date":"2023-02-15T00:34:14.863215Z","msg":"Wow, man. A fantabulous gift like that and you lose it, lol >=(\n\n#LeaningToward'More'"},{"date":"2023-02-13T22:52:47.827751Z","msg":"Whoa, I have no idea why he did that. I didn't judge last round because I was extremely busy. I'd honestly meant for you to look in the comment thread, lol, sorry! But presumably, it means they haven't judged :)"},{"date":"2023-02-13T10:41:35.110089Z","msg":"You should be able to find it here :)\nhttps://www.khanacademy.org/cs/i/4889478778372096\nSorry, it's not an SQL sheet, but I don't have the time to make one, lol."},{"date":"2023-02-13T03:15:10.819251Z","msg":"In that case, number one could just be blatantly giving them the pin so they start off with a bit of a sample taste for the game :p\n\nAlr :)\n\n:D"},{"date":"2023-02-12T21:26:42.885912Z","msg":"Ah, cool :D\n\nOne for CoC or just in general? =P"},{"date":"2023-02-12T19:08:51.297659Z","msg":":D\nOne-word graphics? A _collection?_\nName them \n\"Italicsssss\" \n\"Maplesyrupppp\"\n\"Pancakeeeee\"\n>=P\n(jk)"},{"date":"2023-02-12T19:06:22.782671Z","msg":"Ah, oki lol"},{"date":"2023-02-12T16:14:06.961881Z","msg":"1. Coloured dots? That sounds a 'lil lame, ngl lol.\nHow about a message written in low-opacity letters on the wall as \"invisible\" ink for the 2nd easy challenge? The first might just be unlocking the door with a key or smthn lol. One of them could be there's a piece of paper laying around and when the robber gets close, a message opens up with 4 riddles on it: \n\n\"Answer these, and the number each term holds\nwill show you the pin as your escape unfolds.\n\nWhat can run but can't walk? \n[river > 5]\nWhat has a neck but no head? \n[shirt > 5]\nWhat goes up but never comes down? \n[age > 3]\nWhat flies without wings?\n[time > 4]\n\n[pin: 5534]\"\n\nOr smthn like that :D\n\nAnother level could just be like the classic platformer, escaping the guards' shooting. Another could be an easy anagram: teh rnasew si en-ohuotasnd, horufnu-dder, xi-sytereht. \n(The answer is 1463 :p)\n\nAnother could be the Fibonacci pattern: \nThe first 4 positive numbers from this formula commonly found in nature: \nF(1) = 1\nF(n) = F(n - 1) + F(n - 2)\n...I think that's the right formula, lol... o.o\n\nIdk.\nMaybe?\nIdk how hard all of this will be to implement, so maybe not...\n\n2. Idrk, maybe vertexes instead of lines and then mask the block shapes inside that? As to positioning, I presume you can't change the `x, y` part of the image? Not a clue, lol.\n\n3. It's underground? Oki then. The bricks are now light blue. They'll go well with the dark blue brick background for the parallax feel :P\n\n4. Done with that, I think. Do the transitions suck? Tried to make 'em like police lights XP\nAlso made the dead scene ;p"},{"date":"2023-02-11T19:00:17.557576Z","msg":"Oki"},{"date":"2023-02-11T04:26:21.061866Z","msg":"Could you make something like `textLeading` in ski.js? =P\nNot now, maybe later, but that'd be nice to have. \nAtm, it's a fair bit too small; the... Smush-iness... Looked a 'lil odd on both _brave_ and the current _Antihero_. Or is there already a way my dumb butt doesn't know of...? Can we use `line-height` from CSS somehow?\n\nAlso, did you do a bit of a clean-up with your projects? :p"},{"date":"2023-02-11T01:01:38.085484Z","msg":"When the dude stands next to them, they get bigger and then you enter the key code you find using clues in the room and type/punch in the combination and they open? Or maybe nothing at all that fancy and they just take a key nearby and plug it in and the jail door opens :p\nSure!\n(I'll edit this back again, but could you send me a reference on GH b'cuz idrk what you mean by block graphics; like any particular textures [like the bricks I made earlier?] or...?)\nOki =)\nYeah, I'll add a transition ofc and maybe a sine rectangle background (like the thing on the team ninjaz logo part of that project [and I'll edit this thing out too lol])? I'd steal your particles but that's also...  Stealing... Your particles... Lol. \nI've also gotta fix the menu button's position, now that looks awful, lol.\n\nGreat =D\n\nPerfect! :D"},{"date":"2023-02-10T23:18:13.452059Z","msg":"Oki lol\n\nAhhh, tysm! :D\n\n:D\n\nWow lol\n\nHow are the icons' sizing?\n\nDone :)\n\nFinished the _how_ and _leaderboard_ scenes; can you do the switch scene w/buttons part? Sorry XP"},{"date":"2023-02-10T22:44:19.037061Z","msg":"Aw, thanks, that's very kind of you :)))"},{"date":"2023-02-10T02:03:28.627803Z","msg":"Oof lol\nRip plant\nI can't raise a plant to save my life XP"},{"date":"2023-02-09T23:25:58.303566Z","msg":"Is that you on your Duolingo profile pic with a plant atop your head? :p"},{"date":"2023-02-09T22:30:42.327128Z","msg":":P\n\n>:)\n\nAlright\nGo to Discussions :))\n\nYou're welcome >:D XD"},{"date":"2023-02-09T22:15:55.158878Z","msg":"oUcH soRry\nlol\n\n:)\nsubbed to the thread B)\n\nYayyy!\nAdded :D\n\nThat's good :D\nYou're welcome? lol XD"},{"date":"2023-02-09T21:57:21.676743Z","msg":"Checkin' in so I don't forget :p"},{"date":"2023-02-09T21:53:21.498991Z","msg":"I think I forgot to respond lol\n\nI see you've joined the thread now :D\n\n=)\nYou should def get it! Send me your username if you ever do :)\nhttps://www.khanacademy.org/cs/i/6740122397884416\n\nOof XP\nLol, congrats? Yay! XD"},{"date":"2023-02-09T21:47:14.860944Z","msg":"Heya... I'm sorry, idk if I've the time to judge this round, especially not by tomorrow. Apologies, but it may be better if you go on for this challenge without me, please; hope you don't mind :)"},{"date":"2023-02-09T21:40:16.048993Z","msg":"? here's a [fake] lollipop; now it's not so cruel [or true] anymore :D"},{"date":"2023-02-09T21:40:16.048993Z","msg":"? here's a [fake] lollipop; now it's not so cruel [or true] anymore :D","edited":true},{"date":"2023-02-09T21:40:16.048993Z","msg":"? here's a [fake] lollipop; now it's not so cruel [or true] anymore :D","edited":true},{"date":"2023-02-09T01:51:16.601323Z","msg":"Tied with tigers :D\n(...And possibly your 'lil kitty named Ninja who idk, but still lol)"},{"date":"2023-02-08T22:28:28.452495Z","msg":"_Lol_\nSent... I like jaguars, don't you? :D"},{"date":"2023-02-08T21:59:02.910607Z","msg":"Coolio\nThat's the instrument brand's logo, not my school's crest xD\nUh, sure, wanna see a half-decent drawing of mine? =p"},{"date":"2023-02-08T21:45:28.116571Z","msg":"=P\nLol, does your school have a gong or are you talking about your hypothetical pro gong player gong?\nIt sucks xD\nI like photography and that's bothering me _so_ much"},{"date":"2023-02-08T21:37:44.304416Z","msg":"Oki lol\n\nSent xD\nRadius? Around 60 cm; like 20 inches. Diameter's over a metre (like 4 ft). With the metal frame, the height'll be a 'lil taller than me (I'm 5'4)\nApologies for the horrific angle; I was in a rush 'cuz the bell was about to ring lol"},{"date":"2023-02-08T10:56:36.101226Z","msg":"Aw, you should pick it up again :D\nAlthough, it might be easier to start with something a 'lil more simple... Like Spanish, perhaps...? German is also quite simple, at the basics at least. And then you get stuff like Eichh?rnschen (meaning squirrel), like what the heck, how do you pronounce that?! \n(Those languages will be easy if you normally speak English, that is, I suppose =p)\nWell yeah, ig it kinda is, lol\nBut I've got no life and a lotta time to spare :p"},{"date":"2023-02-08T10:56:36.101226Z","msg":"Aw, you should pick it up again :D\nAlthough, it might be easier to start with something a 'lil more simple... Like Spanish, perhaps...? German is also quite simple, at the basics at least. And then you get stuff like Eichh?rnschen (meaning squirrel), like what the heck, how do you pronounce that?! \n(Those languages will be easy if you normally speak English, that is, I suppose =p)\nWell yeah, ig it kinda is, lol\nBut I've got no life and a lotta time to spare :p","edited":true},{"date":"2023-02-08T10:56:36.101226Z","msg":"Aw, you should pick it up again :D\nAlthough, it might be easier to start with something a 'lil more simple... Like Spanish, perhaps...? German is also quite simple, at the basics at least. And then you get stuff like Eichh?rnschen (meaning squirrel), like what the heck, how do you pronounce that?! \n(Those languages will be easy if you normally speak English, that is, I suppose =p)\nWell yeah, ig it kinda is, lol\nBut I've got no life and a lotta time to spare :p","edited":true},{"date":"2023-02-08T10:51:29.22912Z","msg":"yEs :P"},{"date":"2023-02-08T02:36:23.462361Z","msg":"Aw, oki then. Bonne nuit!"},{"date":"2023-02-08T02:11:01.91407Z","msg":"Wait, my explanation comment was hidden for some reason o.O\nIt's in the code comments now, at the top."},{"date":"2023-02-08T02:09:59.85809Z","msg":"Yupppppppp (sureeeeeeee)\n\n**_laughter_ XD XD\nI love particle physics :P\nBut yup, teChNiCalLy, yeah. (oof rip lol)\n(It's not :p)\n\nOfc >;)\n\nUh-huhhhhhhhhhhhhhh...\n\nAh, welp"},{"date":"2023-02-08T02:03:35.391616Z","msg":"That'd solve a lot of problems tbh, lol"},{"date":"2023-02-08T02:00:15.104951Z","msg":"XD\n\n_SMH_ XD\n\nOhhh that'll be _epic_, def lemme know when you do lol\n\n=P\n\n#Ain'tThatLifeInANutshellLol"},{"date":"2023-02-07T22:51:38.691782Z","msg":"_help mr genius savage ninja, i beg u_\nhttps://www.khanacademy.org/cs/i/6740122397884416\nIf ya look at the thread w/Astro, that'll give more context than explaining everything all over again lol."},{"date":"2023-02-07T22:47:20.459704Z","msg":"So ya see how all the way at the bottom, I made this function?\nIt ofc works like a classic for loop in PJS for repeated circles or whatever. But now I want the circles to append to different pages. Obviously, the child will just move if you call it again in a different div, but I want it to appear on both pages, without cloning to maintain the versatility =P\nAnd I can't and Google is useless b'cuz anything similar involves cloning which isn't what I want, smh. I'll probs just release it and work on it later, else I'll never end up finishing lol.\n```\n        const circs = (/* page,*/ size, clx, cly, x, y, strk, fil, wl, wh, space/*, what */) => {\n            for (let i = 0; i < wl; i += size * space) {\n                for (let j = 0; j < wh; j += size * space) {\n                    let circle = document.createElementNS(\"http://www.w3.org/2000/svg\", \"circle\");\n        \n                    circle.setAttribute(\"cx\", clx + i);\n                    circle.setAttribute(\"cy\", cly + j);\n                    circle.setAttribute(\"r\", size);\n                    circle.setAttribute(\"stroke\", strk);\n                    circle.setAttribute(\"fill\", fil);\n                    \n                    svg.setAttribute(\"viewBox\", \"0 0 600 500\");\n                    svg.style.position = \"absolute\";\n                    svg.style.top = x;\n                    svg.style.left = y;\n                    svg.appendChild(circle);\n                }\n            }\n            \n            //page.appendChild(svg); \n            //what;\n            document.getElementById(\"homepage\").appendChild(svg)\n        };\n```\n\n(I'm gonna drag ski here too and see what he comes up with lol)"},{"date":"2023-02-07T22:39:17.855173Z","msg":"Yay! :D\nBetter or worse than expectations?\n\nOki, I'll fix 'em :))\nTried lerp but it's not working for some reason...\n\nGreat! :D\n\nNow the third one has _got_ to be you, lol.\n\n70-80% seems a bit overbearing, how's this?\nMade 'em text for a better judgement.\n\n...Is it bad if my answer was 'yes'? XD\nHow do you import the google fonts icons into this? _Can_ you?"},{"date":"2023-02-07T21:56:39.950185Z","msg":"Nice progress! :D\n\nSo I tried to make a filter to make the trees better and it went awful, but I think now the homepage looks half-decent, what do you say? Personally lovin' the title font =D\n\nThe buttons are s'posed to flash like the cop siren lights, what do you think? \n\nI've added the bricks as a function and image and the others should be added very soon.\n\nI wonder who the mysterious voter is o.O\nIf it's not you, ofc."},{"date":"2023-02-07T21:01:55.720579Z","msg":"I've been around a 'lil so I'm generally pretty good with languages :P\nWatching stuff w/Russian subtitles helps with figuring out what means what. And there are tutorials online. But mostly, it's just making phonetic connections to other languages and then putting it together after learning the basic alphabet. And then a bit of practising and you're good to go =P"},{"date":"2023-02-07T18:38:58.929396Z","msg":"Yup, that'd look cool :P\nYeah, I got bored of Latin-based languages so I decided to learn some other random script lol\nI can read all of it and understand most of it =)"},{"date":"2023-02-07T13:51:12.125656Z","msg":"Great\n\nYeah, I'm not done, lol. It's 'cuz of the posterize. Fixed now :)"},{"date":"2023-02-07T13:46:25.23685Z","msg":"@Limelight -\nI find it stupid how KA has multiple GQL endpoints when the _purpose_ of GQL is to have _one_ endpoint with a bunch of queries, smh. But they _are_ working to convert it to just one, so that's good, ig. Anyways, though, after they finish transferring, _none_ of the endpoints will be accessible from the KA CS projects (legally, at least) b'cuz CORS doesn't allow it. (Basically, no, not really. No usable endpoints.)"},{"date":"2023-02-07T12:37:42.358586Z","msg":"Oh, so we're gonna add the arms separate from the character function images? So the main characters are images but their limbs move using oop (if they have to pick up guns and do stuff)...?\n\nSo `image (graphics.[char], x, y, [width], [height])` but that only has the body + head, and then limbs that move using `lerp` and `sin` or whatever...?\n\nIdk if this makes sense, sorry XP"},{"date":"2023-02-07T10:03:10.372311Z","msg":"Yup lol\nAlthough a spaceship sounds like a random thing that could also fit there considering the whole thing is generally a very random graphic :p\n\nIt does look cool =P\noh _lol_ no\nI learned how to read Cyrillic though when I was younger (for no reason, really, lol; now fluent whilst reading, though :D), so I was curious\n\nIt is c:"},{"date":"2023-02-07T03:56:19.491449Z","msg":"Yep =P\n\nNow, pancake, do you know how to make the loopy circle SVG function show up on different page divs (without affecting the previous children)? _Aurghhhhhh!_ If only that piece works the rest'll come easy XP"},{"date":"2023-02-07T03:51:23.862306Z","msg":"So a separate image object for the arms that we then rotate using trig whilst moving?"},{"date":"2023-02-07T02:02:55.935462Z","msg":"Oki, great :))\n\nEdit: Wait, where's the reference? Lol"},{"date":"2023-02-06T23:57:42.676105Z","msg":"Thanks :)\n\nSo you want a separate graphic for just the arms?\nAlso, shall they float along or do we need legs?"},{"date":"2023-02-06T22:36:33.341999Z","msg":"Oki (x2)\nOh, so you're thinking a weapon game where the guy shoots the gun and breaks out of the prison. I was thinking smthn more logic-heavy. Welp, they both sound good, although the shooting thing's a classic, so we might get more points for creativity.\n\nHuh, if we're using guns but making them full-rigged, I suppose we're gonna need to animate individual joints.\nAnd if we make them fully-rigged instead of the classic floaty-arms, we'll need to use OOP instead of literally translating images, right?\n\nOki."},{"date":"2023-02-06T22:15:45.15267Z","msg":"Great :D\nAgreed.\nWhich weapons? No guns, I presume, b'cuz _KA._ \nControl panels, oki, any particular size? I suppose we can always scale, but yeah. Any keys? To pick the first lock and escape? That can be the easy ones, the first level or so, and the doors get harder as they go. Harder ones like an escape room, with having to guess the right passcodes. Sorta like a mix between a platformer-ish-thing and a logic game, ig. Maybe?\n\nBlocks? Like bricks? For a wall or smthn?"},{"date":"2023-02-06T21:32:47.164993Z","msg":"Yay, thanks! :D\n\nOki, I'll make 'em better :D\n\n---\n\nSo, what _else_ is there to do? The homepage is mostly done, the only thing left is to change the content of the buttons, add the titles/some text, and shading, which won't take long at all. Now it's probably time for the main gameplay. _The Chase_ and _Breakout,_ right? So the robber's escaping jail. How should we go about that? :P\nThe logic's all yours, ofc. So any particular graphics you need? =P"},{"date":"2023-02-06T01:54:31.972349Z","msg":"Thanks :D\n\nOh\nOki\n\nGuilty as charged XD\nI'll stop though, that was weird even for me to read, lol \nThe nickname \"mr genius\" is specifically saved for my cousin :p\n(Or my brother if he's being really annoying, used sarcastically)\nYou're mr savage ninja >:D\n...Aka Elsa aka mr pro gong player aka my friend :))"},{"date":"2023-02-06T01:27:50.608904Z","msg":"Eep...\nApologies, but could you make a spinoff with the fixes? XP\nIdk what you mean by \"the argument 0\" (`rectMode(0)`?) or which collision function (my one that's commented out or yours at the start of the program) or even why the draw worked b'cuz the `menuScene` had no content; it was all commented out, but the code worked, ish. The characters didn't show up, though.\n\nHow's the stuff looking, btw?"},{"date":"2023-02-05T18:51:47.706085Z","msg":"Great =)"},{"date":"2023-02-05T18:45:32.295157Z","msg":"Oof XP\nI got a 6.6 from JLE v(0-0)v\nAnd then I asked why kinda annoyingly and subsequently got told off by Liam (which I needed tho, ngl) XD\nSo wonderful S. M. V. has gotten on the bad side of the judges lol\n\nI'm currently revamping my subpage too; been meaning to do so for a while :P\n\nAnd I'm quite happy I figured out how to loop SVGs c:\nAnd I've made that into callable functions =P\nAlthough the pages they're supposed to show up on aren't working, all of it is appending on the last-called page, so now I've gotta beg Mr Italics and pro gong player and bread for help lol\nAnd the es6 page switch that was working 3 hours ago decided not to work and idk why, smh. But es5 is working, so... v(0-0)v\n\nHow's life?"},{"date":"2023-02-05T18:23:27.496594Z","msg":"Go to the discussions tab :)"},{"date":"2023-02-05T14:41:29.712521Z","msg":"Log:\n- Got characters/station done\n- Progress on homepage\n- OOP for characters, _ish_ > done on another wip program\n- Ideas :))\n\nIssues:\n- Buttons > not responding on hover\n- Image caching per characters > coming w/background\n- No `randomSeed` > things go crazy w/`draw`"},{"date":"2023-02-05T13:21:58.509426Z","msg":"Heya, we've created a new thread on GitHub (appears as though Samwise, HS, and TML still get notifs); could you join that? \nThanks :D"},{"date":"2023-02-05T13:09:38.362946Z","msg":"Yeah =P\n\nOki! :D"},{"date":"2023-02-05T05:04:16.974341Z","msg":"@Pineapple -\nOh lol\nBoring physics is boring >=P\nYou should do particle physics\n'Tis the most fun :D\n(oki)\n\n:p\n_derp_"},{"date":"2023-02-05T05:02:12.477619Z","msg":"=)\n\nRemember the one where the notifs/comments were disappearing? That was around 3 months ago :p\nOki =P"},{"date":"2023-02-05T03:46:26.49429Z","msg":"Oh coolio :D\n\nOH NO PLEASE get rid of the comments and graphic for my sake PLEASE let's not talk about this _awful_ program _ever_ again XD\n\nAnd ig it'd be weird responding to a comment from 3 months ago, but KA bugs, smh.\n_The devs_ >=/\nAnyways, I do hope things have gotten better since then lol :)"},{"date":"2023-02-04T21:39:44.266682Z","msg":"Can you help me with the buttons? Why aren't they changing colour as the mouse hovers above them?\nSorry XP\n(ooo but they are classes :D)\n\nHere:\nhttps://www.khanacademy.org/cs/i/6051327054757888\n\n(btw, I have finished the characters, now I'm making a car and everything else better + easily usable\n\nAlthough can we make the characters, like, not have legs XD\nThey look _really_ weird with them :P\nFits the style better w/out\nAnd hovering arms\nI originally did the sine walking thingy but it looked _weird_\n\nAnd I suppose we can't include guns because _ThINK Of thE chILdrEN_ :o\nDid you know those were called Studly caps? I just got bored and decided to make a horrible program that makes it like that a couple days ago :P)\n\n----\n\n_Edit:_\nStill can't get that to work, but now why are the loaded images in the graphic object not having a cleared background? And even when it's an image, the random is going crazy (saving it separately didn't make it go insane). \nI'm sorry, this must make 0 sense XP\nBut it's in the link above =P"},{"date":"2023-02-04T18:57:56.98323Z","msg":"@pexy -\nWith a nickname of \"pexy\", how could anybody call you boring? XD\n\nWow, that's awesome! \nI wonder what mine is :P\n\n@Pineapple -\nAwwww that's so boring thoooo\nWhat're ya doing; dimensional force formula or smthn?\nIt is :D\nMmm-hmm :P\n=)"},{"date":"2023-02-04T17:15:17.74982Z","msg":"@Pineapple -\nI read a lot, lol. We never learn particle physics in school, unfortunately =(\nWhat are you guys learning in your physics? (pls don't be forces, smh, that's so boringgg)\n\n=)\nOhh, that depends on what you wanna see. Like... City or nature, for example. Def take a visit to Cornwall, it's gorgeous! Idk how to surf, but the beaches are epic! Also, Seven Sisters park in Sussex is stunning! :D\nFor cities, Oxford is really pretty (and take a visit to London, too, ofc) and if ya go to Ireland, I love Dublin (really, the flight itself to Ireland is stunning [although we'd a private flight so the pilot was very lax and took a detour to show some really beautiful sights]).\n\nMy grammar was incorrect, apologies :)\nTechnically, stuff is uncountable, though, as the plural for stuff is not 'stuffs' but still 'stuff' :P\n\nYup!\nOh, that's a good idea.\n\"I'm very sorry, I'm afraid I'm not going... But thank you for the offer :)\" \n\nNah >=P\n\n:p\n_derp_"},{"date":"2023-02-04T16:58:22.650495Z","msg":"Ah, welp =P"},{"date":"2023-02-04T16:36:04.749603Z","msg":"Figured from the lack of response ;p\nJust respond to the \"wonderful\"-ness once you are, tho :)\n\nIdk if you're gonna enjoy explaining this to my moronic brain, mr genius XD\n```\n            //modifications to the global collision object\n            col.pr = (p, r, m = 1) => p.x > (m ? (r.x - r.width / 2) : r.x) && p.x < (m ? (r.x + r.width / 2) : r.x + r.width) && p.y > (m ? (r.y - r.height / 2) : r.y) && p.y < (m ? (r.y + r.height / 2) : r.y + r.height)\n            col.pc = (p, c) => dist(p.x, p.y, c.x, c.y) <= c.size / 2\n```"},{"date":"2023-02-04T16:33:22.629672Z","msg":":D\nHe did and it got 7.7 (which seems way underrated except for the fact it's not _done_, smh)"},{"date":"2023-02-04T16:16:13.938994Z","msg":"so like can i have permission to steal your code for our collab XD"},{"date":"2023-02-04T16:11:32.697146Z","msg":"Yay! Good on ya, cap! :D\nI'm sure you guys'll still do amazing =)"},{"date":"2023-02-04T15:39:01.581658Z","msg":"=D\nDid you accept the captaincy btw? :D"},{"date":"2023-02-04T14:10:51.524345Z","msg":"@Pineapple -\nYay! The Higgs-boson is one of the coolest things imo :D\n\n=P\nNo, I'm not in the UK; not anymore, at least, lol. I used to be a bit outside of London and then Ireland at one point (you should def go there if ya haven't :D) long agooo\nThey're supposedly more advanced XD\nI think it's a review atm. I'm taking the credit exam to get outta that class anyways because I already know all the content and I hate it =(\n\nAy, it's not like I ever study! All the stuff are boring and easy :D\nNope! It's a 63.4 g bridge that can hold 32.8 kg. And another one that's 28.7 iirc and can hold 20 kg :D\nTy!\nYupp :p\nAh, have fun!\nThe problem is I have no interest in dancing but also have no idea how to refuse when someone asks me, smh.\n\n@pexy -\nOh o.o\n\nOki XD\nNah, we missed you! I just thought you were sleeping or smthn b'cuz timezones :P\nIt does, lol\n\nHey, there's still ~100 days! :D\n(Meanwhile... Me with the exam in 13 days doing precisely 0 studying XD)"},{"date":"2023-02-04T13:31:58.789404Z","msg":"@pexy -\nDoes that imply you're annoyed by the spam or that you feel excluded? =P\n\n:p\n_derp_"},{"date":"2023-02-04T04:56:29.273404Z","msg":"I'm sure it did -.- XD XD\n...\n_Boys,_ smh.\n_...\n...Definitely_ not like I've rickrolled the entire bus... Most _certainly_ not XP\n\nYeah, man... Totally unexpected, ngl, lol XD\nHonestly, tho, yeah; kinda was XDDDD\n\n#rOckRoll\n-.-"},{"date":"2023-02-04T04:52:13.415136Z","msg":"Well, hi then, viewership! XD"},{"date":"2023-02-04T04:50:40.574906Z","msg":"Oh, wow. I love particle physics myself, although I don't suppose they teach that, eh... :P\nNice! :D\n\nWe don't _have_ letter grades :p\nAlthough if you have a 93 + average the entire school year, you're on the A honour roll.\nI'd say \"yes\" but that'd imply we're smart in the first place.\n...I'm... I'm ah, not in Australia... o.O\nWe're tested at a young age and they identify you as G/T (or both like moi :p) and give you different classes/make you go to a different school. Although what I have is still stupid easy and I will rant for ages on its idiocy b'cuz I took a diagnostic (questions change based on skill level) and got up to Calculus (mostly multivariable calc and inner products of vectors), but ykw we're doing in class? _Systems of equations._ I fell asleep during maths and almost missed the bell, lol.\n\nOof XD\nI think by \"life\" I just mean stuff to do lol\nI've a credit exam the 17th, a competition the 18th, a plethora of quizzes/minor exams (like 12), 2 more midterms left, an essay, orchestra chair placements, a school dance I've gotta figure out how to avoid going to, meeting up at my friend's house to possibly build another bridge for the competition, a friend's b-day party, maybe actually study (who knows? _Perhaps_), another person's b-day, and... I think that's it."},{"date":"2023-02-04T04:34:48.630086Z","msg":"Defffff (uh-huhhhhhhh)\n\n(oki, fine, _you're_ one to talk, mr \"get RECKEDDDDDD\" XD XD XD)\nOf course! Unless you're in a black hole. In which case there is absolutely no bright side, as you're quite literally in a pit of darkness :P (You are tho :D)\nAwwwwwwwww :c\nThank you! Although, what I think you meant to say was... \"May the odds be ever in your favour\" >;P\nYeassss\nYeassssssssssss\n=p\n\nI might have to go soon btw =(\nTtyl if I disappear! :D"},{"date":"2023-02-04T04:29:17.105916Z","msg":"Ain't that true XD\nEh, like, no comments or viewership on this at all :p"},{"date":"2023-02-04T04:28:06.863533Z","msg":"_Ahhhhhhhhhhhhhhhhhhhhhh_\n\nWOW, Rocket, my guy, just _wow_ LOL\nYes, just the _brightest_ end of a rainbow XD\n\nNah I never saw it lol\nIdrk how tho v(0-0)v \nXD\n_Wowwwwwww_"},{"date":"2023-02-04T04:25:18.830577Z","msg":"Ik lol\nStill a random comment tho :P"},{"date":"2023-02-04T04:09:51.109125Z","msg":"Most certainlyyyyyy\n\nXD\n(I mean screw healthy and mature lol)\nEh, that's true, but in the grand scheme of things, that's not particularly the _most_ awful consequence one could have, eh? (Yeah, you are :D)\nOoooooo which people\nI shall fight and retrieve the trophy\nYeas \nNeed \n:o"},{"date":"2023-02-04T04:06:05.549769Z","msg":"You, of all people.\n_You._\nYou rickrolled me.\n_How could you?!_ :ooooo\nLol"},{"date":"2023-02-04T04:03:11.28748Z","msg":"Well that was random lol\novErLy SAtuRaTED aLLEy WIth sHaDY deMOn FigUrES"},{"date":"2023-02-04T03:50:58.291796Z","msg":"Lol\n\nFor sureeeeeeee\n\nIkr?! It's definitely _insane_ :o XD\nAh, yes, that was good, yeah =P\n(And true.\nGotta keep lyin' to yourself 'bout that XD)\nAy, it's fine; what's the worst that could happen? :D\nI claim the title as the most annoying person on KA >:) ?"},{"date":"2023-02-04T03:50:58.291796Z","msg":"Lol\n\nFor sureeeeeeee\n\nIkr?! It's definitely _insane_ :o XD\nAh, yes, that was good, yeah =P\n(And true.\nGotta keep lyin' to yourself 'bout that XD)\nAy, it's fine; what's the worst that could happen? :D\nI claim the title as the most annoying person on KA >:) ?","edited":true},{"date":"2023-02-04T03:50:58.291796Z","msg":"Lol\n\nFor sureeeeeeee\n\nIkr?! It's definitely _insane_ :o XD\nAh, yes, that was good, yeah =P\n(And true.\nGotta keep lyin' to yourself 'bout that XD)\nAy, it's fine; what's the worst that could happen? :D\nI claim the title as the most annoying person on KA >:) ?","edited":true},{"date":"2023-02-04T03:47:37.829597Z","msg":"@Promise -\nHi!\nHow'd ya do on 'em? :D\nAw, welp. I feel ya m8 :/\n\nEh, I'm fine, thanks for asking =) \nFeb's a very busy month! Had a midterm, a maths exam, and an essay today. Chemistry test yesterday; class average was a 62% o.o \nI got a 97.1% so not bad; missed a single question and that's 'cuz I misclicked (...And didn't recheck my answers lol). Although, everyone < 80% fails b'cuz it's a \"gifted & talented\" school (beg to differ; we're all morons) so... Yeah. Many other stuff coming up this month, yay, I've a life for once =P"},{"date":"2023-02-04T03:18:39.232203Z","msg":"XD\n\nDefinitelyyyyyyyyyyy\n\n**scoffs** imagine _not_ having such a lack of a life that among your favourite forms of entertainment are changing bios **cough**\nI changed it just before I saw this comment and idk what it was before anymore, lol. Kinda messed up a bit earlier on KA by \"pestering\" the CoC judges (- courtesy of Liam, lol, but I was curious as to why I lost points. And then didn't receive an answer, even when ik the person saw the notif. Seems a 'lil fishy if one takes off points and doesn't [can't?] explain why... In retrospect, ig I should've fought more but ehhh I'd just get even more on their bad side. Deleted the comments =P) XD\n...But I am an annoying human being and idrc :p"},{"date":"2023-02-04T00:32:51.251573Z","msg":"Oh, this is quite random but are you Russian? B'cuz the x in your name's the Russian letter zhe iirc :P"},{"date":"2023-02-03T23:41:21.601274Z","msg":"Wow, almost a 6 from you :oooo\n\nThank you so much! :D\nOh, yeah, that'd be epic, the lighting idea! Maybe a crystalline bridge would look nice... Goin' for a fantasy/ethereal feel there, dunno 'bout a spaceship :P\n\nYes, definitely, XD"},{"date":"2023-02-03T23:17:49.253198Z","msg":"Ah, oki, tysm! :D\nCould you judge this lol\nhttps://www.khanacademy.org/cs/i/6358654328029184"},{"date":"2023-02-03T22:56:08.025426Z","msg":"Lol, thanks XD\nNow...\nHow can I make it better? More efficient? :D"},{"date":"2023-02-03T22:48:43.542532Z","msg":"Oki, welp, ig I'll make it standstill then :)\n\nProceed :p"},{"date":"2023-02-03T22:28:40.995737Z","msg":"Heyaaa, Pineapple, raisin-pexy-dot-echo =P\nHow are you guys? :D"},{"date":"2023-02-03T22:07:52.869719Z","msg":"ski, mate, did you even look at the program?\n\nHmm, how's this working, then?\nhttps://www.khanacademy.org/cs/i/5037767365279744"},{"date":"2023-02-03T21:48:05.85056Z","msg":"I've animated individual ellipses in the for loops to look like wind tho... No more animations?\nSo you're saying even if I put `randomSeed`, it'll still go... _*BRrrrRrR*_?"},{"date":"2023-02-03T21:00:54.125946Z","msg":"Heya again!\nI'd hate to overload you, but is there any way you could make `randomSeed();` in ski.js? Or am I a moron (like I usually am) and is there a way to stop this without that?\n\nThis is why; lines 147-149.\nAnd I'm sorry it looks absolutely awful. It should get better once I add in the characters and \"juice it up\" (ahem more like _steroid it up_ really) so to say =)\nhttps://www.khanacademy.org/cs/i/6051327054757888"},{"date":"2023-02-03T12:48:02.340651Z","msg":"I've got one so it doesn't take too long to judge 'em and find averages =P\n\nIf I don't get responses by the Friday after the Monday each challenge ends on, I just go with what I already have, btw :)"},{"date":"2023-02-03T02:12:36.164308Z","msg":"Huh, I wonder if it's another bug... v(0-0)v\n\nOof lol\nOh, cool, you play violin! :D"},{"date":"2023-02-02T23:52:41.189668Z","msg":"Yup, actually, lol\n(why are my notifs disappearing, idek...)\n:)\n\nHow's life? :D"},{"date":"2023-02-02T22:30:18.292901Z","msg":"So these filters are in ski.js now, right? :D \nJust typing `filter('blur', 3)` should work?"},{"date":"2023-02-02T21:23:20.809513Z","msg":"@mr savage ninja -\nMost certainly ;p"},{"date":"2023-02-02T21:22:55.507442Z","msg":"Oh.\nSorry, I never saw this :p\nBut ig it's a 'lil late to argue now =P"},{"date":"2023-02-02T18:33:07.994308Z","msg":"yES. DEfINItelY YeS."},{"date":"2023-02-02T18:32:40.523512Z","msg":"@Pineapple -\nHere: https://www.khanacademy.org/computer-programming/team-ninjaz-official-homepage/5403470941437952"},{"date":"2023-02-02T18:02:52.012461Z","msg":"@Pinecone -\nYep, only 8 months, lol. My account's 6 years old; I only knew of the KACP in June 2022 :P"},{"date":"2023-02-02T17:54:25.132384Z","msg":"@Pinecone -\nI've been here actively for about 8 months lol =P\nOh, cool! :D\n\n@Cardstock -\nAh, oki :p"},{"date":"2023-02-02T17:45:35.838148Z","msg":"Hi again!\nWow, can't imagine this green lol\nAnd I keep hearing people talking of backgrounds, but I've never even seen 'em lol"},{"date":"2023-02-02T17:22:25.731971Z","msg":"@Pinecone -\nIt was green?! :o\n\n@both -\nEh, multitasking ftw! I've gotta go in an hour-ish (got an appointment :p)... I'll just multitask for not ig XD"},{"date":"2023-02-02T17:15:45.610229Z","msg":"@Cardstock -\nNothing too crazy on here, but irl is extremely hectic, lol.\n\n@Pinecone -\nWow, nice! :D\n7 years, _dang_ O.O\n\n@Both -\nI gtg, bye!"},{"date":"2023-02-02T17:05:21.346699Z","msg":"Within two minutes after not talking for around a week, we're all here lol"},{"date":"2023-02-02T16:58:46.777025Z","msg":"Great, I'll add you :)"},{"date":"2023-02-02T16:16:07.989732Z","msg":"Yepppp\nI'll email ya lol"},{"date":"2023-02-02T16:15:48.089963Z","msg":"Thanks!"},{"date":"2023-02-01T23:05:05.328258Z","msg":":D\n\nOh, oki, thankfully, lol XD"},{"date":"2023-02-01T23:04:19.204521Z","msg":"Thanks for the quick response :))"},{"date":"2023-02-01T21:51:31.861144Z","msg":"Um.\nSo.\nFor, like, for, ah, definitely no reason whatsoever, what's your activity level, and if you were hypothetically asked into CoC, would you join/be actively available/not procrastinate?"},{"date":"2023-02-01T21:40:19.205723Z","msg":"Wait, nvm, it's showing up again v(0-0)v\nAh, welp.\nJust a temporary bug, ig! :)\nI'll edit out the info of your age just in case.\n(Edit: eh, whatever, deleted it instead)"},{"date":"2023-02-01T21:37:28.706542Z","msg":"Oki, thanks :))"},{"date":"2023-02-01T21:00:02.663201Z","msg":"Heya! It should be at the top of the Tips and Thanks ;)"},{"date":"2023-02-01T20:48:05.19486Z","msg":"Why thank you :D\n...\n_...Wait..._\nDoes this have to do with my accent again? XD\nI'll take it either way tho tbh lol ?"},{"date":"2023-02-01T20:48:05.19486Z","msg":"Why thank you :D\n...\n_...Wait..._\nDoes this have to do with my accent again? XD\nI'll take it either way tho tbh lol ?","edited":true},{"date":"2023-02-01T20:48:05.19486Z","msg":"Why thank you :D\n...\n_...Wait..._\nDoes this have to do with my accent again? XD\nI'll take it either way tho tbh lol ?","edited":true},{"date":"2023-02-01T20:45:31.980034Z","msg":"Thanks! :D"},{"date":"2023-02-01T16:08:54.284469Z","msg":"I saw; good luck fixing it =)\n\n\"wonderful\" is a term seldom used for my remarks XD\n...\n...I mean, unless you're my English teacher, I suppose. \n...But this next essay I'm writing starts off with _\"Humans are weird.\"_\n'Tis an essay on Shakespeare. \nSo _lol_ =P\n\n(yay, more \"wonderful comments\" for you to respond to!\nNow, please don't let me distract you! Only respond after you're done debugging :D)"},{"date":"2023-02-01T15:09:05.181197Z","msg":"You found it? :D\nI doubt I'm of any use there :P"},{"date":"2023-02-01T12:29:41.085464Z","msg":"Judging for that will start in 5 days :)"},{"date":"2023-02-01T10:32:20.803866Z","msg":"**applauding intensifies**\n\nXD\nMm-hmmmmmmmmmm\n\nI changed mine, like, 9 times in just one day on Sunday, lol\nYepp XD\n:)"},{"date":"2023-02-01T03:09:27.244708Z","msg":"Oh, dear. Take a nice, long nap after, eh, m8?\nOr, ya know, get a web dev. The balance will be skewed when HS gets kicked. 2 graphics, 2 game, 1 webpage. Balance :P\nA hybrid game-web dev is the best choice, but with a lack of such, _[js object for completion/failure of an async op and its value]_ is perfect for this: decent and has not been selected yet. She can even get in some graphics if need be, perhaps. Just my thoughts, ofc, as always, final decision is yours, cap! (Or if you're busy and need me to search again, I will; looks like we think a bit on the same page based on your responses to my previous suggestions :D)\n\nThis must be getting redundant, but yeah, sucks again =/\n\nI like wires ;)\n\nYup! :D"},{"date":"2023-02-01T02:10:15.731685Z","msg":"Oh, dang, sorry, then! Do you have any other Windows devices in your house?\n\nWell, actually, that's not necessarily true (heh, unscrew back cover + battery, unplug power cord [connecting battery to motherboard],  hold the power button for, like, 20 secs, reconnect all the parts, and then do esc + refresh + power), but yeah, definitely don't screw with that, lol, you'll get flagged in the system. Bad consequences :P\nWelp.\n\n...\n_Oki.\nNow._\nWe've two weeks for the next challenge. We should not do what you did this time and release it last-minute. I'm sure you saw the ideas on GH, waitin' on your response; when you send it, have any ideas for graphics I should make? (Send there, ofc =p [< I totally stole this emoticon from Astro. Heya, Astro or Sprout if you stalk this! :D])"},{"date":"2023-02-01T00:22:34.133994Z","msg":"Hmm, as long as you haven't sold it or smthn, maybe...?\nI wonder if there are any workarounds for changing permissions on a Chromebook (other than esc + refresh + power + ctrl d). Ig crosh is blocked and half the settings are greyed. It wouldn't show up on history, would it?"},{"date":"2023-01-31T23:42:14.909852Z","msg":"Aw, that sucks. \n(Neither can I though, not anymore, at least XD\nWas just hoping you could lol)\n\nCould you transfer all the files to the PC and go from there using the command line? Maybe over LAN or (preferably) USB hard drive?"},{"date":"2023-01-31T23:11:13.0517Z","msg":"Ah, I'm a queen now, I see, XD"},{"date":"2023-01-31T22:51:25.747066Z","msg":"Oh.\nWell...\nDo you have Linux on that Chromebook? \nIf you didn't already, running command might help you:\n```\n$ ls /[directory name]\n$ ls -a\n$ ls -lt\n```\n_Should_ help you see files by last modified, iirc.\n\nOr if it was backed up on a PC, dir command inside `cmd.exe`\n\n`C:\\> dir /o-d`\n\nshould also help you with that.\nI think.\nIdk.\nMaybe?"},{"date":"2023-01-31T22:18:36.438763Z","msg":"Baking powder's the stuff that makes baked stuff rise lol\nI'd be a 'lil concerned if that's what you put in your hot cocoa XD\nYeah. Awful. Idk what they do, it's disgusting and tasteless \n>=(\n\nWell...\nWhat if you go to repositories and sort by most recently updated? If you updated it last at midnight yesterday, that'd say smthn like \"updated 17 hours ago\" and you'd be able to see which one it is...? A private repo updated 17 hours ago. And then go from there? I presume you'd have already tried that, but... XP\nWait, it _is_ on GH, right?\nGood :)\n\"idk what a computer is\" _lol_\nYou need to take lessons from Mr Organisation XD"},{"date":"2023-01-31T22:07:03.769737Z","msg":"Whoa crap, that looks terrific! :DDDD"},{"date":"2023-01-31T16:58:48.948626Z","msg":"Gern geschehen! :D\nIs it based on that?\nAlso\nAre you South African?\n(that was very random, sorry, lol XP)"},{"date":"2023-01-31T16:06:30.782992Z","msg":":D\n\nIdk if you have it in America, but just 100% pure baking cocoa from the brand _______ (if I tell you, you'd figure out where I live [and considering the fact you went onto a global weather website after hearing the temperature here, I wouldn't put it far past ya lol]). But definitely not a premade powder; those _suck._ Always need that S. M. V. touch, ya know? Strong (but not too strong!) on the cocoa, slightly on the lower side for sugar (compliments the \"accessories\" like whipped cream [although I didn't have a very fancy hot cocoa :p]). The _perfection_ ya can't find in a store-bought powder >=P\n\n:D\nCan't blame 'em, but yeah, it'd be quite sad.\n_Wow..._ Idrk you but that sounds _exactly_ like smthn you'd do, lol XD"},{"date":"2023-01-31T15:19:25.073681Z","msg":"Ooh, looking totally awesome! :D\nHopefully no points are deducted, though, like you'd said =/"},{"date":"2023-01-31T12:33:03.370408Z","msg":"Whoo, yay, glad you found it! Or at least that you had it saved somewhere :D\n\nHad hot cocoa again in thine remembrance :p"},{"date":"2023-01-31T10:54:53.840354Z","msg":"Not to sound like a [banana], but do they accept late entries? XP\nAlso, ninjaz hit a 100 :D"},{"date":"2023-01-31T10:39:59.243057Z","msg":"@Promise -\nThey're 'lil creatures despised by most of the world for their mere existence; I think they could use a bit of love, no? :p\n\n@Levi -\nSorry for spam XP"},{"date":"2023-01-31T10:31:09.577259Z","msg":"Great, thanks :))"},{"date":"2023-01-31T02:44:01.571943Z","msg":"H! The entries close in around 2 hours, so might wanna submit this in time :)"},{"date":"2023-01-31T02:37:11.808832Z","msg":"They're really not tho lol\nAs some brilliant person enunciated on _ski.js basix:_ \"And the color... wow! It's like a light shade of lime, but more mellow and soft. And the white background gives it a good look.\"\n\nIn mine, it really does :P\n(sure, GH at some point maybe lol)\n\nOh... [What reason? It's slightly painful to look at XD]\n\nSorry, typo; edited now. I'm actually quite a bit ahead of you, lol. \n(It ends at the same time tho no matter where you live, right? Midnight EST? Or was it MST? In which case it'd no longer be 3 hours, huh...)"},{"date":"2023-01-31T01:51:49.283674Z","msg":"I presume you're speaking of my webpages, eh, not your colour schemes XD\n(In my defence, that was my 3rd web page ever [ofc, though, never excuses for crappiness!] :P)\n\n=P\n\nPerfect =)\n\nNo, tbh, but who cares, lol. Fake it 'til you make it.\n:)\nOki\n\nOh, dang, mate. \nBounce back off the wall? Idk :p\n\n3 hours, 9 minutes, and counting 'til the deadline O.O"},{"date":"2023-01-31T01:36:35.172011Z","msg":"Nahhhhh lol\nHmm, what's that supposed to mean o.O"},{"date":"2023-01-31T01:35:08.75267Z","msg":"Thanks :)"},{"date":"2023-01-31T01:34:13.631046Z","msg":"\"so much effort\" wowwwwwwwwwwwwww, _smh!_ XD\n\nYou're good, lol\nUh-huhhhhhhhhhhh\n\nTbh, I didn't expect that considering how you barely ever change your bio :P\n=)"},{"date":"2023-01-31T00:35:30.440165Z","msg":"Great! :D\nYw! I always love your colour schemes btw :P\nHey, you can't be worse than me and webpages, lol! Ooh, yeah, still can't wait for that :DDD\n\nOf course ;P\nAnd I'll do it whenever I have hot cocoa again :D\nAlLlL mY hOt cOcoAs sHaLl bE dEdIcAtED tO tHe bEsT sAvAge niNja oF tHeM aLl :o\n\nThey asked me if they should make an entry for this round on that program in which you recruited them (and that program was their submission; simple, but still some points are better than none :p)\n\nLife's been awful (almost cried again o.o) so I wanted to make somebody else's day better, and ig that somebody ended up being you <3\n(...If we're talking 'bout the same bio, ofc.\nThere was another bio [I think I changed my bio 9 times just yesterday LOL] in which I said \"Hi, ski!\" so maybe that's what made your day but I doubt it, lol. Or was it the one on wishes? I'm guessing you're talking about the one where I kinda said ily _[platonically]_, right? :p)"},{"date":"2023-01-30T23:27:27.692608Z","msg":"Eh, curve vertexes seem like too much work if the result looks exactly like a rectangle with dots on its sides lol\nMaybe a 'lil bit of inner detailing; a shadow or smthn, for the bedspread, too. Looks too simple. Definitely not bad, but maybe class it up (after finishing the base graphics in time, ofc, that's the most important part)\nThe rug looks cool tho :D\nWell, I mean, yeah, you're right, just normal, but def not bad. Besides, you can't get particularly detailed with books. (**proceeds to make hyper-realistic but also cartoon book** _unless you're me, ofc_ >:3) If you want real, _savage_ criticism, like yours of my WCC webpage, try makin' a just graphic sometime :p\n\nYes, ofc, b'cuz I'm such a nice human being that way, right >:)))\n(Welp I went running and wanted hot cocoa after, oki? XP)\n\nHuh, DL's entry hasn't been submitted yet..."},{"date":"2023-01-30T22:25:35.914714Z","msg":"Heyaa :D\n\nLol, what've you done so far for the pillows? If you haven't, bezier vertexes are perfect for this, and a simple line/bezier for centre detail w/a low-opacity dark-blue fill would look great :D\nThe cartoon book looks pretty good :D\n\nLovin' the enthusiasm, Elsa XD\nEnjoy your food ig lol\n(Currently drinkin' hot cocoa at a random time rn on your behalf :P)"},{"date":"2023-01-30T22:18:30.937204Z","msg":"Lol, I see you changed your username\n_D7D7D7D7D7_ to _thelegendferfer_\nLooks a _bit_ familiar, eh... XD"},{"date":"2023-01-30T22:03:26.071069Z","msg":"=D\nYw! :D\nIt's not very high lol\nBut your choice, ofc :p"},{"date":"2023-01-30T10:42:59.414191Z","msg":"Thanks!"},{"date":"2023-01-30T02:33:47.557016Z","msg":"```that is wrong on so many levels \nand you're gonna end up collapsing \nso pls don't be an idiot \nand stay up 'til two \nfor my sake\noki ninja?`\n- _Chiding ski,_ *S. M. V*.\nUh, bad idea my guy...\nOh yeah, it's night there, huh. Well, bye!\nI probably won't be back online until 5 pm your time tomorrow except for maybe a few minutes at 12 pm your time =p\n\nPerfect :))\n\nNah\nI'm done"},{"date":"2023-01-30T02:11:24.122537Z","msg":"Rather understandably =P\n\nAw, dang. Well... What time does your school end? I usually code during the bus hours. Barely ever code outside that time, but get a solid 2.5-3 hrs a day so maybe you can try doin' it w/out wifi during transportation to and from school (although ig you'd have already thought of that huh) :p\nOki. It's a freakin' competition on _Khan Academy;_ your life and well-being and bloody _sanity_ is more important, so, for goodness' sake, do _not_ code or stay up into the \"wee hours of the morn'\", _okay?_ I'll... _Idk,_ I'll dump my famous hot-cocoa on your head, _ski_ (b'cuz you lost nickname privileges -.-), mate, if you don't take care of yourself! >=(\nWe'll just survive and grind twice as hard in round 2 :P \n[classified info; redacted]\n\nThoughts on TML's replacement [on GH... Dunno if you saw yet, but imo we really should get this resolved _asap_ to fix teams for round 2]?\n\nTL; DR -\nConcern, dump hot cocoa on your head, you're awesome, R2 groups, check GH for TML possible replacement"},{"date":"2023-01-30T00:28:06.023373Z","msg":"I thought that was a bug b'cuz it did the same to me randomly :P\n...\nHow're you holdin' up?"},{"date":"2023-01-30T00:27:08.637965Z","msg":":D\n\nXD\n\nNo it's not lol\n\ngood 4 u by Olivia Rodrigo, XD\nSureeee\n\n:D\n\n=p\nAh. I didn't think many people read bios, 'specially considering my activity level at that time, :P\nTysm :))))\nLife's still kinda super sucky, but gettin' better, I'd like to think =)"},{"date":"2023-01-29T22:45:45.397607Z","msg":"'bout what?"},{"date":"2023-01-29T21:56:57.69366Z","msg":"Thank you!"},{"date":"2023-01-29T21:41:54.576643Z","msg":"Ah. Well, good luck again :)"},{"date":"2023-01-29T19:25:52.672643Z","msg":"So how'd it go?\nThe exam, I mean."},{"date":"2023-01-29T12:23:04.764565Z","msg":"_Bwahahaha_ where the heck does it say that, no, you _definitely_ can't see IPs XD\nPreferably, not, tbh... :p\n\n:)"},{"date":"2023-01-29T00:50:46.900871Z","msg":"Ty :P\n\nAdded, you; check notifs, go to Discussions :))\n\nLookin' good for this style! Nice and minimalistic =)\n\nBtw, for some reason, my answer to the fonts got hidden, idk why v(0-0)v"},{"date":"2023-01-29T00:14:00.636083Z","msg":"Yay c:"},{"date":"2023-01-29T00:13:34.22915Z","msg":"Yea :DD"},{"date":"2023-01-28T23:09:22.689523Z","msg":"*News: Scores*\nHeya, all!\n\nJudging for the Winter Challenge has been finished...\n*The teams' total scores are as follows*:\n_Umbra:_ 44.7\n_Ignes:_ 40.7\n_Hydus:_ 40.1\n_Tellus:_ 29.2\n_Pruina:_ 24.2\n_Caela:_ 8.7\n\n(Whoaaaa, looks like we've a close match goin' on o.O)\n\nTo check personal total scores, go here:\nhttps://www.khanacademy.org/computer-programming/wcc-members-list-stats/6241583619424256\n\nOnce again, good luck! :D"},{"date":"2023-01-28T21:13:40.294987Z","msg":"The Fantabulous Knight :P"},{"date":"2023-01-28T15:10:27.0158Z","msg":"Whoa, whoa, whoa...\nMe: \"Hi\"\nAI: \"I have acrush [sic] on you for the last 6 minutes\"\nMe: \"Uh, I mean, you wouldn't be the first, I guess...?\"\nAI: \"But i'm [sic] the last\"\no.O\nbro this AI is better at flirting than half the guys irl XD"},{"date":"2023-01-28T15:04:01.369371Z","msg":"Ah, I'm sure you'll be fineee =)\nIs this for next year, HS, or are you gonna switch schools in the middle of the school year?"},{"date":"2023-01-28T14:40:24.066986Z","msg":"Thank you, thank you, yes, I'm amazing that way >;)))"},{"date":"2023-01-28T14:38:04.501769Z","msg":"@FF -\nI'm Australian? I didn't know that! >:P\nAlso, thanks, lovin' the respect here, _O Great King_ XD\nGood luck with your exam today :)))"},{"date":"2023-01-28T13:34:01.282446Z","msg":"I like it even more b'cuz of the fantastic username! But credit is ski's ig lol\n\nGraham cracker or mr grammer? XD"},{"date":"2023-01-28T13:31:43.482162Z","msg":"Thank youuuu :D"},{"date":"2023-01-28T04:14:58.912514Z","msg":"I just realised you totally messed (or changed, ig) your usually fantastic grammar with this... One... :P\nmr grammer\ngraham cracker\n_nicknames_ =p"},{"date":"2023-01-28T03:27:05.588954Z","msg":"Oh, wow, _cool!_ :D\nWell, in all honesty... Over summer, I randomly found out I'd gotten un-childed, made a rickroll, felt bad it got on the HL, and then finally decided to make graphics because I'm too dumb for games (although ofc I'm planning on getting better and moving to more complicated stuff) XD"},{"date":"2023-01-27T22:36:32.136951Z","msg":"Ah, coolio :DDD"},{"date":"2023-01-27T22:29:33.503877Z","msg":"Might? What ratelimit? Vote ratelimit?"},{"date":"2023-01-27T22:14:38.569782Z","msg":"Lol, I love whomever answered that the reason they didn't feel well was because they were turning into a zombie\n\n:D\n\nNow I'm just typing stuff in different languages b'cuz why not. It says \"I don't understand that\" to French but then did nothing for Spanish :P"},{"date":"2023-01-27T22:01:34.2693Z","msg":"Wow, idk why but my answer got hidden, smh. Delete the spaces in the URL and it'll work :p\n\n@Arfy -\nNp :)\n\nThat's one of the fantastic things about ski.js: _fonts!_ (@ski can you hire me as marketing manager for ski.js lol) Like in an HTML program, you just import the font in a link in the head, and then when specifying the font as you would in a PJS program, use the imported font.\nEx:\n```\n[foo]\n<link href='https://fonts.googleapis.com/css2?family=Garamond'rel='stylesheet'>\n\n[foo]\n<script>\n    textFont(createFont(\"Garamond\");\n    text(\"heyo, :D! i'm mr savage ninja and i agree that S. M. V. is the best nicknamer in the world ;p\", 10, 10, 300, 300);\n</script>```\nThe text above will be in the font Garamond :D\n\nYup =/"},{"date":"2023-01-27T19:21:18.735392Z","msg":"**winces**\nPlease no no no not online, too! Gahhhhh\n\nYayayay! :DDD"},{"date":"2023-01-27T19:09:11.53913Z","msg":"Lol, I understand it perfect now =P\nPromise had me confuzzled for a hot second there, XD"},{"date":"2023-01-27T19:07:57.612626Z","msg":"Definitely lol"},{"date":"2023-01-27T18:23:53.048967Z","msg":"Lol, Rur helped out with that and then left, presumably b'cuz of the spam XD"},{"date":"2023-01-27T18:22:32.167276Z","msg":"Hiya! :DDD\n_Awwwwwwwwwwwwwwwwwwwwww,_ that _sucksssssss_ ;-;\nFrom the GSCE mocks to the real ones?\n\n;-;\n\nI wish you could join, too!\n\nDang, it'd have been epic lol\nAh, welp =/\nGood luck on your school stuff, though! :D"},{"date":"2023-01-27T18:19:22.657799Z","msg":"Have the accent but don't live there anymore, lol.\nGosh, you have _got_ to be kidding me.\n\nYay! :D"},{"date":"2023-01-27T18:17:05.179663Z","msg":"@Arfy -\nYup, the canvas API is where the graphics are drawn in JS and HTML.\n\nski.js is a library very similar to PJS. \n(Actually, even PJS is a library =P)\nThis project has an example of ski.js: https://www.khanacademy.org/cs/i/5422324483932160\n\nNah, not really. An example is instead of:\n`var thing = function (x, y) {return x * y};`\nyou can do:\n```const thing = (x, y) => {return x * y};`\n\nMy ninja program is PJS, yeah. Unfortunately whilst converting, my laptop had to do a mandated restart and I lost a ton of progress so I just kept it in PJS (I'd done it there and then converted).\n\nEdit:\nOh, oops, looks like ski and I posted at the same time XP"},{"date":"2023-01-27T18:08:16.34947Z","msg":"Wait, what? /pos is an abbreviation for something _negative?_ o.O\nI was not confused before but I am now, lol."},{"date":"2023-01-27T16:00:17.522039Z","msg":"Sure, but later, I'm very busy atm :))"},{"date":"2023-01-27T15:57:50.851612Z","msg":"Bloody _awful,_ lol >:(\n\nYup.\n\nOf course :))"},{"date":"2023-01-27T15:42:13.447578Z","msg":"I answer all comments :D\nI've no life :D"},{"date":"2023-01-27T15:33:39.228775Z","msg":"No, they're active, just haven't done anything, idk why v(0-0)v\n(:D)\n\nYup lol\n\nOh, sorry, I didn't see. Nope, it doesn't show your emails.\nI mean, you can choose to make it public, but I'd much rather not myself, lol.\n:))\n\nOki! :D"},{"date":"2023-01-27T15:21:32.912599Z","msg":"We need a backup graphics dev who was _supposed_ to be [redacted] but they were not... _Doing_... Anything, so you were a _great_ choice (...And my friend ;))\n\nYupp =P\n\nWow, that turned formal real quick lol\nSure, just lmk when you do :D\n\nSorry, random question, but are you a guy or a girl? (sorry XP)"},{"date":"2023-01-27T15:09:22.999963Z","msg":"'twas my idea to recruit you ;p\n\n:D\nI'm actually not sure! Maybe you should ask ski :P\n\nAnd I'm the owner of the private GH repo, can you tell me the account once you make one? No stalkers! :D"},{"date":"2023-01-27T14:59:36.201703Z","msg":"@bronte -\nOfc b'cuz I'm hilarious that way >:D\n(I'm gonna come up with a nickname for you tho)\n\n@Elsa -\nHey, w/out that desperation there's no way ninjaz would be first, lol!\n\n...\n**gasps**\n_You lose nickname privileges!_"},{"date":"2023-01-27T14:37:19.268267Z","msg":"..._Unless one of his nicknames is Elsa_ >;)"},{"date":"2023-01-27T14:33:25.279917Z","msg":"=D\n\nYup, lol B))\n\nI don't particularly go around advertising it, eh? XD\nBut yeah, I definitely do :p\n\n:D"},{"date":"2023-01-27T14:25:27.091731Z","msg":"Yup lol\n\nThat's what you'd think, huh?\nWelp...\nI'm stuck doing systems of equations because they technically can't boot me up further. We had this diagnostic exam (questions change based on your skill level) and I was getting calc lol with the inner (aka dot) product of vectors and I'm forced to do _systems of equations_ which I did in what... Grade 5?! I'm dying back here lol\nExcept science.\nThe science curriculum is great. Chemistry :D\nI hope I get into the high school I want to... Among the best in the world (and _the_ best in my country) :D"},{"date":"2023-01-27T14:10:38.462666Z","msg":"_Jett Burns?_ :o\nThank you!"},{"date":"2023-01-27T14:09:21.631512Z","msg":":D\n\nApparently! XD\n\n>:)\n\nThat's not a good enough reason, XD\n\n\"Maybe I'm too emotionallll/your apathy's like a wounded soullllll...\" (goodness, you had to get that stuck in my head, smh lol)\nWell, I am, and no further proof is necessary =P\n\nUhhhh... Thanks ig even though it's horrific lol\nI will! :D\n\nI don't wanna pry further lol\nYou saw my bio then or smthn?\nAw, tysm... The last bit means a lot :)"},{"date":"2023-01-27T14:04:18.365583Z","msg":"[acknowledgement]\n\n(lol, yeppp\nthey're gonna get into troubleeee >:P)"},{"date":"2023-01-27T14:03:25.926352Z","msg":"Yeah!\n\nOoh, that's really cool! :D\nLOL the video! I never knew there was a course on that on KA! Now I know how I will spend half of the rest of my day, XD\n\nTbh, I kinda like that style of smoke 'cuz it looks more cartoonish, a bit like the clouds in Final Stand :P\nIt fits better with the overall graphic imo lol\n\n=P\nEh.\nWell.\nIf you _can_ be better, _be_ better =p\nPush yourself.\nAchieve the unachievable! :D"},{"date":"2023-01-27T02:43:31.8436Z","msg":"I have that feeling a graphic coder gets when they look at an old graphic of theirs and just barfs lol\n\nEh, oki. I know a fair bit from attempting to guess ski's in the thread, though lol. Good luck, ig! Going to a Magnet school is great until you realise all the people you're surrounded by are still idiots and middle-schoolers are middle-schoolers despite changing schools, smh. I relate to that so _much_ that it's painful XP\nThat's why instead of paying attention in classes, you code! Maybe on KA! Or chat with strangers online! :D"},{"date":"2023-01-27T02:29:05.993777Z","msg":"Hi there Fertive :P\nOh lol\nHow's life?\nI am tremendously bored atm XD"},{"date":"2023-01-27T02:27:01.600301Z","msg":"Anywhere on his profile\nJust send him a message calling him \"mr savage ninja\" or smthn\nYes, it shall be wonderful >:D"},{"date":"2023-01-27T01:18:29.751096Z","msg":"Heya!\n\nOki.\n\nOkay lol XD\n\nEh, not necessarily _new,_ just changing up the design :P"},{"date":"2023-01-27T00:26:50.109615Z","msg":"It's just me testing SVG for the first time\nI'm deleting this project now, lol; got what I wanted from it :))"},{"date":"2023-01-27T00:25:46.91085Z","msg":"Heya\nSure, why not :p"},{"date":"2023-01-26T22:50:05.579445Z","msg":"Looks good :D"},{"date":"2023-01-26T22:47:45.020355Z","msg":"I can do that; I've a program set up to easily do it. You don't need to add 'em up and use a calculator or smthn, lol. My accurate scores'll be good >;P"},{"date":"2023-01-26T22:26:59.138509Z","msg":"Lots of stuff goin' on, I see! XD"},{"date":"2023-01-26T21:41:00.485857Z","msg":"Well, I found a security issue in KA and got it to the right people who got it to the devs who fixed it and now I have a Friendly Hacker badge but that's about the only \"interesting\" thing that happened :P\nAnd I am revamping my subpage but it'll probably still look awful\nAndddd... Yeah. \n\nAnything new with you?"},{"date":"2023-01-26T21:29:39.00303Z","msg":"Oh, lol\n\nNope!"},{"date":"2023-01-26T21:23:44.452692Z","msg":"Russian, if you don't know it already :P"},{"date":"2023-01-26T21:22:57.182801Z","msg":"You changed your username ;-;\nWhyyyyy\nAdd the \"Games\" back, pleaseeee\n_Pleasseeeeeeee_ I beg youuuuuu"},{"date":"2023-01-26T21:04:45.428898Z","msg":"Thanks!\nLol, that's definitely understandable, though XD\n\nSure :)\n\nThanks! :D"},{"date":"2023-01-26T21:03:37.001295Z","msg":"Ikr, that was funny :p"},{"date":"2023-01-26T21:02:55.429609Z","msg":"Yeah =P\n\nThanks! :D\n\nIt says \"mr savage ninja\" in a loop, lol."},{"date":"2023-01-26T21:01:25.342178Z","msg":"Thanks!"},{"date":"2023-01-26T21:00:51.941948Z","msg":"Sometimes, there's really no meaning behind some stuff. Entropy always increases, right? It's like the chaos just built up to a point and then they do stupid stuff for no reason at all. Asking them is pointless. Adrenaline rush. Nothing was \"wrong\", they just _wanted_ to do it.\nIt's not anger, it's being human, then.\nIt's not anger to try and help someone get their grade up whilst keeping yours at a hundred. It's making them do what they _should_ be doing and motivating them. \nI hate false words of love because they're _never_ true. \nTell me I suck and I'll get better. Tell me I'm good and I won't even try.\n\nIf you didn't get angry, where's the line between right and wrong going to be drawn? Laws exist to smooth down righteous anger. If there was no anger, why have laws? Why have stop signs, right? Oh, someone will die because the cars will crash into each other... But if people just got sad and not mad, not _angry,_ they wouldn't bother gaining justice; they'd just accept it and move on. The problem will never be fixed. Really, without anger, society is nothing. We would be at a point where nothing progresses. We _need_ it. \nWe can't \"forgive\" someone if we are unable to recognise the mistake. How do we recognise a mistake? Because it makes someone angry. And that anger is justified. \nForgiveness cannot come without sin and sin cannot be encountered without fury.\n\nI'm not going to say anything about the rest of your message nor promote a discussion on religion on a learning website :P\n\no.O"},{"date":"2023-01-26T20:47:02.572027Z","msg":"Yupp :D\n\nHuh... Guess so, XD\n\nYeah >;)\n\nYou definitely should have! It was epic! And freezing... But epic! :DDD\n\nWell, I didn't =P\nNo, I'm an idiot :P\n\nWell, of course it was the first thing; it's the startup, :P\nBut they are not good. Definitely need to improve that, lol.\n\nWhy did you ask, if I may...?"},{"date":"2023-01-26T17:38:54.547822Z","msg":"Actually, snails and slugs evolved differently so even if you forcefully remove the shell from a snail, it's technically not a slug :P\nBoth are gastropods, though, and the basic separation is those without shells are slugs and those with shells are snails, so yeah :P\n\n---\nLol, thanks! :D\nOki, XD\nYou don't need to be as good as anyone, just as awesome as you can :D"},{"date":"2023-01-26T17:35:47.28944Z","msg":"Thank you! :D"},{"date":"2023-01-26T17:35:19.304059Z","msg":"Thanks :)\n\nYeah, ski's team :D"},{"date":"2023-01-26T17:01:28.146621Z","msg":"Hey, look! A decent graphic! \nS. M. V. from team ninjaz presents...\nhttps://www.khanacademy.org/cs/i/5033281913667584"},{"date":"2023-01-26T15:42:10.137907Z","msg":"Hey, at least they didn't call you Bose-Einstein Condensate! >:D"},{"date":"2023-01-26T15:39:12.201984Z","msg":"Thank you!\nYesss =)))"},{"date":"2023-01-26T15:38:29.671639Z","msg":"Yeah! :D\n\n=)\n\nWho? Lol, ski?"},{"date":"2023-01-26T10:43:12.605934Z","msg":"Thanks!\nA fan? Of _mine?_ I have _fans?_ O.O\nUmm...\nGood luck with that, little brother of Tiki Tika's :D\nAlso, hi! \n...\n...A fan, XD\n_Me._\nHaving a _fan._"},{"date":"2023-01-26T10:40:51.783678Z","msg":":D\n\n=P\nYeah!\n\nXD XD\nYupp, ig so lol\n\n(oh, yeah\nand the parents be _mad_ :P)"},{"date":"2023-01-26T10:38:24.970922Z","msg":"Thank you!\nNO, lol, no tools\nI stopped using 'em _ages_ ago, XD"},{"date":"2023-01-26T10:37:30.136585Z","msg":":D\nYeah! >:D\nRandom question, why'd you change your name from FifthStateofMatter to just Fifth? :p"},{"date":"2023-01-26T10:34:04.304599Z","msg":"Yay >;)))\n\nDull lol no\nThat's what I was saying! You can control anger. But if you cease to get angry then you just won't be able to achieve something. Like if you're in a group and some people are just not doing anything, you have a right to express your anger (_without_ shouting at them) and make 'em do their work. If you don't get angry, would you tell them that? No. Why would you bother? You'd be _perfectly_ fine getting a 60 on the assignment, no? Anger is necessary _and_ healthy :p\n\nYup.\nIf you don't get angry at all, if their breaking all your stuff didn't make you mad, why would you patiently talk to them? Everything is perfect, right? You're not mad about anything! So why'd you bother talking to them in the first place?\n\n:P\n\nYeah, the world sucks\nBut it's a big place and you should explore it :D"},{"date":"2023-01-26T02:24:56.655107Z","msg":"Yup, it's not really a part of the judging =P\n\nOh, okay, thanks for letting me know :)\n\nIdk if I'm popular... :p\n\nNice :D"},{"date":"2023-01-26T02:13:39.197874Z","msg":"Ah, that explains why, lol.\nYay!\nThank you! Wow, is it really that good, XD...?\nAw, thanks =D\n\nAh, yeah, no, I'm definitely not leaving anytime soon, lol, but thanks for the sentiment :)\nDefinitely not goin' with CoC :D"},{"date":"2023-01-26T02:09:43.148426Z","msg":"Lol, thank you :D\n\nIdk, but really, who cares XD"},{"date":"2023-01-26T02:08:41.545893Z","msg":"But...\nIf you had to choose one...\nIf you were taking a multiple-choice exam and the answers were a) homeless and b) naked, and you could only choose one, what'd you choose (lol) =P\n\nThank you! (Bleeding? Blending?)"},{"date":"2023-01-26T02:06:00.232533Z","msg":"C'mon, man... I am most certainly excited! :D"},{"date":"2023-01-26T02:05:21.674965Z","msg":"Vielen Dank!\nNein, du bist auch so gut :D"},{"date":"2023-01-26T02:02:35.8973Z","msg":"*savage\nmr savage ninja >;)"},{"date":"2023-01-26T02:00:53.79597Z","msg":"Sure! As long as you give a 'lil bit of credit, though :p"},{"date":"2023-01-26T01:59:50.30783Z","msg":"Aw, thanks :D"},{"date":"2023-01-26T01:59:25.704555Z","msg":"Really? Cool!\nHaha, thanks :D"},{"date":"2023-01-25T23:50:07.717261Z","msg":"Well... Why not ':P'?"},{"date":"2023-01-25T23:49:08.569615Z","msg":"Aw, thank  you so much! :D"},{"date":"2023-01-25T23:45:12.418571Z","msg":"Ah, cool :D\nINTJ > Introvert, iNtuitive, Thinking, Judging\nOne of the 16 Myers Brigg Types :P\nYou can google up 16 personalities if you wanna know yours (although that test's overall results are highly accurate for a plethora of reasons, it does get the individual letters correct)."},{"date":"2023-01-25T23:42:57.625544Z","msg":"I suppose so =P\n\nOh.\nWell.\nThat's kinda cold, lol."},{"date":"2023-01-25T23:21:29.985032Z","msg":":D\n\n>:D\nYup!\nLesson of the day: don't be a bad snail >=(\n\n(yeah, they gooily slide :p)"},{"date":"2023-01-25T23:20:12.416728Z","msg":"Ah, lookin' forward :P"},{"date":"2023-01-25T23:20:00.394943Z","msg":"Thank you! :D"},{"date":"2023-01-25T23:19:28.686939Z","msg":"It's _implied_ ;P\n(jk)\n\nWow, thank you for that vouch of support, XD"},{"date":"2023-01-25T21:49:35.862792Z","msg":"Ah, lemme see...\n\nYeah, they're fun conversations\nBecause I am, like, _totally_ the most _modest_ and _humble_ person _ever,_ right? XD"},{"date":"2023-01-25T21:47:30.690428Z","msg":"Thanks, I think? :P"},{"date":"2023-01-25T21:46:13.27775Z","msg":":D\n\nNah, it's fine, both are true lol\n\nNot this, that was me trying to get better on my own lol. The 100M was competitive, though =P\nLol, thanks for the moral support!\n:D\n\nOhio, huh\nIs it very cold there?"},{"date":"2023-01-25T21:36:24.375101Z","msg":"Aw, c'mon! You've another mistake! It should now be `false`, lol!\n\n...I love how your username is \"TheAwesomestPersonToEverLive\" and we're having a conversation on this, XD"},{"date":"2023-01-25T21:33:54.818334Z","msg":"Thanks, Limelight! :D\nHow's Embers comin' along? =p"},{"date":"2023-01-25T21:33:17.481181Z","msg":"Thanks! :D\n\nThe snail ran away from home lol\nThat's what I thought! :D\nNah, he's dead; been eaten by a bird, no point feelin' sorry for him any more >=P"},{"date":"2023-01-25T21:31:25.760984Z","msg":"Heh >;)"},{"date":"2023-01-25T21:27:00.448999Z","msg":"Ha! Do you concede? >:D\n\n\"you can def have controlled anger\" > controlled \"anger\" > the existence of anger > angry > angry: \"feeling or showing strong annoyance, displeasure, or hostility; full of anger.\" > \"full of anger\"\n...Therefore, even by having controlled anger, you are still technically getting angry; your point is null and void :P\n\nOh, I'd never blow up in their face! Just take them aside and calmly explain why what they did was wrong, they were a moron, and to never do it again. I mean, I'm still angry, but I express it in a way that is efficiently sharing what I feel whilst not exploding, lol.\n\nI know, I was just joking, don't say sorry again! Smh!\n\nYeah, you don't _need_ to, but occasionally, it's healthier, lol."},{"date":"2023-01-25T21:19:16.399586Z","msg":"Thanks! Well, lol, I'm in team ninjaz so I decided to make a ninja :D\nDid use a reference (usually don't, but was completely out of ideas), but 90% of this is my own making =P\n\nEarth!\n\nFreedom > wings > fly > sky > clouds > white > fluffy > rice?\n\nI have literally done just that\nJump into a lake\nFrom a [small] cliff\nAnd then swim to the waterfall\nAnd then back\nAnd it was FUNNNNNNNNNN :DDDD\n\nBecause I am dome (we shall never forget this >;P)\n\nUh, no, they're _really_ not, XD\n\nOh, you asked because it'd been a long time since I'd posted?"},{"date":"2023-01-25T21:12:39.45297Z","msg":"My 100M is 10.58 :D\nHmm, we'll see. I'm very busy with CoC, WCC, and two other collabs in the making (+ some personal projects and stuff outside of KA) :P"},{"date":"2023-01-25T21:11:08.970372Z","msg":"Yes, lol, b'cuz I am the most _modest_ human being to _everrr_ exist, no? ;D"},{"date":"2023-01-25T21:09:01.084572Z","msg":"Thanks!\n\nMine or in general?\nBoth are true, no doubt! =P\n\nNope, not good, but it's fine 'cuz I sprint, not 1600M :P\nThat's a pretty good time! :D\nWell, I'm also a girl and recently turned 14 so that skews things a bit lol\n\nYou definitely should!\n\nAh, factor in the wind chill and it's down to 7, which is still not horrible but still pretty bad for me from India XD\nWhy would you do that?! Lol!"},{"date":"2023-01-25T20:58:02.336276Z","msg":"Yeah\nBut in 100 metres, I'm quite a bit better than average, lol... =D\n(figured from the pfp [I am, too])\nWow, that's awesome! :D\n(clearly =P\nthis is my first time running long-distance in a _while,_ lol, I really oughtta work on this :P)"},{"date":"2023-01-25T20:39:44.601767Z","msg":"Welp, I got on the team I wanted to be on, and now the others need to watch out! >;)"},{"date":"2023-01-25T20:37:41.967847Z","msg":"Thank you!"},{"date":"2023-01-25T20:37:33.20761Z","msg":"Thanks!"},{"date":"2023-01-25T20:37:25.536319Z","msg":"Thank you!"},{"date":"2023-01-25T17:57:56.9628Z","msg":"That they are, lol!\n\nWhat's your mile time?\n'Cuz I'd kinda like a base to... Idk, compete against b'cuz idrk what a decent mile time is, just that I should be better :P"},{"date":"2023-01-25T17:55:28.627433Z","msg":"Why thank you! :D\n\nI wouldn't say \"stole\" :P"},{"date":"2023-01-25T17:53:04.151647Z","msg":"Idk, nobody's _done_ it in the first place to _negate_ that =P\nEverything can't be something until it is :p"},{"date":"2023-01-25T17:50:47.829877Z","msg":"Lol, I love the name of this alt of yours XD\nThank you, though :D"},{"date":"2023-01-25T17:49:48.158324Z","msg":"@Rur -\nOHHHHH, thank you _so much,_ I'm a _moron!_ :D\nI've put it in the normal format, though, b'cuz that's a 'lil easier to understand :p"},{"date":"2023-01-25T17:30:17.325766Z","msg":"Fourth?! In three minutes?! _Dang,_ O.O\n\nYeah! I do 100 metres, but am trying to improve my long-distance, lol. Also, cross-country, wow, nice! :D"},{"date":"2023-01-25T17:27:07.849126Z","msg":"@bread -\nOh, yeah, that one's definitely awesome :D\nLol, no way this is remotely as good as Starlight Sonata (wow, I screwed up the name, fixed it now XP)\n\n@ice -\nDaniel T is definitely my favourite, followed by NitOwl :D\nOh, noiceeee =p"},{"date":"2023-01-25T17:23:45.229872Z","msg":"Or they just inefficiently drag their home along with them =p\n\nOh, that's really cool, did not know that, :D"},{"date":"2023-01-25T17:22:55.351194Z","msg":"Thanks :D\n\nIt says \"mr savage ninja\" in a loop, if Google Translate was correct XD\n\nIt was, wasn't it >;)"},{"date":"2023-01-25T17:22:14.894098Z","msg":"Thank you :D"},{"date":"2023-01-25T17:22:06.71166Z","msg":":D\nI think it says \"mr savage ninja\" in a loop but idrk, so if someone knew Japanese, it'd be nice for confirmation b'cuz Google Translate is not reliable and idk Japanese XP"},{"date":"2023-01-25T17:20:47.696975Z","msg":"Thanks again :D\n\nIdk if I know you well enough, lol. Sorry :P"},{"date":"2023-01-25T17:19:52.145097Z","msg":"Yay! That's great :D"},{"date":"2023-01-25T16:46:42.65385Z","msg":"@mr savage ninja -\n\"attention to detail\"\n=\nblob arm that someone's already called out as lookin' like a slug, XD\nBut thank you :p\nAlso, do you know what the Japanese characters say? >;)))\n\nIt's not working without it; it draws it for like a second before playing the rest of the scenes; why?\n\n600 x 600 so won't scale well for a wallpaper, though, right, lol\nAnd if I ever decide to make these those things of which I cannot recall the name but people pay money for these graphics online... What are they called again... On the tip of my tongue... Aurghh\n\n@bread -\nWhat's your favourite KA graphic?\nMine's _Starlight Sonata,_ probably =P"},{"date":"2023-01-25T16:32:37.645976Z","msg":"Thank you! :D"},{"date":"2023-01-25T16:32:03.95722Z","msg":"Ikr? \nMe, too, lol. Random thoughts ftw! :D"},{"date":"2023-01-25T16:31:24.720573Z","msg":"Thanks! :D"},{"date":"2023-01-25T16:31:13.784698Z","msg":"Thank you so much! :DD\n\nAh, that solves the mystery, XD"},{"date":"2023-01-25T16:30:45.323748Z","msg":"Thanks! \nYup, it's a katana, the handle's in his hand, and yeah, it's a flying slug, and, also, huh right back to you! ;P"},{"date":"2023-01-25T16:29:46.048229Z","msg":"Thanks!\nDo you know what it says? >=P"},{"date":"2023-01-25T16:29:25.62853Z","msg":"Lol!\nSo...\n_Were_ you first, then? :P"},{"date":"2023-01-25T16:29:03.582338Z","msg":"Like a fantasy book :D\n\nLol, thanks for the support XD\nNow\nSupport me further and call ski mr savage ninja >:D"},{"date":"2023-01-25T16:26:55.015755Z","msg":"Uhh... Let's leave it at that, then XD"},{"date":"2023-01-25T16:26:21.573009Z","msg":"Of course ;P\nFantastic! :D"},{"date":"2023-01-25T15:23:48.573911Z","msg":"Yeah, bloody awesome!\nIdrc either but \"chap\" is not at all a common form of address, even in England, especially not in modern times, lol. But you do you :D\nAh, coolio :p"},{"date":"2023-01-25T15:09:38.190659Z","msg":"Ah, you judgin', MIA? >;D\nFancy havin' you on our judging team =D"},{"date":"2023-01-25T15:07:14.12139Z","msg":"```\n{\n    names: \"S. M. V.\",\n    captain: \"ski\",\n    link: \"https://www.khanacademy.org/cs/i/5033281913667584\"\n},\n```"},{"date":"2023-01-25T15:04:38.760583Z","msg":"Been a bit, aye?\nSomewhat decent:\nRELEASE: 25/1/2023\nhttps://www.khanacademy.org/computer-programming/me-from-team-ninjaz-presents-a-ninja-with-o-a-surprise-ninja/5033281913667584"},{"date":"2023-01-25T10:45:16.584707Z","msg":":D\nOh\n\nLol\nYou stole \"mate\" from me (+ the very occasional \"bloody\" [but they are fantabulous words so no judging lol])\nWhere'dya get \"chap\" from? :p\n(And you know the direct translation is \"man\" or \"boy\", right? :P)"},{"date":"2023-01-25T02:09:14.734283Z","msg":"Yup :p\n\nThanks!\nWho's RP24?\n\nI have just died of cringe re-reading the poem, now two months later, lol. But you're welcome, ig =P\n\n(Wow, _you_ with a whole-hearted comment and me just... _Meh_, who'd have thought XD)"},{"date":"2023-01-25T02:00:03.753926Z","msg":"Still pointless ;p\nIf you get more comfortable whilst angry, you calm down faster, too. Less suppression. You don't blow up. Your fuse last longer.\nLet's say your annoying 'lil sibling and his friend unlocked your room and jumped on your wardrobe and broke it and now clothes are strewn across your room and then they tore a bunch of awesome paintings/drawings from the walls and then mutilated a 'lil design your friend made for you. I mean, I still have a choice, but without a slightly angry reprimand, if nobody _else_ does anything, you kinda have to =/\nWhy the heck... No, lol. I'm trying to defend that it's okay to get angry at times, though."},{"date":"2023-01-24T20:36:26.613481Z","msg":"Well, that's nice to hear... Thanks again :))"},{"date":"2023-01-24T18:52:19.743881Z","msg":"Thank you so much! :D\n\nLol, really?\nThere's alyanna, NL, Galaxy Ranger... So many greats :p\nIdk if I'm that good, heh."},{"date":"2023-01-24T10:25:04.374432Z","msg":"It is stupid, lol. I've found a fair number of people can pull it off. The most important thing is voice _tone_ :p\nNot getting comfortable! Now that is definitely not good! You just shouldn't suppress your anger b'cuz then it'll all blow up at some point, lol.\n\"Aurrghhhhhh, I'm so mad at [...] b'cuz [...]\" or smthn. \"Can you please not do that? You're makin' me kinda angry!\" Idk.\nHmmm."},{"date":"2023-01-24T02:51:48.289633Z","msg":"=p\n\nIt doesn't necessarily. I sing solo, anyways, but in a choir, some high parts sound kinda nice like that if you manage to pull it off.\nYou don't need to get angry. Just be able to healthily show it if you do, ya know? Not saying I get angry often, rather the opposite, but if need be, I should be able to feel comfortable expressing it :P\nHmm."},{"date":"2023-01-24T02:48:29.349487Z","msg":"Great! :D\n\nidek anymore lol:\nUhhh\nIt's not bad...?\n\nteam ninjaz:\nYeah, it's an annual competition."},{"date":"2023-01-23T23:19:11.816613Z","msg":"XD\n\n:P\n\nIdk American football at all, so no comment :p\nNever taken piano lessons, either (self-taught), so again, no comment.\nOkay, this one is actually stupid. There's nothing really wrong singing with your head. It's like a different style. With your chest is really uncomfortable for some people (your diaphragm expands a lot). Now, with the chest sounds fuller. But both of these are actually wrong; you should sing from, like, your stomach, really. The sound should come from lower in your body for the best, richest sound.\nGet angry, don't show it. Still kinda stupid, though; for a healthy relationship, one should be able to express their feelings openly (< me being a hypocrite, lol).\nGet angry, don't show it (x2 :p)."},{"date":"2023-01-23T23:08:59.532513Z","msg":"Thanks :D"},{"date":"2023-01-23T23:08:21.770982Z","msg":"Thanks! :D"},{"date":"2023-01-23T23:06:35.416214Z","msg":"Lol, thank you so much! =D\n\n_Luckyyy..._\nAlthough without a bus I wouldn't be to code this often, so... :p\n\nThanks :DD"},{"date":"2023-01-23T22:17:03.629284Z","msg":"Yupp :p\n\n_Right?_ It's _weird!_ Idk if I can sleep anymore, XD\n\nYeah! Hopefully we'll stay active and make fantastic entries :D"},{"date":"2023-01-23T21:47:18.468007Z","msg":"Ikr?\nAnd then your brain pops this sorta beaut on you: _Is a snail without a shell naked or homeless?\nSmh,_ lol-\nI shall make that my random comment of the day on the next program I am posting.\nWhich might possibly be tomorrow.\nFor CoC\nWhich team ninjaz will win >:D"},{"date":"2023-01-23T20:51:38.850998Z","msg":"*News: Creative Challenge*\n\nHi, all! The Winter Challenge is almost over (only a few hours left!) and results _should_ be posted by midnight, GMT, Friday or Saturday. One quick note: the captain of Hydrus has been changed; Timothy is now cap'n (as TDJ is inactive for the time being).\n\nA thread to submit the Creative Challenge has been opened; entries will be accepted until the 6th of February.  Late entries/those not submitted under the entry thread will not be judged.\n\nAgain, you can put WIPs in the thread =P\n\nAs a reminder (gettin' a 'lil redundant, no?), for all challenges, judging will include the following criteria:\n- Originality & creativity > bonus points for humour, quips, stories ;P\n- Theme\n- Efficiency > an exorbitant number of unnecessary lines may lower your score\n- Code cleanliness > looking for commenting, proper indentation, etc\n- Aesthetics > graphics, colour scheme\n\nEntries will be judged out of 10 points.\nYou will be fairly weighted by skill level (oki, by this, I mean effort :p).\n\nAs always, good luck! :D"},{"date":"2023-01-23T10:27:13.69877Z","msg":"Oh, okay.\n\nDefinitely!"},{"date":"2023-01-23T02:16:07.059178Z","msg":"Huh, why is he going inactive?\nAlright. \nNope, everything's good; thanks for letting me know :)\n\nNice! Good luck :D"},{"date":"2023-01-22T22:55:00.630151Z","msg":"No tutorials...\nProblem-solving ;p\n\nidek anymore lol:\nHighly doubt it's actual demons... XD\n\nteam ninjaz:\nIt's a team in Clash of Code."},{"date":"2023-01-22T03:56:37.891978Z","msg":"Squidward, you have just been booted up back to 'bread' for the 'Mr Savage Ninja' on the leaderboard **clap clap clap** XD\n\n@mr savage ninja -\nAw, you lose me then :c\nWait... Am I that cheap?! :oooo\n(jk, jk, ofc)\n\nWow, mr benevolence...\nWe'll still win tho\n>:D\n\n@Mr Italics -\nActually, really nice captaining; kinda impressed everyone's active on your team lol :D"},{"date":"2023-01-22T03:38:43.244849Z","msg":"Nice. Lots of games, I see. Hmm.\nGood luck :D"},{"date":"2023-01-21T23:29:46.874666Z","msg":"C'mon man lol\n\n:P\n\nThanks lol\n\nName me one rule that's not stupid or pointless that also does not concern the law\n=p"},{"date":"2023-01-21T21:39:11.233023Z","msg":"ski's doing his usual fantastic ski stuff, Liftoff made a homepage, HS's making an awesome game, I've got my thing done, Samwise and TML I honestly don't trust enough to think they're doing anything considering Samwise doesn't really have an idea and TML's game is at 0% completion. Links? Sorry, ik they're somewhere, but I don't really feel like stalking, lol.\n>=D"},{"date":"2023-01-21T20:55:31.963828Z","msg":"Oh, no, lol, just mine. When you said _\"your\",_ I thought you meant \"mine\" not the team's, oop, lol XP\nHmm >:)"},{"date":"2023-01-21T18:36:17.447317Z","msg":"I would if you had GitHub... >=(\nThey're on child-account programs, though, so you can't see them.\nWait 'til Monday >;)))"},{"date":"2023-01-21T18:21:47.017032Z","msg":"Well, then, on behalf of team ninjaz, sorry to rain on your parade, but we're the ones who are gonna win >=D"},{"date":"2023-01-21T17:57:41.578998Z","msg":"Nice :D\n\nWhy team Thunder?\nAny specific reason for that name? :p"},{"date":"2023-01-21T17:48:41.328075Z","msg":"New game, eh, Embers, coolio :D"},{"date":"2023-01-21T14:15:16.592889Z","msg":"For what?\n\nOh, I'm not doing anything bad, lol. Graphics are just \"lazy\" and I'm not \"learning anything\". Which is fair in its own right, but heyyy, I mean, like, 3 hours on the bus doin' nothing = this, v(0-0)v\n\nI've also been doing a _lot_ of stuff outside of KA, too (better HTML/CSS, 3D rendering, reviewing hashing [more of in crypto as opposed to, like, URL hashes] + encryption/encoding + decryption/decoding [even got a Friendly Hacker sun badge for that here :D]), but unlike my sib, I don't share it unless it's good, complicated, not on KA, or I've been stuck for the past three days and Google is not helping, so I _need_ to ask for help (smh-).\n\nHmm? I hate stupid, pointless rules, therefore, I will not abide stupid, pointless rules. Rules are meant to be broken ;)\nBesides, CoC 1st pick, can't let my team/cap'n down =)\nAlso, grey areas are my best friend :D"},{"date":"2023-01-20T22:07:42.107602Z","msg":"No, no, soft fuzzy 'lil cactus <3 lol\n\nAw..."},{"date":"2023-01-20T21:40:24.548709Z","msg":"'lil cactus wants a hug :p\n...\nHow're you holdin' up? How's life been? Hopefully, things are better now...?"},{"date":"2023-01-20T21:00:51.02827Z","msg":"(I totally forgot about this tbh, lol)\n\nDestiny:\nYup. Okay =)\n\nidek anymore lol:\nThanks! Yeah, it's awesome.\n\nteam ninjaz:\nThank you! Yup."},{"date":"2023-01-20T10:37:04.358593Z","msg":"Oh, oki, lol.\n=P\nHobbies? Lol, I've once again been banned from coding graphics, XD\n(Will I follow it? _No._ Have I kinda sweet-talked my way back? _Yes..._ >;))"},{"date":"2023-01-19T12:41:09.023074Z","msg":"@Liftoff -\nCool title :p\n\n@ski -\nLol, oki"},{"date":"2023-01-19T10:54:48.524611Z","msg":"Heya, everyone! Check out team ninjaz' homepage for CoC, made by awesome Liftoff Studios :D\n\nhttps://www.khanacademy.org/computer-programming/team-ninjaz-official-homepage/5403470941437952\n\nAnd I've a pretty nice graphic coming along...\nPerhaps to be released on Monday ;)"},{"date":"2023-01-19T10:52:59.566666Z","msg":"thumbnail.js is epic :p\nAlso\nHi\nski, what're you doing here at 6 am?! o.O"},{"date":"2023-01-19T00:25:03.837256Z","msg":"@Cardstock -\nHeh, yupp =P\n\nOki, ttyl :D"},{"date":"2023-01-19T00:00:10.196577Z","msg":"@Pinecone -\nYou have fantastic taste, too... Favourite HP character? Ron, no doubt, for me, lol.\n\n@Cardstock -\nMIB's really good, you should definitely watch it.\n\n...\nI'll be back in an hour, bye for now!"},{"date":"2023-01-18T23:20:03.909469Z","msg":"Favourite movies? The entire MCU, Mission Impossible, and Men in Black. Also love Knives Out and the Ocean's 11 series :p"},{"date":"2023-01-18T23:07:24.777634Z","msg":"@Pinecone -\nYep, it means \"me, too\" in French :D\nLol, nope!\n\nFavourite show? Full House! It's, like, my childhood TV show. No, that'd be He-Man, ig, but I used to love Full House lol"},{"date":"2023-01-18T22:54:02.436829Z","msg":"Bonjour! Moi aussi! For all of the above =P"},{"date":"2023-01-18T22:00:21.961537Z","msg":"=)\nWhat's happening in a day? \nThat's good :p"},{"date":"2023-01-18T18:32:52.896682Z","msg":"It's fine, still; tysm for asking, m8 :)))\nHow are things on your side?","deleted":true},{"date":"2023-01-18T18:15:51.118468Z","msg":"Yeah lol\n(It's oki, perhaps not the best to share on KA... Thank you for asking, though, life's been kinda crappy, ngl <3)\nLol\nAw, welp... Bye, then XP","deleted":true},{"date":"2023-01-18T17:41:33.800444Z","msg":"Rn, the ceiling =p\nNiceee\nIg I'll leave you to it, then...?","deleted":true},{"date":"2023-01-18T17:40:05.834278Z","msg":"1. SVG image converter?\n2. Ahhh... _Better,_ but yeah, the colours really, _really_ clash. Maybe just back to the same colour as the body?\n(...also, ah... maybe... some credit to moi for the logo? :p)","deleted":true},{"date":"2023-01-18T17:27:21.290677Z","msg":"..._Meh._\nYou?","deleted":true},{"date":"2023-01-17T21:24:43.405396Z","msg":"Ohhh, yeah, you definitely should, mate, that'd be _awesome_ :DDDDD\nLol, you're KA-famous at least, that's fs =D","deleted":true},{"date":"2023-01-17T20:40:44.412975Z","msg":"How is the fact you go to school in-person pii?\n\nWow, lucky! Mine's moronic. They just... Yeah, I mean, there's horrid crap and then they block _Coolmath games_. There are ways around it, though; I use a VPN which gives me different unblocked results for most things, and some kid compiled a list of games into a Google Site, and the school can't block Google Sites, so, like, all's well, ig :D","deleted":true}],"QUESTION":[{"date":"2022-12-22T17:07:25.23002Z","msg":"When does joining start/close? If ski's captain, but b4nned until 10 Jan, who'll make the thread for people to sign up under him?"},{"date":"2022-11-18T21:31:09.851744Z","msg":"Honestly quite flattered, mate, but why don't you make it a spinoff?"}],"COMMENT":[{"date":"2023-03-14T01:43:24.925625Z","msg":"Wow! _Wow!_ What a masterpiece! That shade of white... Ah, such beauty. A polar bear in a snowstorm. Stunning! The jaw-dropping vacancy portrays such a beautiful story; a glimpse into human nature, the future, the emptiness of what is, what has been, what _will_ be. A nihilistic view, certainly, but the feelings expressed in this... This _chef-d'oeuvre_... Are merely _astounding._ Overall, fantastic job; voted up! :D"},{"date":"2023-03-10T02:43:56.088082Z","msg":"Lol, page two... You guys with Hindi vs Tamil with 247 letters, xD... ;-;"},{"date":"2023-03-07T13:03:46.220663Z","msg":"Just letting yk...\n\n_ice to meet you #FirstKhantuber:_\nCould we have an extra day to work on the project for this week? I did most of what I needed to do, but the person I'm working with hasn't had power and hasn't worked been able to work on our project for 4 days now.\n\n_Me:_\nI won't extend the formal deadline, but I'll accept your project late with no penalty :)"},{"date":"2023-03-06T16:56:05.65776Z","msg":"- What is `l` and why is it there lol\n- `b.split(\"\")` is entirely unnecessary\n- `random` doesn't work outside of here which is why I used `Math.random()` :p\n- And `let` > `var` B)\n\nAnd that is why mine (https://www.khanacademy.org/cs/i/5672689696292864, for the random future stalkers) is better =P"},{"date":"2023-03-05T19:44:27.933867Z","msg":"What changed from v8.3 to v8.9? Did you change the default image mode to centre, among other things?"},{"date":"2023-03-05T03:44:31.959509Z","msg":"Whoa, that epic, smooth, minimalist art style is phenomenal! o.o"},{"date":"2023-03-04T02:50:11.969879Z","msg":"mr grammer, how on Earth did you manage to misspell \"shield\" as \"sheild\" _This. Many. Times?!_\n\nI think that comment, \"It is entertaining to call out the grammar of those who call out others,\" was your most teasable comment xD"},{"date":"2023-03-04T02:41:27.915478Z","msg":"I know I'm late, but you literally copied someone else's code, changed a few colours, and then added ellipses onto the right eye. I do not at _all_ believe this deserves 27 votes (1/3rd of the original), but I am not going to flag it. However, the next time you _conveniently_ forget to make a spinoff, you'll most certainly get flagged, so _please_ give due credit; putting a link at the top _does not count_ as such. If you can find the time to copy and paste into a new program, surely you're capable of finding the juicy blue button at the bottom-right of the program titled \"Spin-off\"? \n\nRemember: don't code for votes. Code for yourself. Code to improve. Oki? Good luck :)"},{"date":"2023-02-28T21:10:09.320908Z","msg":"Biscuits aren't pastries, tho, they're literally American cookies (which aren't pastries) 'cept with a different [_ahem_ the _-correct-_ name] :P\n\n(Other than that, totally accurate; I definitely walk around wearing a monocle xD\nAnd a top hat xD\n...But tea is wonderful, lol :d\nNothing beats a proper cup of steaming hot Earl Grey in the morning =P)"},{"date":"2023-02-28T18:55:21.806801Z","msg":"*Sub-thread 2 > CURRENT THREAD; SUB HERE*\n\nPlace a full-stop here (\".\") to resub!\n\nPlease vote up to top for convenience :)\n\n_Do not post anything here if you're not me. You will be flagged, as it will spam a lot of people.\n\n(...'Lot' is still me being cocky, but hey... Whatever xD)_"},{"date":"2023-02-27T22:47:02.497208Z","msg":"That pixel art is pretty freakin' sweet :o\nSo's the rigging :D\nIt could use a 'lil colour tho, the background's an easy fix for that, maybe make it blue instead of grey?\nIt'd be better with a 'lil more juicing, as Longtreader said. Also a menu page and the like would help :p\n\nNoice job, mr bread ? mr maple syrup ? NIKO ? Akbaba :D"},{"date":"2023-02-27T22:47:02.497208Z","msg":"That pixel art is pretty freakin' sweet :o\nSo's the rigging :D\nIt could use a 'lil colour tho, the background's an easy fix for that, maybe make it blue instead of grey?\nIt'd be better with a 'lil more juicing, as Longtreader said. Also a menu page and the like would help :p\n\nNoice job, mr bread ? mr maple syrup ? NIKO ? Akbaba :D","edited":true},{"date":"2023-02-27T22:47:02.497208Z","msg":"That pixel art is pretty freakin' sweet :o\nSo's the rigging :D\nIt could use a 'lil colour tho, the background's an easy fix for that, maybe make it blue instead of grey?\nIt'd be better with a 'lil more juicing, as Longtreader said. Also a menu page and the like would help :p\n\nNoice job, mr bread ? mr maple syrup ? NIKO ? Akbaba :D","edited":true},{"date":"2023-02-27T22:06:08.852996Z","msg":"Well heyo :D\nI'm bored\n(_I actually have enough time rn to be bored, my goodness!_ :oooo)\nSo, _ofc,_ when one is bored, one must go and annoy a mr savage ninja c:\nHow are ya?\nHow's life?\nHmu on GH if it sucks and you don't wanna say here (as per usual :d)\n\nAlso, absolutely love the marketing going on here, lol\nThe fact there's a page designated to why it's better than the others, my gosh xDDD"},{"date":"2023-02-27T16:43:38.303484Z","msg":"You're the infamous Vexcess!\nI think, at least...\nRight?"},{"date":"2023-02-27T16:41:00.60137Z","msg":"Random, lol. \"sweaty child\" xD\nChill\nEmo >:p"},{"date":"2023-02-26T20:07:53.058709Z","msg":"Aw, why thank you c:\nGraphics lord ? logic legend = :D"},{"date":"2023-02-26T20:07:53.058709Z","msg":"Aw, why thank you c:\nGraphics lord ? logic legend = :D","edited":true},{"date":"2023-02-26T20:07:53.058709Z","msg":"Aw, why thank you c:\nGraphics lord ? logic legend = :D","edited":true},{"date":"2023-02-25T22:52:50.822756Z","msg":"Holy crap this is way better lol\n_Finallyyyyy_ released this version, eh? :D\nYay! :DD"},{"date":"2023-02-23T02:25:31.530017Z","msg":"OooOo\nHullo Mr Canadian Maple Syrup! :D\n\nIdk why I'm here, but I'm too lazy to actually work on smthn for my team for CoC, so yeah ig this is what I do now... =p\n\nThis is an awesome graphic :D\nAlthough, you drew out _every, single_ vertex? I could never have enough patience to do that... That's why I use loops _inside_ of `beginShape`/`endShape` =D\n\nWho's your favourite HP character? It's been so long since I've read it, maybe I'll restart... :p"},{"date":"2023-02-21T17:13:26.774741Z","msg":"test"},{"date":"2023-02-16T23:31:08.596352Z","msg":"Mansion is the best ngl :D"},{"date":"2023-02-15T00:45:37.889225Z","msg":"Oh, if you're using the bricks like this, on line 771, change the `let rndm = 80 + random (80)` to `let rndm = 70 + random (45)` because it looks _awful_ atm. I'm not gonna say anything else rn b'cuz you're clearly not done :)"},{"date":"2023-02-12T18:06:32.412509Z","msg":"'tis no longer January :p\n...But I am still hyped :D"},{"date":"2023-02-12T18:01:56.539881Z","msg":"Yes\nGraphic\nI be amazed\n:ooo"},{"date":"2023-02-12T14:17:34.691552Z","msg":"This will probs definitely be the best program in CoC 2023, lol. You're no doubt the best member of team ninjaz :D"},{"date":"2023-02-09T21:32:12.069184Z","msg":"Yeah, life sucks sometimes\nLike lollipops\nBoth sweet and sucky at the same time\n\n(...If it's currently sucky, it'll _have_ to stop sucking b'cuz you'll eventually be left with the weird stick thingy that you _can't_ suck so you'll have to get another lolly to suck but then things are sweet again :p)\n\nSo moral: life sucks like a lollipop but it'll get better and sweeter again :)"},{"date":"2023-02-08T02:53:37.982643Z","msg":"Ooh! Ooh! _Oooooh!_ If the words after the ellipsis is either \"pro gong player\" or \"mr savage ninja\", you have officially made my day :DDDDD\nAlso, I got a pic of the gong XD"},{"date":"2023-02-08T02:06:37.358524Z","msg":"Ah, this explains the sudden spawning of people onto my programs, _lol._"},{"date":"2023-02-06T23:54:11.752574Z","msg":"Coolio.\nVery...\n_Aesthetic_ ;p"},{"date":"2023-02-06T23:49:51.478129Z","msg":"You should've made it stop at 99% and keep loading"},{"date":"2023-02-05T13:13:42.620793Z","msg":"This is so aesthetically pleasing to look at, great job :)))"},{"date":"2023-02-05T00:57:50.596938Z","msg":"*For ski and I*:\n\n_Thread 1 - closes at 99 comments_"},{"date":"2023-02-04T14:23:09.689464Z","msg":"This looks so much better than that one, lol, nice! :D"},{"date":"2023-02-03T22:23:19.690451Z","msg":"Lol, I saw you getting a bit interrogated by the people on the CoC webpage and now I'm super curious as to how you judge :P\n\nCan you (if you have the time), score this? For no reason, really, but it'd certainly satiate my curiosity XD \n\nhttps://www.khanacademy.org/cs/i/5033281913667584"},{"date":"2023-02-02T22:38:37.840099Z","msg":"Hey, this hit a 100, congrats! :D"},{"date":"2023-02-02T22:08:06.193103Z","msg":"Oh dang\nEven though I saw this earlier, I'm gonna say it again, you're amazing at coming up with lyrics o.o\nI hope things are better now... GH to talk (as always ;)) if ya wanna <3"},{"date":"2023-02-01T10:45:59.436045Z","msg":"I am clearly not a judge, but I _can_ see your comment with the scores. Not Timothy's or IA's, though. Although, yours didn't come in the notifs (I may or may not have subbed to this, lol); I wonder why..."},{"date":"2023-01-31T14:51:44.964726Z","msg":"Dieser Projekt es so sch?n! :D\nReminds me of the Parthenon =P"},{"date":"2023-01-31T14:51:44.964726Z","msg":"Dieser Projekt es so sch?n! :D\nReminds me of the Parthenon =P","edited":true},{"date":"2023-01-31T14:51:44.964726Z","msg":"Dieser Projekt es so sch?n! :D\nReminds me of the Parthenon =P","edited":true},{"date":"2023-01-31T10:49:51.242998Z","msg":"Lookin' good, ofc ;)\nMaybe make the sun a less hard-hitting shade? It's bright red rn, maybe something like `rgb (199, 84, 84)`?"},{"date":"2023-01-31T00:01:10.214828Z","msg":":O\n:OO\n:OOO\nThis.\nIs freaking awesome. \n:O\n...Well, we certainly know the winner this round O.O\n\nAlso.\nContrary to popular opinion...\nI actually love spiders :P"},{"date":"2023-01-30T22:15:13.457625Z","msg":"Hihihihiii\n\nYou must be tired of all that fantastic ski-coding goin'  on so I'll just be here to give you company (...and possibly end up distracting you in which case just don't answer my annoying butt :P)\n\nTo make you feel a 'lil better, some good news, you've regained your nickname, mr-savage-ninja-legendary-pro-gong-player-elsa! \n(...Oki, whilst that would have absolutely not made you feel better, comedic relief, at least, _amirite?_ Ig you'd have been coding for like an hour and a half, so have some hot cocoa or smthn and don't overload yourself, mate >;P)"},{"date":"2023-01-30T21:34:19.301574Z","msg":"Yay! It's finally out! :DDD\nLooks great :))\nMaybe make the colours a 'lil darker? They're a tad bit over-powering :P\nAwesome job!"},{"date":"2023-01-30T17:36:38.107366Z","msg":"Whoa, this is epic! O.O\n`vote ++;`"},{"date":"2023-01-28T22:03:19.14517Z","msg":"Are we friends? ^-^"},{"date":"2023-01-27T21:56:05.269755Z","msg":"Apparently its name is Sarah and it's not feeling well because it's turning into a zombie, XD\nAnd then when I asked if it's a girl... No response, lol.\nThis is super cool, though :D"},{"date":"2023-01-27T15:00:52.815961Z","msg":"Heya, Arfy! \nLovely havin' you on our team :D"},{"date":"2023-01-27T14:42:23.081581Z","msg":"Yes, raisin (_ahem,_ pexy, if you will), _pleaseeeeee_ join our team in CoC. It'll be _epic!_ And we'll have a _super_ stacked team! We need ya! :DDDD\n\nCurrently, the team consists of:\nMe (S. M. V.)\nski\nHSstudent16\nLiftoff\n(...and the two people who'll get booted out.)\n\n:p\n_derp_\n(I shall never forget >:P)\n\n_(pls join i beg u for the sake of virtual tea drinkers, plsssssss)_"},{"date":"2023-01-26T21:31:06.794656Z","msg":"'tis empty?"},{"date":"2023-01-25T21:30:48.377732Z","msg":"Oh noes! \nIt looks like you have a mistake in your code!\nLine two: the boolean value is incorrect! \n...Change it to true ;)"},{"date":"2023-01-25T17:31:50.699191Z","msg":"Ah, right, completely forgot, so two hours later:\nSub, please? ^.^\nhttps://www.khanacademy.org/computer-programming/version-20/5153518035451904\n\nOh, yeah, and I'm gonna completely revamp the subpage at some point, so we shall see :P\n\nEdit: Thanks for the 10th 1000 Kelvin I'd have if they still existed :))\nAlso for breaking the voting system again lolll"},{"date":"2023-01-24T20:42:05.457926Z","msg":"Much bouncyyy :o\n\n(2nd one's my favourite =p)"},{"date":"2023-01-23T20:54:35.713213Z","msg":"*CREATIVE CHALLENGE THREAD*\n\nSubmit your entries here!\n\nSubmit entries in the format of:\n_Name\nTeam\nLink_\n\nGood luck! :D\n\n_Please vote this up to 3rd from the top_ :)\n\n*Entries will be accepted until midnight, 6 Feb GMT*."},{"date":"2023-01-22T18:55:13.49433Z","msg":"Masking, huh...\nDoes this help at all? =P\nhttps://www.khanacademy.org/computer-programming/masking-tutorial/5465998447132672\nAs a start, perhaps?"},{"date":"2023-01-20T21:29:00.76924Z","msg":"Aw\nMini cactus :o"},{"date":"2023-01-19T00:27:32.604437Z","msg":"This looks fantastic :D"},{"date":"2023-01-18T17:25:51.114579Z","msg":"Huh, how'd you get the dragon logo to look exactly the same as mine? The webpage looks great, ofc, :D\nAlthough, its fire colour is rather off. Maybe just keep it the same colour as its body? Or at least not a gradient? =P"},{"date":"2023-01-18T02:46:29.697585Z","msg":"Re-subalalaika =D"},{"date":"2023-01-14T04:06:02.731703Z","msg":"Happy early birthday, Raisin [pexy? lol]! :DDD\nHmm, how old are you now, grandpa XD\n16 or 17's my guess =P\n\nGood luck with your final GSCE! What subject?\n\nEnjoy some Earl Grey in the meanwhile\n#virtualteadrinkers\n\nOh, and you're already a star =)\n\nsigned,\n:p\n_derp_"},{"date":"2023-01-13T21:58:04.199902Z","msg":"_A savage ninja!\nAnd `POSTERIZE`!\nTwo of my favourite things!_\n\nFantastic job :DDD\n\nI'll let you smart guys -Mr Italics, Sprout, _bread_- do your thing with efficiency and whatnot, meanwhile, I'll just revel in the savage-ninja-iness of the image the one and only, legendary mr savage ninja chose :D"},{"date":"2023-01-12T22:34:58.684169Z","msg":"Ah, interesting.\nMay I ask why we _want_ a beginner?\n\"2 graphic dev, 3 game devs, 1 beginner\"\n\nAnd why no other web devs? \nYou'd said everybody might be going out of their comfort zone (or something along those lines) earlier on GH, so if there were more webpages to be made, perhaps another person decent at that instead of a beginner?\n\nSorry, I must be very annoying right now (and honestly in general, eh, mr savage ninja) to be questioning your decisions. Trust ya enough to at least _hope_ you know what you're doing, just curious as to the reasoning behind it =P"},{"date":"2023-01-11T22:52:13.209357Z","msg":"**stalky noises intensify**\nI wonder what this'll be..."},{"date":"2023-01-10T20:43:22.886166Z","msg":"*CLOSED*\n----------------\n*WINTER CHALLENGE ENTRIES*\n\nPlease submit your entries here!\nIf you do not submit them in this thread, do not expect them to be judged unless you have a valid reason as to why. Makes makin' sure all entries are accounted for easier on me =)\n\nSubmit entries in the format of:\n_Name\nTeam\nLink_\n\nOnce again, good luck! :D\n\n_Please vote this up to 3rd from the top_ :)\n\n*Entries will be accepted until midnight, 23 Jan GMT*."},{"date":"2023-01-10T10:39:04.631249Z","msg":"*Homepage Challenge Scores*\n\n*Entries*:\n_TDJ\nHydrus\nhttps://www.khanacademy.org/computer-programming/team-hydrus-homepage-wcc-2023/5098540895879168\n\nGoodDayEveryBody\nPruina\nhttps://www.khanacademy.org/computer-programming/pruina-top-secret-headquarters/4871308415909888\n\nsakura\nUmbra\nhttps://www.khanacademy.org/computer-programming/-team-umbra-homepage-/4906946179678208\n\nEryn\nUmbra\nhttps://www.khanacademy.org/computer-programming/wip-team-umbra-homepage/5704988952674304\n\nRedSus\nTellus\nhttps://www.khanacademy.org/computer-programming/team-tellus-webpagepossibly/6062845610999808\n\nReflex\nHydrus\nhttps://www.khanacademy.org/computer-programming/hydrus-team-homepage/4784940587991040\n\nCaptain_Pockets\nUmbra\nhttps://www.khanacademy.org/computer-programming/team-umbra-homepage-wcc-entry/4882317495025664\n\nHSstudent16\nIgnes\nhttps://www.khanacademy.org/cs/i/6101041694687232\n\nsugar\nPruina\n https://khanacademy.org/cs/i/6611647825494016\n\nDominic R.\nIgnes\nhttps://www.khanacademy.org/cs/-/4996077086621696\n\nDarthenschmirtz\nUmbra\nhttps://www.khanacademy.org/computer-programming/umbra-team-hompage/5852286517035008\n\nsgh07\nHydrus\nhttps://www.khanacademy.org/computer-programming/team-hydrus-homepage-wcc-2023/4879321151356928\n\nMJW55\nTellus\nhttps://www.khanacademy.org/computer-programming/top-secret-do-not-look-until-release/6192141323255808\n\nAdriana\nPruina\nhttps://www.khanacademy.org/computer-programming/team-prunia-wcc/6166318788689920\n\nHorizon\nIgnes\nhttps://www.khanacademy.org/computer-programming/potential-team-ignes-homepage/4720646403964928\n\nice to meet you\nUmbra\nhttps://www.khanacademy.org/computer-programming/team-umbra-homepage-wip/4926153877405696\n\nYokieBob\nTellus\nhttps://www.khanacademy.org/computer-programming/homepage/6652893268852736\n\nCylenceScythe\nIgnes\nhttps://www.khanacademy.org/computer-programming/rushed-team-ignes-homepage-entry/5998671132409856\n\nHB_the_Pencil\nCaela\nhttps://www.khanacademy.org/computer-programming/team-caela-homepage/6370753310408704\n_\n\n*Please post scores in the following format*:\n_Name\nTeam\nScore_\n\nThanks!\n\n_Edit: Please vote to top for convenience_ =)"},{"date":"2023-01-09T21:17:56.875216Z","msg":"Hello! I've subbed, of course, quite a while back, in fact. \n\nIt appears as though you know Astro's main. \nMay I coax a tangible answer out of you as to what it is? _Pleaseee?_ UwU :D XD \n(...\n...But really, please please _pleasssssseee?_ ^-^)\n\n...\nAnyways, I see you're doing CoC! :D"},{"date":"2023-01-08T15:01:15.915935Z","msg":"Subbed =)"},{"date":"2023-01-07T15:19:55.30607Z","msg":"Ah, are you resizing Horizon's avatars so it looks better on the webpages?\n\nIf so, I've some links to resized ones already if you like =)"},{"date":"2023-01-06T02:07:59.970749Z","msg":"Lol, what _isn't_ a lie tho, really...\nThe _cake_ most certainly is\n...\nAnyways.\nHope you're better now =)"},{"date":"2023-01-06T01:44:46.308467Z","msg":"Kansas, huh? Foreign packaging, lol.\n\n\"Only one of them can win\" sounds _strongly_ like what got ski roasted by Liam K XD"},{"date":"2023-01-06T01:17:22.171784Z","msg":"_Hello, Barnacle..._\n*Hark, a stalker*! (Who also happens to be the host! :o)\nTop secret? Oooh =P"},{"date":"2023-01-06T00:46:37.036916Z","msg":"Whoaaa! This is awesome! :D\nVote++;"},{"date":"2023-01-05T01:45:49.494645Z","msg":"Ooh, fighting for 2nd on the HL >:D\nVoted up =)"},{"date":"2023-01-03T15:49:56.664348Z","msg":"Sub?\nhttps://www.khanacademy.org/computer-programming/version-20/5153518035451904"},{"date":"2023-01-02T21:01:11.109222Z","msg":"Hello there"},{"date":"2023-01-02T20:06:15.903841Z","msg":"Ayyee the man's alive\nAnd not procrastinating\n_'Tis a miracle!_\n:oooooo\n\nMissed ya, Rocket :D\nWho's it for?\nYou also seem to be rather fond of \"gloopy inky heart\" things, lol"},{"date":"2023-01-02T16:14:01.890609Z","msg":"- *CLOSED* -\n-----------------\n*HOMEPAGE CHALLENGE ENTRIES*\n\nPlease submit your entries here!\nIf you do not submit them in this thread, do not expect them to be judged unless you have a valid reason as to why. Makes makin' sure all entries are accounted for easier on me =)\n\nSubmit entries in the format of:\n_Name\nTeam\nLink_\n\nOnce again, good luck! :D\n\n_Edit: Please vote this up to 3rd from the top... Let's see if we can keep the current challenge's entry thread up there at all times_ :)\n\n*Entries will be accepted until midnight, 9 Jan GMT*.\n\nEdit: _Screw the bugs_ >=("},{"date":"2023-01-02T13:20:42.902835Z","msg":"Hi! I'm not entirely sure if this information got relayed, so I'm going to send it over, just in case. Sorry if it's a repeat =)\n\n_ski:_\n\"my description:\nski is the only returnin' CoC captain an' beat the rest of KA as the winner of CoC's first round last year. there's only one legend.\n\nski is lookin' for those who are willin' to grind day in an' day out an' possess great talent an' skill. those who aren't afraid to lose an' wish to learn more than win. ski believes cooperation an' unity are crucial to success.\n\nmy vote:\nrecreational recreations an' nightmares & dreams.\"\n\n_Also..._\nHe's going to be annoyed by that capital 'S' in his name on the leaderboard XD"},{"date":"2023-01-02T02:02:16.588197Z","msg":"*Umbra Chat Thread*\nFor Umbra members only.\n_Temporary; further discussion will occur in homepages once released._\n\n- *CLOSES AT < 99 COMMENTS* -\n(...Yeah, you must follow this because stuff gets automatically fl4gged at 100...)\n\nOnce it reaches 98, Eryn, tell me in a separate T&T and I'll make another thread =)"},{"date":"2023-01-02T02:02:07.208076Z","msg":"*Pruina Chat Thread*\nFor Pruina members only.\n_Temporary; further discussion will occur in homepages once released._"},{"date":"2023-01-02T02:01:55.28656Z","msg":"*Tellus Chat Thread*\nFor Tellus members only.\n_Temporary; further discussion will occur in homepages once released._"},{"date":"2023-01-02T02:01:41.353647Z","msg":"*Caela Chat Thread*\nFor Caela members only.\n_Temporary; further discussion will occur in homepages once released._"},{"date":"2023-01-02T02:01:28.286126Z","msg":"*Ignes Chat Thread*\nFor Ignes members only.\n_Temporary; further discussion will occur in homepages once released._"},{"date":"2023-01-02T02:01:19.181031Z","msg":"*Hydrus Chat Thread*\nFor Hydrus members only.\n_Temporary; further discussion will occur in homepages once released._"},{"date":"2023-01-02T01:18:26.281671Z","msg":"You replaced the trees! :D\nAlthough, you should probably take off cool guy coding's name saying he made 'em, XD\n\nAlso, on line 138, could you replace it with `ellipse (random (100, 180) + random(25)*sin(frameCount*random(5)), random (200, 20), rndm, rndm);`?  Sorry XP"},{"date":"2023-01-01T20:11:12.592464Z","msg":"**aggressively spam-clicks to watch sword go _boing**_\nLookin' good! \nThe tree trunks are rather disproportionate, though. And inefficiently done.\n=/\n\nHere, replace the inside of the tree function with:\n```\n    pushMatrix();\n    scale(s/80);\n    translate(x, y);\n    \n    noStroke();\n    \n    for (var i = 0; i < 30; i+= 10) \n    {\n        fill (0 + i*3, 0, 0);\n        rect (100 + i, 140, i, 208);\n    }\n    \n    for (var i = 0; i < 100; i++) \n    {\n        var rndm = random(20, 80);\n        fill (0, 100 + i*0.8, 0);\n        ellipse (random (100, 180)+random(5)*sin(frameCount*random(5)), random (200, 20), rndm, rndm);\n    }\n    \n    popMatrix();\n```\nand then add `randomSeed(1);` to the draw function and tell me what ya think... =P"},{"date":"2023-01-01T18:26:06.040878Z","msg":"**stalky noises commence**\n_Hello, there..._\nIs this the collab you and DR are doing? =P\nLooks cool :D\n(Random thought... Ya know how the dirt blocks' lines look like they say RM? What if you change the vertexes [lines 296-309] to smthn looking like your logo? Instead of RM, maybe DR x LG? Idk if that makes sense, but... :p)"},{"date":"2022-12-29T22:56:43.802539Z","msg":"_The good stuff:_\nNot bad! The nav-bar opening is nice, as are the page fade-in animations =)\n\n_Critiques (sorry, but had to be done XP):_\n- Why are the images completely unrelated to the content? \n(Ex: trees for internet, volcano for airplanes, snow for slinkies, beach for microwaves, another volcano for biscuits, grass for robots, and a galaxy for computers)\n- On the nav-bar, the words only show up if you hover _directly_ over them. It's honestly very awkward and not very user-friendly.\n- The fonts. 'Nuff said. They're... Not good, to say the least.\n- On the learning page, whilst hovering over them, they become half transparent and that also looks very awkward. It's also a little confusing, as I expected to be taken to another page if I click it (which is what one would think with a hover animation. Or perhaps I'm just an idiot... v(0-0)v)"},{"date":"2022-12-26T20:01:52.821092Z","msg":"As Timothy said, excellent job running this! Judging was great and well-organised, and all the entries were epic =)\nGreat job to all the teams, and congratulations to team Capravem!\n_(...And if you need a judge next year..._ ;D)"},{"date":"2022-12-26T00:37:11.160657Z","msg":"Cool game! :D"},{"date":"2022-12-23T18:53:26.453394Z","msg":"```translate (200, 170);\nscale (1.8);```"},{"date":"2022-12-23T18:51:50.58791Z","msg":"```translate (210, 169);\nscale (2.2);```"},{"date":"2022-12-23T18:49:51.744893Z","msg":"```translate (210, 125);\nscale (2.4);```"},{"date":"2022-12-23T18:47:36.96239Z","msg":"```translate (210, 123);\nscale (2.2);```"},{"date":"2022-12-23T18:45:48.842033Z","msg":"```\ntranslate (200, 109);\nscale (2.5);```"},{"date":"2022-12-22T23:02:01.860693Z","msg":"This looks really nice! My skin is a bit more tan, maybe `rgb(217, 140, 102);`, so the face's stroke would be `rgb(207, 130, 91);` perhaps =P\nThe [my? lol] hair looks amazing! Ya nailed the colour :D\n(...\n...I also look way more chaotic and would not be caught dead in a dress [black coat and jeans/black leggings ftw!] but if I were to go all fancy, yeah, I'd look like that o.o\nAlso, the dress colour is fantastic)"},{"date":"2022-12-22T21:05:52.577259Z","msg":"Whooo! Can't wait :D"},{"date":"2022-12-21T21:14:22.721209Z","msg":"Whoaaa, this is gonna be one _epic_ collab o.o"},{"date":"2022-12-21T02:10:34.698492Z","msg":"...\n**cries**\n_Am I not your friend?_\n(And yes, ik this was 4 months ago, lol. Did I know you then? Idk =P)\n...\nMy brain can still not comprehend why _five years,_ though! You're either _way_ older than I thought or some magical mysterious guy working in an intelligence agency XD\n...\nWhy'd you put it all in a draw function, btw?"},{"date":"2022-12-20T22:38:01.996277Z","msg":"Subbed =)"},{"date":"2022-12-20T17:53:17.99304Z","msg":"Very nice! :D"},{"date":"2022-12-19T00:25:02.617415Z","msg":"Ooooh!\nLooks very promising... >:D\n\n(accidentally voted up, didn't realise it was a WIP, sorry! XP)"},{"date":"2022-12-17T13:16:23.73431Z","msg":"Congratulations! You're the winner for Ignes! :D\nThese look awesome!\n(Also, as a side note, tysm for putting the entries in a very organised way in the thread, lol.\nNo spam! Yay! <3)\nAnother note:\nOn the individual programs, could you possibly scale them up a bit? Like, `scale(1.5);` and then with the necessary translation. Thanks!"},{"date":"2022-12-17T13:13:05.296579Z","msg":"Hi! \nSorry, I'm a bit of a moron, lol.\nYou've won for Caela! Amazing job! And for Pruina!\nBut... As the colours don't contrast with the background, could you make the `background (0, 0);`? Don't worry, you don't need to change anything about the avatars... They're looking great! I'm going to change the background of the images whilst inserting them into the page so they contrast a bit, enough to see well. Idk if this makes any sense, and I'm really sorry for the confusion (wow, I'm a horrible host lol), but could you set the background as that for all the avatars? \nuwu"},{"date":"2022-12-17T00:43:39.904761Z","msg":"Looks nice! :D\nI'd recommend adding `overflow-x: hidden;` into the body tag in the CSS styling ;)\n(eyyy I'm on the friends list\nand\neyyyy I'm on there, high! =D)\n\n**angry cough**\n_How dare ye not mention the brilliant nicknaming of Cardstock on your page?_\n**scoffs**\n_index card boiiii_ >:DDDDD"},{"date":"2022-12-15T16:59:07.014413Z","msg":"Looks awesome! :D"},{"date":"2022-12-14T23:25:52.822109Z","msg":"Well...\nHere are my thoughts:\n[link redacted]"},{"date":"2022-12-12T20:40:15.623164Z","msg":"I hope you still get notifs; check the spinoffs 'cuz I don't wanna join you in the b4n area but I'd love more info on this bloody _tyrannical_ ruling."},{"date":"2022-12-12T15:56:52.438202Z","msg":"*New thread*\n\n_Same rules apply as 1st thread._\n\n...\nNote: If you join this thread, be prepared for a _lot_ of notifications XP\n\n...\n*A quick disclaimer for fl@g-happy people*\n_Technically, this is not violating any rules._\n\nThey are as follows:\n\n\"Fl@g as abuse\ndisrespectful or offensive, an advertisement\n\nFl@g as a question\nShould be in ?Questions?\n\nFl@g as not helpful\nLow quality, not about the video topic, soliciting votes or seeking badges, a homework question, repeatedly making the same post\n\nFl@g as about the site\nA question about Khan Academy (e.g. ?What software does Sal use??), a post about badges, a technical problem with the site, a request for videos or features\"\n\n_Although certain parts of this thread go off-topic, it clearly does not violate anything above._\n\nFurthermore, in the guidelines it says:\n\"...Social groups or clubs, or projects that generate social chats, and other posts not related to coding, in the discussion thread...\"\n\n_This is regarding the project getting hidden on the HL. This is -not- on the HL. No problem there!\nNeither the guidelines nor fl@gs explicitly state anything to do with off-topic discussion *threads* so it can all be left up to viewer interpretation, making it somewhat easy to argue oneself out of a possible mess..._ >;D"},{"date":"2022-12-12T15:56:52.438202Z","msg":"*New thread*\n\n_Same rules apply as 1st thread._\n\n...\nNote: If you join this thread, be prepared for a _lot_ of notifications XP\n\n...\n*A quick disclaimer for fl@g-happy people*\n_Technically, this is not violating any rules._\n\nThey are as follows:\n\n\"Fl@g as abuse\ndisrespectful or offensive, an advertisement\n\nFl@g as a question\nShould be in ?Questions?\n\nFl@g as not helpful\nLow quality, not about the video topic, soliciting votes or seeking badges, a homework question, repeatedly making the same post\n\nFl@g as about the site\nA question about Khan Academy (e.g. ?What software does Sal use??), a post about badges, a technical problem with the site, a request for videos or features\"\n\n_Although certain parts of this thread go off-topic, it clearly does not violate anything above._\n\nFurthermore, in the guidelines it says:\n\"...Social groups or clubs, or projects that generate social chats, and other posts not related to coding, in the discussion thread...\"\n\n_This is regarding the project getting hidden on the HL. This is -not- on the HL. No problem there!\nNeither the guidelines nor fl@gs explicitly state anything to do with off-topic discussion *threads* so it can all be left up to viewer interpretation, making it somewhat easy to argue oneself out of a possible mess..._ >;D","edited":true},{"date":"2022-12-12T15:56:52.438202Z","msg":"*New thread*\n\n_Same rules apply as 1st thread._\n\n...\nNote: If you join this thread, be prepared for a _lot_ of notifications XP\n\n...\n*A quick disclaimer for fl@g-happy people*\n_Technically, this is not violating any rules._\n\nThey are as follows:\n\n\"Fl@g as abuse\ndisrespectful or offensive, an advertisement\n\nFl@g as a question\nShould be in ?Questions?\n\nFl@g as not helpful\nLow quality, not about the video topic, soliciting votes or seeking badges, a homework question, repeatedly making the same post\n\nFl@g as about the site\nA question about Khan Academy (e.g. ?What software does Sal use??), a post about badges, a technical problem with the site, a request for videos or features\"\n\n_Although certain parts of this thread go off-topic, it clearly does not violate anything above._\n\nFurthermore, in the guidelines it says:\n\"...Social groups or clubs, or projects that generate social chats, and other posts not related to coding, in the discussion thread...\"\n\n_This is regarding the project getting hidden on the HL. This is -not- on the HL. No problem there!\nNeither the guidelines nor fl@gs explicitly state anything to do with off-topic discussion *threads* so it can all be left up to viewer interpretation, making it somewhat easy to argue oneself out of a possible mess..._ >;D","edited":true},{"date":"2022-12-12T01:33:20.681484Z","msg":"I would appreciate some credit as you used my subpage as a base for yours, then decided to make a template on one with much of the same code/style..."},{"date":"2022-12-07T02:55:58.199305Z","msg":"Smart way to get characters XD\n\n...\n...Made one though... :P"},{"date":"2022-12-06T21:09:35.919127Z","msg":"The size is fine, nice job! :D"},{"date":"2022-12-05T23:53:35.912197Z","msg":"Awesome game! :D \nVote ++;\n(...Lol, only thing is, your game is gonna overtake my animation at the top 'o the list for sure XD)"},{"date":"2022-12-05T19:19:19.885328Z","msg":"Is filler text lorem ipsum?\n\n(Def not stalking for CoC, _definitely_ not, most certainly... O.O\nBut are you making the page for it this year? :P)"},{"date":"2022-12-05T15:13:12.362901Z","msg":"Sub? It'd make my day :D\n\nhttps://www.khanacademy.org/computer-programming/version-20/5153518035451904"},{"date":"2022-12-04T20:27:20.747279Z","msg":"?Muy bonito! :D"},{"date":"2022-12-04T20:27:20.747279Z","msg":"?Muy bonito! :D","edited":true},{"date":"2022-12-04T20:27:20.747279Z","msg":"?Muy bonito! :D","edited":true},{"date":"2022-12-03T23:06:29.490774Z","msg":"Subbed! :D"},{"date":"2022-12-03T19:35:02.013281Z","msg":"_8 months later:_\n\n(Here's a notif, so you're not 'ever so slightly disappointed' [from flash lol]! :D)\n\nBut these are hilarious XD XD\n\n...\nPJS vs HTML\nSQL > ;-;\n\n- PJS is fun but useless\n- HTML is _so_ rewarding with CSS\n- SQL is boring ngl\n\n...\n_Dying goats?!_ XD XD\n\n...\nWait, have you stalked me whilst trying to find out where I'm from? o.O\n\n...\noooOooohhhh trash talk contests are the best!\n(...Had one with ski once... Great, ngl **smirks**)"},{"date":"2022-12-02T01:11:51.139134Z","msg":"**gasps**\nYessssss! _Cardstock!_ Yesssss! >:DDDDDDDD\nI shall accomplish my goal! YEsSsSsSssSSSssssSsSs\n\n**smirks**\nWhy, _thank you_ B)\nMy nicknames _are_ rather lovely if I _do_ say so myself >;D"},{"date":"2022-12-01T01:42:18.329853Z","msg":"Whoo, looks great! :D\n:o the KACP shall bow toward my amazingggg nicknames XD XD\n(bonus pts for putting them in the [epic] intro though lol)\n\nAnd.\nFor the 2nd time...\n**deep breath**\n**squeals**\n_Bunnyyyyyyyyyyyyyyyyyyyyyyyy!_ :DDDDDDDDD"},{"date":"2022-11-29T02:03:03.205985Z","msg":"Your graphics were awesome, I hope to see you again sometime :)\n\nFarewell, and I wish you tons of luck in all your endeavours. We'll be eagerly awaiting your return."},{"date":"2022-11-28T14:44:09.358284Z","msg":"*AVATAR CONTEST THREAD*\n\nPlease submit your entries here! :D\n_pls pls pls pls we need them pls pls pls I beg you pls_ XD\n\n_Please vote up for convenience =)_\n\nEdit: Also, can you tell me in the T&T if you plan to make an avatar?\n\nEdit (num 2): Oh, and can you centre the avatar on the canvas? =P\n\nEverybody, these are looking _amazing._ Fantastic job!"},{"date":"2022-11-28T14:43:01.950935Z","msg":"*NEWS THREAD*\n\nI recommend you subscribe to this (comment a full-stop [\".\"] under this thread) to get notified of results, dates, and anything else important.\n\n_Please keep at top for convenience_ =)\n\n*Woah, why did this go from 39 votes to 2*? And the Join Thread? And... _Dang,_ o.o, near everything, tbh.\n_Another bug, I presume...\nUnless somebody is bot-downvoting..._"},{"date":"2022-11-28T14:41:57.293596Z","msg":"*JOINING IS NOW CLOSED*\n________________________\n*JOIN THREAD*\n\nPlease answer the questions above and post them here to get added =)\n\n_Please vote up for convenience._\n\nEdit: Love how around half of you guys are with me and like 'yessss Cardstock >:DDD' and the other half is like 'heck no!' And the other, like, 5% are just confused XD XD\nAce Rogers is my friend, dw, and he's hosting this. I'm trying to annoy him by getting the KACP to call him Cardstock >:D\n\n_NOTE: I may not be able to give you your first choice of teams. If you desperately want to be on one team and find yourself elsewhere, don't hesitate to make your case! :D_"},{"date":"2022-11-26T04:11:54.420135Z","msg":"Okay. We need a 'teams' page. It was a little confusing to read this, and when I'm converting this to a webpage (adding the main content rn), I think it's pretty much necessary to have all the information complete XP\n\nJust give me these and I'll fill in the rest. \n- How many teams are there? \n- What are their names? \n- Are we really doing this avatar contest? \n- What is our fallback if we don't get entries? \n\nWe need all these planned out before going ahead. On your subpage, maybe, could you post an announcement for avatars? Idk. We need entries. \nFurthermore, depending on how many people join, 12 judges seem... More than a little extra. If you changed the number because of me or smthn, I'm totally okay with not judging. Even TCW, with 53 participants has only 5 judges; 4 alternating. So, it might not be feasible to have 12. We've also got to factor in the dreaded inactivity... o.o\n\nAtop this, I have one more question. Are the points by team or individual members?\n\nEdit: ACTUALLY, you know what we should do?! Along with the homepage challenge, make it a homepage AND avatar challenge! That'd be two birds with one stone, so to say! :D\nWe should give 'em team names and then make 'em come up with an avatar for them. But we should allow avatar submissions early. Or just keep them separate... Actually, I think I know what to do >:)\nBut would you rather I reroute them to your page for the avatar contest or have entries in mine? I think it might be best to do a combination of the two; if you get entries (you said you'd only gotten one, hence why I'm asking here as well XP), could you send them to me, so they're all in one area, or vice versa?\n\nI'm sorry, it's extremely late here, I have no idea if anything I said made sense, I'll check back next in a coherent manner..."},{"date":"2022-11-25T23:38:27.730956Z","msg":"Oh, random, and about 5 days late (judging this rn, actually, for TCW), but about the grey colour thing, you could save the colour as a variable and when trying to find the colour just use the variable instead.\n\n```\nvar g = color (r, g, b [< fill these with the rgb colour value]);\n\n[loads of code to otherwise inefficiently search through]\n\nfill (g);\n[shape code & whatever]\n```"},{"date":"2022-11-21T21:21:38.36559Z","msg":"Oh, bronte, we'll miss you a ton! But... Life comes before, right? \nDon't worry at all about disappointing us, we fickle human beings will only be all the more elated when you come back, XD! \nI hope whatever happened gets resolved soon :)\n\nYou're awesome, hope to see ya soon <3\n(And if you ever wanna talk about the sad plight of humanity/life/whatever, I'm hereeeee! :D)"},{"date":"2022-11-21T21:12:54.412791Z","msg":"Awesome graphics and smooth interactions; fantastic job! :D\n\nAlso...\n...\n_brainz_\n**nyomnyomnyom**"},{"date":"2022-11-21T21:09:16.100741Z","msg":"This is amazing! :O\nAwesome work ethic for actually finishing it, too, despite the time it took o.o\n\n(can't vote up yet 'cuz there have been too many requests to the page, but you can bet on one from me! :D)"},{"date":"2022-11-21T12:29:18.386323Z","msg":"This is actually pretty awesome! I might use it, along with the other one, for an animated intro or something. Thanks! :D"},{"date":"2022-11-20T02:41:22.384181Z","msg":"What the _heck,_ how does that work? And why did I literally get myself willingly rick-rolled? XD\n...\n(**stalky noises intensify**)\n([Nah, I was goin' to the Narnia rpg and happened upon this wonderfully click-bait-able title, in case you were wondering how I found this XD])"},{"date":"2022-11-19T14:16:41.277719Z","msg":"I've _no_ idea how I haven't subbed yet XP\nSubbed, lookin' forward to some amazing programs from ya! :D"},{"date":"2022-11-19T04:04:08.175188Z","msg":"Oh, this is stunning! C'est _tres_ bien! Et... Parlez vous francais? \n...Anyways, absolutely love it; amazing job! \nMy favourite part is honestly probably the balcony's railings and the tree's leaves, as well as pretty much the intricacy. Although, for the future, it would probably be more efficient to put the background building in a loop :P \nAwesome job, again!\n\nThe lyrics, though, they got me in a twist.\n\n(Edit: Just realised I'm supposed to be judging this XD... O.O)"},{"date":"2022-11-18T21:47:20.649462Z","msg":"(I'm kinda bored so I'm gonna respond to all these lol)\n\n1. Mine is black or purple :P\n2. I've never read that, lemme add it to my list!\n3. Mine is Iron Man =D\n4. I really don't know what my favourite programmes are, hehe\n5. I love writing, but I also like maths XD\n6. ...Accurate...\n7. _Dang!_ That's a lot!\n8. _Four pages?!_ But swords are amazing!\n9. 300 pages is amazing o.o\n10. I'm not allowed to play video games ;-;\n11. Mine are Believer or Boulevard of Broken Dreams.\n12. I love graphics too!\n13. :O I love Runty already! XD XD\n\n_For the love of Camelot!_\n\nUhhh kinda random, but are you a guy or a girl, if you don't mind my asking?"},{"date":"2022-11-18T00:10:32.306058Z","msg":"My subpage!\n\nhttps://www.khanacademy.org/computer-programming/version-20/5153518035451904"},{"date":"2022-11-14T15:46:49.680733Z","msg":"Wowowowowow you _finally_ released something, omg, I can't believe you haven't procrastinated that much wowowowow XD XD\n\nAnyways, this looks pretty sweet, and purple's my favourite colour so bonus pts there XP"},{"date":"2022-11-13T15:49:30.137374Z","msg":"_Tutorial Requests:_\n\nIf you have any tutorial requests, ask here, and I'll try to make one!\n\nPlease vote up for convenience =)\n\n_No chat threads, only requests (and responses) allowed here :P_"},{"date":"2022-11-11T03:15:14.236275Z","msg":"Ah, very nice job!\nThe lantern and glow are super sweet, as are the special effects =)"},{"date":"2022-11-10T23:35:08.096064Z","msg":"Here, is it working?\n\nEdit: Apparently not, lol"},{"date":"2022-11-08T21:21:53.566695Z","msg":"Subbed!\nArchery? Whoa, cool!\nAnd viola's sweet :P\nPrefer cello, myself, though, lol. 8 instruments is a lot!"},{"date":"2022-11-08T19:43:52.968856Z","msg":"Very nice! One of the best homepages for sure!"},{"date":"2022-11-08T13:50:58.326487Z","msg":"Very nice! =D\n(why beginner tho, you two? XD\n\nAlso, I personally love the colour scheme. Although, if I may ask, why brown for a team with a whale?)"},{"date":"2022-11-08T13:21:45.363645Z","msg":"AAAAAAAAAAAAAAAAA\nSo _this_ is the thingy you've been working on, eh? XD\nIt is almost terrifyingly realistic.\nAlthough...\n_Who is it?_"},{"date":"2022-11-08T02:24:22.780635Z","msg":"Whoa, whoa, whoa. How have I not voted this up yet?!\n\nThis is absolutely, amazingly, stunningly, jaw-dropping. I know I'm certainly late to the party; by half a year, lol, but I'm still gonna give a full description of the awesomeness:\n\n- The textures in the clothing are fantastic. The trousers' shading is super realistic, and the jacket... **chef's kiss**\n- The background is also awesome!\n- I love the hazy feel behind the words\n- The way the words curve and the placing and everything is perfectly done.\n- _The logo. The webs. The shoes. The hands. Everything!_ Un-be-lie-vable o.o\n\nYou could earn some big bucks doing this for a video game company or something :P\n\nOnce again, amazing job!"},{"date":"2022-11-07T22:56:22.641789Z","msg":"1 - Oki\n2 - Me, too, along with black and dark purple.\n3 - I watched all the movies, but haven't read the books XP\n4 - I <3 Legolas!\n5 - Marvel is the best! The MCU is amazing, definitely watch the movies.\n6 - Iron Man. Dr Strange.\n7 - **memories**\n8 - **memories intensify**\n9 - Never watched it\n10 - _...You don't say?_\n11 - Me, too. I don't have any pets though :[\n12 - **googles** AHHHH they're so cute!\n13 - Me, too! Favourite book? Other than LOTR.\n14 - I'd like to read 'em!\n15 - Me, too. For both.\n16 - Do you release them afterwards?\n17 - Me, too!\n18 - I, too, am blank yrs XD\n19 - Hi, blank blank!\n20 - You're not kidding\n21 - The US, I presume. \"@AmericanGuard\"\n22 - I like chocolate.\n23 - Yum, brainz are good XD\n24 - Cool!\n25 - Mine is autumn.\n\nAlso...\n\"556 in the T&T\"\n\nEdit (a month later, for no reason whatsoever, lol): Why does this have 4 votes? o.O"},{"date":"2022-11-06T20:00:39.915037Z","msg":"*OLD > PLEASE RESUB IN THE NEW ONE*\n\n_Sub-thread:_\n\nPut a \".\" in here to sub!\n\nPlease vote up for convenience :)\n\n_Do not post anything here unless you are me. You will be flagged, as it will spam a lot of people.\n \n(...I suppose 'lot' is me being cocky, but hey, whatever XD)_"},{"date":"2022-11-05T01:25:48.641473Z","msg":"Hi! I can't see _any_ of the comments here, presumably because of the KA bug. I'm not sure if you all can see them here either, so here's me checkin' in.\n\n_'Ello there, I exist!_"},{"date":"2022-11-04T23:37:01.383095Z","msg":"Alright! Hmm... I think for autumn, it might look better in the day ('cuz the colours might get affected), but we can do whatever ya like =)"},{"date":"2022-11-04T18:56:12.644873Z","msg":"Wow, that's good! =D\n\nI do have one comment though- for the sake of efficiency, instead of coding out every single vertex, it might be easier to use a for loop, especially for the more intricate parts :P\n\n(You probably don't want to change all this hard work atm, but maybe for next time...? Idk.)"},{"date":"2022-11-04T01:03:04.209097Z","msg":"Yeah :[\n\nSo was I XD\n\nIdrc even if you do, lol\n\nFor a nickname?\nHmMmmMMMmmm...\nHow about...\nCardstock?\n'Cuz an Ace is a playing card! XD\n\nMe, too!\n\nThanks, and also thanks for not voting up! It _is_ a WIP, after all, and it gets very annoying when those are voted up =("},{"date":"2022-11-04T00:47:42.958386Z","msg":"Oops, now in the T&T because this bug is REALLY, _REALLLYYY_ annoying.\n\nEh, idk, it looks strong! And big!\n\nAh, figured XP\n\nHi there!\nIf you keep calling me that tho...\n...I will be forced to come up with an annoying nickname for you XD\n(actually, even if you don't, I probably will, lol)\n\nHuh? No! May I ask what led to that conclusion?\nWe're actually doing a collab. We ended up kinda... Flexing to each other, in a way, and he asked for some more info on some things, so yea, I kinda overloaded ig."},{"date":"2022-11-03T22:06:31.503606Z","msg":"(I can see the comment now, idk what's up with that. But I can't see your comment on the project [but I can in my notifs] :P)\n\nBtw, why did you change your pfp?! Bring back the robot! XD Jk, jk, you do you.\n\nSmiling Monstrous Velociraptors\nSmirking Monkey Vultures\nStupendous Mooing Vaquitas\n...Orrrrr my initials.\nIdk.\nYou decide XD\n\nYeah, I was thinking that too!\n\nI personally prefer autumn and the left side. But it's up to you =)\n\nI'll work on mine on my own program and in the end, we can add 'em together."},{"date":"2022-10-31T09:37:15.933972Z","msg":"Awesome job! Love the colour scheme <3"},{"date":"2022-10-31T00:47:21.704284Z","msg":"Sub, if you feel so inclined!\n\nhttps://www.khanacademy.org/computer-programming/my-subpage/6104697482559488\n\n_Please vote up for convenience! =)_\n\nRandom question (as usual XP):\nWell, the original one I had might not be a good idea to post on here, so idk. This one's a bit more lighthearted compared to my other ones, haha\n\nWhat's the most random thing you've heard someone say?\n\n(_Please do not answer as a comment here. Last time, a lot of people answered and a lot of people got spammed and got annoyed..._)"},{"date":"2022-10-29T21:44:47.428318Z","msg":"Nice! I think this is my favourite of the 4 =)"},{"date":"2022-10-29T17:28:19.711995Z","msg":"Oooohhhh, this is amazing! Superb job! I love the colour scheme and all the little details + glow are fantastic <3\n\n(Hehe my level of surprise at being mentioned in a 'lil special bracket is honestly a bit startling, lol\nBut good to know I won't have to wait forever before releasing mine! XD)\n\nHey, was this what you asked about in my masking tutorial?"},{"date":"2022-10-28T19:58:57.627877Z","msg":"Hey, jsyk, you posted this in Khantober under Sunday's thread but your username says Saturday, so you might want to move the link to the right thread...\n\nAnyways, this is pretty cool, nice job =)"},{"date":"2022-10-28T14:53:03.811878Z","msg":"Oop, I forgot to comment on this earlier :P\n\nActually, that's a lie.\n\nThis is jaw-dropping.\nI'm speechless.\n...And said lack of speech is why I didn't comment XD\n\n_Phenomenal_ job, you two! =D"},{"date":"2022-10-24T17:51:36.816466Z","msg":"W-Wh- You good?\nSounds like _someone's_ hungry!"},{"date":"2022-10-23T12:04:09.386455Z","msg":"_Rebirth,_ maybe, or how about _Core?_\n...or _Ping-Pong Ball of Destruction_ works too, lol\n\nYou're really good at raymarching =)"},{"date":"2022-10-22T18:50:21.496034Z","msg":"Ya know what? I'm so bored rn. I'm gonna respond to all of this XD\n\n1. Well, you're 16 now, right? I'm 13 but turning 14 soon :P\n2. I did this one before!\n3. Kewl :)\n4. You seem like one =D \nI'm not. I've literally been told off for being too rational, actually. Needless to say, that was kinda embarrassing XD\n5. I <3 piano! (more exclamation pts, but they were deleted) I play the keyboard! (By ear though, but I can quite literally play anything :P)\n6. Cool! =D\n7. Got a haircut or smthn?\n8. All yours are good =D\n9. Lucky (though that point had been previously established lol)\n10. Me, too :|\n11. Nahhh, cricket is! =D\n12. Me, too!\n13. WAIT WHAT?! But-but-but...\nYour profile name is silverleaf12! Ranger's Apprentice?! In either case, I love both series =)\n14. That's a lot O.O\n15. Pretty good? I'm sure you're fantastic if you _code_ art this well! I love drawing too, animals, mostly =D\n16. You were, like, 5-6 inches taller than me then, how tall are you now?\n17. Yes! It's so peaceful =)\n18. Wow, that sounds quite cramped!\n19. Never watched it :|\n20. Cool! I can remember numbers and music, but not really words :P\n21. **sighs with you**\n22. Mine is probably Imagine Dragons =)\n23. I used to be _good_ at spelling.\n24. Same here, dude :P\n25. You seem calm\n26. Yes! Human psychology is intriguing!\n27. No, you won't.\n28. Same :P\n29. ...HOW?!\n30. Monkeys\n31. **smirks**\n32. **gasps** _You don't say?!_\n33. THAT. Was the best fact. Smart.\n34. That's fairly evident :)\n35. What?! How?! Why?!\n36. Good at mimicking accents?\n37. Oki, bye then XD"},{"date":"2022-10-21T22:04:27.194733Z","msg":"_Awwwwwww!_ <3\n\n'Lil kitty!\nIt's _perfect!_"},{"date":"2022-10-21T21:29:19.309215Z","msg":"Thanks, dude =)\n\nSo a circle guy with eyes\nShould I make multiple characters with different skin/hair/eye colours? \n(Cuz RPG, so players can choose their own characters)\n\nAnd it's not that bad for midnight XD\nI probably shouldn't be on here at 5 AM many days myself, though XD\n\nI'll do the characters first (before the scenery) so you can work on the animations"},{"date":"2022-10-21T15:25:40.257985Z","msg":"2 of the best graphic makers here makin' a collab together- Can't wait to see how it turns out! =D\n\nGood luck!\n\n(-not voting up cuz WIP-)"},{"date":"2022-10-21T00:53:41.965054Z","msg":"Sweet! =D \n<3 the animations, and I actually really like the title 'cuz the colours are rusty (the colour scheme, lol, not meaning unpractised) and it's in a rustic fashion\n\nHmm, song recommendations, eh?\nDunno why but _Boulevard of Broken Dreams_ by Green Day is looping through my head rn\nSo...\nYeah.\nIdk."},{"date":"2022-10-20T17:40:58.361967Z","msg":"Aww, that's a sweet message =)\n\nThanks for the cookie, btw! (^-^)-?\nHere's some chocolate for you, cuz _someone_ at 'em all XD ?"},{"date":"2022-10-20T17:40:58.361967Z","msg":"Aww, that's a sweet message =)\n\nThanks for the cookie, btw! (^-^)-?\nHere's some chocolate for you, cuz _someone_ at 'em all XD ?","edited":true},{"date":"2022-10-20T17:40:58.361967Z","msg":"Aww, that's a sweet message =)\n\nThanks for the cookie, btw! (^-^)-?\nHere's some chocolate for you, cuz _someone_ at 'em all XD ?","edited":true},{"date":"2022-10-19T19:53:53.179903Z","msg":"Sorry, @TCL :P\n\n*Paradox + cool stuff thread*\n\n_Please vote up for convenience_ =)"},{"date":"2022-10-17T21:53:15.431953Z","msg":"Cool logo, awesome animation =D\n\n\"Tenacious\"\nMy, my, big words, eh? XD"},{"date":"2022-10-16T16:54:09.592702Z","msg":"Sub, if you feel so inclined:\n\nhttps://www.khanacademy.org/computer-programming/my-subpage/6104697482559488\n\n_Please vote up for convenience_ :)\n\nHmm...\nRandom question! (Or _thought_, I suppose, is more like it, lol...)\n\nWhat was there before everything?\nNothing, right?\nThat means _nothing_ existed.\n'Nothing' _can't_ exist, though.\nSo wouldn't that make 'nothing' a paradox?\n\n...\nAlso, I'm thinking of making a self-portrait, what do you guys think?\n\nActually, out of curiosity, what do you guys think I look like?\n\nEdit: Whooooo I'm exactly 60% of the way to my goallllll! =D\n...\nNow 97%!\n102%! =D"},{"date":"2022-10-12T01:08:18.929735Z","msg":"Dude, this is awesome, the lighting, posture, and colours are _perfectttt_, and the drawing-like feel really adds to it :O"},{"date":"2022-10-09T22:58:23.595229Z","msg":"Sub, if you feel so inclined:\n\nhttps://www.khanacademy.org/computer-programming/my-subpage/6104697482559488\n\n_Please vote up for convenience!_\n\nEDIT: You know what? I'm just _really_ bored. So I'm gonna ask a random question and see what you guys think.\n\nSo...\nHmm...\n\nIf tomatoes are fruits, is ketchup a smoothie?"},{"date":"2022-10-07T21:13:57.716224Z","msg":"**to the tune**\n\nThis is gonna make me cry\nHopefully not say goodbyeeeee\nAnd are we still up for the collabbbbb?"},{"date":"2022-10-07T21:09:06.984327Z","msg":"WOAH. This. Is. _Awesome!_ \n\nThe colours and perfect contrast between the yellow and blue are amazing, and the textures are crazy good O.O"},{"date":"2022-10-03T22:20:38.409708Z","msg":"Very nice! :D"},{"date":"2022-10-02T13:53:50.967789Z","msg":"So, I finally got the comments working! And I made a subpage! YAY! =D\n\n...\nWait for it...\n\nSub to me if ya want!\nhttps://www.khanacademy.org/computer-programming/my-subpage/6104697482559488\n\nOhhhhmygoodnessthatfeltamazinggggglol\n\nPlease vote up for convenience :)"},{"date":"2022-09-29T20:39:00.387235Z","msg":"This looks so fun!\n\nMay I join on a Sunday?"},{"date":"2022-09-17T23:44:25.882565Z","msg":"I think it might be more of a primitive response. Ya know? When fish are feeling threatened, they contort their body into a c-shape, which automatically propels them up. Fish all the way down in the sea don't seem to have this ability; only surface-level fish. So if they do it, they automatically go into the air cuz that's how their body works. And like @ski and @br?nte said, they might be able to find out the temperature or pressure change. Also, the fact they won't be able to breathe... \n\nIDK. Just a theory. Like humans getting goosebumps, just a flight-or-fight response.\n\nWhat if dogs bring us back sticks cuz they think we like throwing them?\n\nDo you like MBTI? I'm an INTJ :D"},{"date":"2022-09-17T23:44:25.882565Z","msg":"I think it might be more of a primitive response. Ya know? When fish are feeling threatened, they contort their body into a c-shape, which automatically propels them up. Fish all the way down in the sea don't seem to have this ability; only surface-level fish. So if they do it, they automatically go into the air cuz that's how their body works. And like @ski and @br?nte said, they might be able to find out the temperature or pressure change. Also, the fact they won't be able to breathe... \n\nIDK. Just a theory. Like humans getting goosebumps, just a flight-or-fight response.\n\nWhat if dogs bring us back sticks cuz they think we like throwing them?\n\nDo you like MBTI? I'm an INTJ :D","edited":true},{"date":"2022-09-17T23:44:25.882565Z","msg":"I think it might be more of a primitive response. Ya know? When fish are feeling threatened, they contort their body into a c-shape, which automatically propels them up. Fish all the way down in the sea don't seem to have this ability; only surface-level fish. So if they do it, they automatically go into the air cuz that's how their body works. And like @ski and @br?nte said, they might be able to find out the temperature or pressure change. Also, the fact they won't be able to breathe... \n\nIDK. Just a theory. Like humans getting goosebumps, just a flight-or-fight response.\n\nWhat if dogs bring us back sticks cuz they think we like throwing them?\n\nDo you like MBTI? I'm an INTJ :D","edited":true},{"date":"2022-09-09T21:50:02.966171Z","msg":"Put a \".\" in here to sub!\n\nPlease vote up for convenience :)\n\n_Do not post anything in the chat unless you are me. You will be flagged, as it will spam a lot of people._"}],"ANSWER":[{"date":"2023-03-14T15:08:28.076687Z","msg":"- There's no es6 in PJS; _es6 ftw!_\n- This is ski.js, btw, not normal JS in HTML :p\n- Everything is much more efficient and we can _actually_ get rid of Oh Noes :)\n- We can import stuff using the `script` tag\n- _Fonts! Legally!_ :D\n\nAll in all, many advantages, and good question =)"},{"date":"2023-03-13T15:31:46.699533Z","msg":"I will re-release it in a new program.\nIt will only get complete in one week or so."},{"date":"2023-03-12T20:51:06.664711Z","msg":"Apologies, I will go and check right now :)"},{"date":"2023-03-10T22:02:29.474515Z","msg":"It is incomplete; still a WIP :)"},{"date":"2023-03-07T13:01:21.203533Z","msg":"I won't extend the formal deadline, but I'll accept your project late with no penalty :)"},{"date":"2023-03-04T16:03:22.202469Z","msg":"Make multiple for-loops :p"},{"date":"2023-03-01T16:46:20.885608Z","msg":"The skill level really is pointless at this point, tbh, xD\nBut sure, I'll change it once I get the time if you want :)"},{"date":"2023-02-12T14:09:50.051863Z","msg":"Yeah, they're not active. Sure, you can join! Mind if I put you in Caela? They really need active members, smh."},{"date":"2023-02-08T03:27:07.846774Z","msg":"Hmm, depending on how good it is, lol... I'd like to say perhaps 5 or so, though. I'm not sure how much the other judges know SQL; therefore, idk how they'll judge it. But I'll weigh them if they seem unfair (as ik some SQL) =)\nThe point of this challenge is to learn and if the result demonstrates that, the scores will reflect it :)"},{"date":"2023-02-08T00:08:25.101564Z","msg":"Mate, you just got extra points for creativity from me :D\nDefinitely, go ahead =D"},{"date":"2023-02-02T15:02:28.678606Z","msg":"Oki, that should be fine :D"},{"date":"2023-02-01T15:06:08.739744Z","msg":"Yeah, definitely use other stuff, lol. There's only so much you can learn here, XD"},{"date":"2023-02-01T10:29:34.983799Z","msg":"You submitted an entry for the Winter Challenge? I cannot see an entry of yours on the thread on my side; neither can Ace Rogers or the other judges. As to the Creative Challenge, judging has not yet commenced :)"},{"date":"2023-01-31T20:44:05.550201Z","msg":"As long as it's \"little\", sure :D"},{"date":"2023-01-27T18:06:15.368099Z","msg":"They should be released in the next few hours; I'm very sorry for the delay!"},{"date":"2023-01-26T22:55:11.811733Z","msg":"It is for Clash of Code :D"},{"date":"2023-01-26T22:54:31.782915Z","msg":"In all honesty, there are very few things on KA showing how to make graphics, lol. I haven't even completed the courses, XD\nBut...\nIt's just like dragging shapes and vertices to form a shape, which makes a better shape, a better graphic. Throw in some loops and noise, et voila! You can also learn tons by observing the graphics of the legends: Daniel T, NitOwl, Green Ghost... :D"},{"date":"2023-01-25T20:59:45.601864Z","msg":"You can only submit one entry, but I suppose if your collab partner submits the collab and you submit the solo project, it's fine :))"},{"date":"2023-01-23T21:43:23.725818Z","msg":"Yeah, sorry. Looks like you saw the post before I updated it, heh.\n...I'm tired, lol... XP"},{"date":"2023-01-15T00:26:36.852649Z","msg":"Do the challenges and get active again! :D\n(Or, if not, I suppose you can just pretend none of this exists and go back into the ready hole of inactivity, lol.)"},{"date":"2023-01-14T03:20:43.237213Z","msg":"All the entry threads are going to be here because of my horrific memory with stuff like this... Spam should help me remember, lol."},{"date":"2023-01-13T10:36:01.633665Z","msg":"Yeah, you can =)"},{"date":"2023-01-12T18:45:40.948444Z","msg":"There is a thread in the T&T in which you can submit your program by sending me its link."},{"date":"2023-01-12T17:38:00.406871Z","msg":"As many as you can; the goal is to garner points for your team, so you need to participate in individual challenges to gain points. Whether or not that means _all_ of them  is up to you."},{"date":"2023-01-12T00:55:51.51715Z","msg":"I mean, for example, if you watch Frozen and copy Elsa, line for line, then yeah, most likely. But if you watch Frozen and just get _inspiration_ for a program, then probably not, unless it's clearly a poor rip-off."},{"date":"2023-01-11T20:56:24.093536Z","msg":"Nope! Helping and learning from others should never take away points :D"},{"date":"2023-01-10T16:37:05.407736Z","msg":"(Sorry to disappoint, this isn't Cardboard here, XD\n[...B'cuz he doesn't get notifs from this page, ofc])\n\nAnyways, no, sorry, the teams are already finalised."},{"date":"2023-01-10T10:29:44.493598Z","msg":"Edit it as much as you like =)\nThe deadline is only so we have everything accounted for and don't go searching, but you can still edit it really as much as you need."},{"date":"2023-01-10T00:30:41.915784Z","msg":"You should do whatever season it is where you are. So, if you're in the northern hemisphere, winter, but if you're in the southern hemisphere, summer =P"},{"date":"2023-01-05T10:50:23.897176Z","msg":"It would deduct points (for originality and creativity)."},{"date":"2023-01-03T20:45:46.860904Z","msg":"It's Latin.\n\nSure, why not. It's just Latin, lol. Or do you mean the one where you're scrambling the letters...?"},{"date":"2023-01-03T17:36:57.068081Z","msg":"You should find it first up in recents in the tips and thanks =)"},{"date":"2023-01-02T20:52:05.283869Z","msg":"Ah, I meant _unnecessary_ lines, sorry. You definitely would not lose points =)"},{"date":"2023-01-02T19:57:42.737965Z","msg":"It's too late, sorry."},{"date":"2023-01-02T01:59:32.132387Z","msg":"Ah, thank you! I shall create team threads right away. \n\nAlthough, notif spam... o.o, 50 people! We shall see =P"},{"date":"2023-01-02T00:15:03.445524Z","msg":"It's a scene in a collab but unfinished; still a WIP. So I'd prefer it if you didn't vote =)"},{"date":"2022-12-31T23:43:42.537772Z","msg":"It has not begun yet; it will start on the 2nd of January =)"},{"date":"2022-12-25T23:06:55.312836Z","msg":"Using the distributive property, we can go from \n(fx + g)(hx + j) \nto \n(fh)x? + (fj + gh)x + gj\n\n1. fx ? hx = fhx?.\n2. fx ? j = fjx.\n3. g ? hx = ghx.\n4. g ? j = gj.\nAt this point, we have all four... Segments, with lack of a better word... Of our expression written:\nfhx? + fjx + ghx + gj\nFrom here, we can factor out the x.\n(fh)x? + (fj + gh)x + gj\nNow, at the beginning of the video, we had the variables a and b. Let's replace the fj and gh with them.\na = fj\nb = gh\nTherefore, a ? b will be equal to fj ? gh, which we could then rewrite as fhgj, also equal to (fh)(gj).\nNow, let's refer back to the first, unfactored expression we had:\nfhx? + fjx + ghx + gj\nNow that we have (fh)(gj), when looking back at the previous expression, we can see it is the first coefficient (fh) times the constant term (gj).\nSo, \na [aka fj] + b [aka gh] = middle term [fj + gh]\nUsing the commutative property of multiplication, we can reorder the fjgh to see that\na [aka fj] ? b [aka gh] = first coefficient ? constant term\nAnd this is why it all works out in the end.\n\nHope this helps!\n(actually, I hope it's _coherent_ in the first place, lol XD)"},{"date":"2022-12-25T23:06:55.312836Z","msg":"Using the distributive property, we can go from \n(fx + g)(hx + j) \nto \n(fh)x? + (fj + gh)x + gj\n\n1. fx ? hx = fhx?.\n2. fx ? j = fjx.\n3. g ? hx = ghx.\n4. g ? j = gj.\nAt this point, we have all four... Segments, with lack of a better word... Of our expression written:\nfhx? + fjx + ghx + gj\nFrom here, we can factor out the x.\n(fh)x? + (fj + gh)x + gj\nNow, at the beginning of the video, we had the variables a and b. Let's replace the fj and gh with them.\na = fj\nb = gh\nTherefore, a ? b will be equal to fj ? gh, which we could then rewrite as fhgj, also equal to (fh)(gj).\nNow, let's refer back to the first, unfactored expression we had:\nfhx? + fjx + ghx + gj\nNow that we have (fh)(gj), when looking back at the previous expression, we can see it is the first coefficient (fh) times the constant term (gj).\nSo, \na [aka fj] + b [aka gh] = middle term [fj + gh]\nUsing the commutative property of multiplication, we can reorder the fjgh to see that\na [aka fj] ? b [aka gh] = first coefficient ? constant term\nAnd this is why it all works out in the end.\n\nHope this helps!\n(actually, I hope it's _coherent_ in the first place, lol XD)","edited":true},{"date":"2022-12-25T23:06:55.312836Z","msg":"Using the distributive property, we can go from \n(fx + g)(hx + j) \nto \n(fh)x? + (fj + gh)x + gj\n\n1. fx ? hx = fhx?.\n2. fx ? j = fjx.\n3. g ? hx = ghx.\n4. g ? j = gj.\nAt this point, we have all four... Segments, with lack of a better word... Of our expression written:\nfhx? + fjx + ghx + gj\nFrom here, we can factor out the x.\n(fh)x? + (fj + gh)x + gj\nNow, at the beginning of the video, we had the variables a and b. Let's replace the fj and gh with them.\na = fj\nb = gh\nTherefore, a ? b will be equal to fj ? gh, which we could then rewrite as fhgj, also equal to (fh)(gj).\nNow, let's refer back to the first, unfactored expression we had:\nfhx? + fjx + ghx + gj\nNow that we have (fh)(gj), when looking back at the previous expression, we can see it is the first coefficient (fh) times the constant term (gj).\nSo, \na [aka fj] + b [aka gh] = middle term [fj + gh]\nUsing the commutative property of multiplication, we can reorder the fjgh to see that\na [aka fj] ? b [aka gh] = first coefficient ? constant term\nAnd this is why it all works out in the end.\n\nHope this helps!\n(actually, I hope it's _coherent_ in the first place, lol XD)","edited":true},{"date":"2022-12-17T20:16:44.363972Z","msg":"The competition starts on 2 Jan, but you can begin working on the challenges early =)\nHowever, the thread to submit entries will only be opened on the day of the challenges' start."},{"date":"2022-12-17T18:02:23.266038Z","msg":"As long as > 50% of the submitted project is new, yep! :D"},{"date":"2022-12-16T20:51:01.809293Z","msg":"No, these are just in-competition points; ones that I made up. The team with the most points at the end wins =)\n_However,_ you _do_ gain energy points by actively being on KA and coding as well! :D"},{"date":"2022-12-16T18:28:59.876566Z","msg":"Nope, it stands for Processing JavaScript, the highly inefficient (albeit great starting point) language KA uses. It's significantly different from Java Script and not used much in real life."},{"date":"2022-12-15T21:04:32.370962Z","msg":"Hi! It's a coding contest, just in KA Programming. Please refer here for more info:\nhttps://www.khanacademy.org/computer-programming/wcc-2023/5317909013905408"},{"date":"2022-12-14T19:02:12.250336Z","msg":"I'm hosting a contest; these are the participants."},{"date":"2022-12-13T10:20:06.535697Z","msg":"Uh... Uh... o.o\nThere probably _is_ a process, but idk what it is, lol.\n(why is that so funny XD)"},{"date":"2022-12-12T22:51:05.639906Z","msg":"Ah, sorry, I didn't see this. It's mostly how they rated themselves, and I'm at least _somewhat_ trying to give everyone the teams they ask for, and that's kinda just how it ended up..."},{"date":"2022-12-11T20:35:14.236993Z","msg":"Sure! =)"},{"date":"2022-12-10T00:34:29.234881Z","msg":"Sure, but don't credit me. I got it from TDJ's subpage, and he'd gotten it from King, iirc."},{"date":"2022-12-07T20:42:41.977606Z","msg":"It specifies the render mode and makes it 2-dimensional (which is also default, but it must be specified whilst using `createGraphics`)."},{"date":"2022-12-07T01:17:55.519157Z","msg":"Sure, you can do it on PJS if ya like! :D"},{"date":"2022-12-06T16:21:23.392003Z","msg":"The basic HTML takes only, like, 30 minutes; HTML is a very simple language. Adding in the actual content, as opposed to lorem ipsum; let's say an hour. The CSS? Another hour. Let's throw in another half an hour for learning and double-checking; etc. So maybe 3 hours total. But I've been told I'm a fast coder, so idk."},{"date":"2022-12-06T14:53:48.749776Z","msg":"Yeah, I did. Eh, just some simple rhyming and turning mental ranting into something... Not-so-ranty lol."},{"date":"2022-12-06T14:50:04.179812Z","msg":"Well, that's first! :O\nThanks! =D"},{"date":"2022-12-05T23:49:12.859151Z","msg":"Oh! Well... I've 6 collabs racked up atm and a few other people asked me... But maybe if/when it lets up, sure =)"},{"date":"2022-12-04T18:08:54.430485Z","msg":"Yeah, they're fine =)\n(thing is, I've gotta use the thumbnails to insert them here, so I can't really animate them, the reason for that rule XP)"},{"date":"2022-12-03T20:30:46.990638Z","msg":"No, it doesn't ('cuz not everyone is making an avatar and as I hadn't officially listed it with the challenges it wouldn't be fair). Good question! :D"},{"date":"2022-12-03T03:52:15.977997Z","msg":"Okay, I'll remove you =)\n(Ya know, though, you don't need to participate in all of the challenges XP\nLemme know if you change your mind)"},{"date":"2022-12-02T23:04:09.878071Z","msg":"As long as the majority of the design is yours, you're allowed."},{"date":"2022-12-02T20:49:43.716147Z","msg":"We've got some entries for all of them now! :D"},{"date":"2022-12-02T14:14:35.943522Z","msg":"Sure! But the contest starts on January 1st, after the holidays (at least in my country), just fyi."},{"date":"2022-12-02T01:07:39.535247Z","msg":"Of the code? Not really, but perhaps as a tie-breaker =P\n(Hmm... Kinda like the ends justify the means, lol!)"},{"date":"2022-12-01T16:11:16.295236Z","msg":"Hmm... Is Caela okay instead? I'm currently trying to even out the teams =P"},{"date":"2022-12-01T14:53:45.536096Z","msg":"The avatars are due by December 15th."},{"date":"2022-12-01T13:36:23.865534Z","msg":"Sorry, atm, I'm tryin' to even out the teams... But if anything changes, I'll move him."},{"date":"2022-12-01T02:13:24.910595Z","msg":"Sorry, the judges' positions are full."},{"date":"2022-12-01T00:08:14.062623Z","msg":"Ya know, it doesn't _have_ to be white coloured... Light blue, blue, really anything can work if you _want_ it to... =P"},{"date":"2022-11-30T23:25:05.367938Z","msg":"*Official Answer*\n\nYou will see a join thread in the Tips and Thanks area. You are currently in the Questions section."},{"date":"2022-11-30T23:23:12.701028Z","msg":"You're _on_ the question tab rn, m8! But you are supposed to join in the Tips and Thanks, not the questions tab."},{"date":"2022-11-30T22:18:04.952951Z","msg":"All, if you can! :DDDDDD\nI've none for Caela or Pruina iirc, so it'd be a life-saver! =D"},{"date":"2022-11-30T02:42:31.897558Z","msg":"1. Just contests made by the community. There are official contests that you can check out in the 'Contests' tab on the browse projects page.\n\n2. Yes; each person is to create their own project.\n\n3. Yep!\n\n4. That's right.\n\n5. Yep! Why not.\n\n[Oki]"},{"date":"2022-11-29T21:54:59.760142Z","msg":"There is a thread at the top of the T&T. Answer the questions on the Join page of the webpage and I'll add you! :D"},{"date":"2022-11-29T21:53:55.474792Z","msg":"Well, this is probably just me, but I learned HTML and CSS in a day. I had no school and was _super_ bored, so I watched all the KA videos on x2 speed and raced through the challenges, XD\nThis is my 2nd webpage, so as you can see, imo, making something like this is not hard and very fast to learn =)"},{"date":"2022-11-29T18:48:39.360735Z","msg":"To insert into an HTML program, you've gotta use this:\n\n```\n<img src=\"https://www.khanacademy.org/computer-programming/i/[REPLACE-WITH-PROGRAM-ID]/latest.png\">\n```"},{"date":"2022-11-29T17:54:59.691406Z","msg":"Added =)"},{"date":"2022-11-29T17:40:44.261552Z","msg":"Yep, you're on Umbra =)"},{"date":"2022-11-24T02:08:34.98351Z","msg":"You simply forgot to define variable t.\nJust add\n```var t = 0.01;```to the start, and it'll work like a charm :)\n\nThe thing is, I saw how you defined all the variables outside, in the 'variables' section, but that won't work, because the map is inside a named function, so the global variables don't have a scope inside 'em."},{"date":"2022-11-21T23:35:39.826801Z","msg":"Oki! So, you don't want the mountain to move?"},{"date":"2022-11-21T20:48:53.493719Z","msg":"It's my logo; yes, I made it for fun, and no, it's not an actual logo."},{"date":"2022-11-13T22:19:52.056994Z","msg":"Oh, there was a bug in KA. Dw, you weren't hidden or something =P"},{"date":"2022-10-27T20:42:17.393442Z","msg":"Not with the hotlist, but my project list is completely screwed up on my profile."},{"date":"2022-10-26T16:41:52.269343Z","msg":"I have literally no idea-\nI started in June 2022, so I haven't been around that long to know what the 'old thing' was, though v(0-0)v"}]}